{"About/Colophon":{"slug":"About/Colophon","filePath":"About/Colophon.md","title":"Colophon","links":[],"tags":[],"content":"This site is build with Quartz v4, which is a static-site generator that transforms a folder of Markdown files into a website.\nIt’s designed to work well with Obsidian’s features, and that is what I use to write my content. I’m not that deep in the Obsidian ecosystem, and I don’t really use any advanced features, but everything about it, especially PC/Mobile cross-functionality, is pretty good.\nBecause I access my Obsidian Vault on both desktop and mobile, the vault is saved in a weird location in my iCloud drive:\n~/Library/Mobile Documents/iCloud~md~obsidian/Documents/Obsidian/\n\nWhen building this site with Quartz, I have a script that batch-copies the files from my Obsidian vault into the Quartz folder, which it then uses to generate the site. The generated site is pushed to Github, where I have an Action setup to copy the contents of the content/ folder to my VPS.\nI’ve always felt that it’s unwieldy to install static-site generators on the VPS, so I prefer to do the generation on my local machine and just copy over the outputted files."},"About/Site-todo":{"slug":"About/Site-todo","filePath":"About/Site todo.md","title":"Site todo","links":[],"tags":[],"content":"In addition to using this site as a general wiki for my thoughts, I’m eyeing the possibility of migrating my entire blog to this format. I Currently make my site with Jekyll (a great product!) but I have a lot of customization living in each post’s frontmatter, and while I do have a variety of convenience scripts set up, I kind of need to be sitting at my desktop machine in order to create and publish posts.\nWith Quartz, I just add a new file somewhere, slap on a few words, and it’s already a part of my website. I want to see if there is a way to stay within this dead-simple workflow, and somehow recreate the functionality of my current site.\nTodos\n\nGame wiki section\n\n Start writing things about games I am playing\n Micro posts\n\n Start writing micro-posts for my thoughts while playing\n Set up a workflow to easily write/save new files with the correct name and location (Obsidian script, or Shortcuts?)\n Figure out how to display a game’s micro posts on that game’s top page\n\n\n\n\nBlog section\n\n Make a folder for writing blog posts, and copy some over\n Home page display\n\n Figure out how to list recent blog posts on the home page\n Figure out how to display each blog post’s 5-color code + summary\n Figure out a way to automatically populate each post’s 5-color code (and any other frontmatter)\n\n\n Figure out how to set up an RSS feed for just the blog posts\n Migrate all past blog posts\n\n Make sure that the URLs don’t change\n\n\n\n\nOther\n\n Set up automatic deploys (rsync) in Github Actions\n Make a section for Haiku?\n Decide how much I want to change the site’s layout/CSS\n Enable hover pop-up links for only certain links\n\n\n"},"Coding/direnv":{"slug":"Coding/direnv","filePath":"Coding/direnv.md","title":"direnv","links":[],"tags":[],"content":"direnv lets you define environment variables to be loaded only within certain directories. It’s a great way to save secret variables that are project-specific, without cluttering your global shell config.\nInstallation\nbrew install direnv\necho &#039;eval &quot;$(direnv hook zsh)&quot;&#039; &gt;&gt; ~/.zshrc\n\nUsage\necho &#039;export SECRET_TOKEN=&quot;super-secret&quot;&#039; &gt; .envrc\necho &#039;export API_KEY=&quot;12345&quot;&#039; &gt;&gt; .envrc\ndirenv allow\n\nWhenever you cd into this folder, the environment variables will load.\nDon’t commit the secrets!\nAdd to .gitignore:\n.envrc\n"},"games/Chaos-Zero-Nightmare/Duplicating-cards-effectively":{"slug":"games/Chaos-Zero-Nightmare/Duplicating-cards-effectively","filePath":"games/Chaos Zero Nightmare/Duplicating cards effectively.md","title":"Duplicating cards effectively","links":[],"tags":[],"content":"A lot of characters benefit greatly from having a key card duplicated as many times as possible. One time is good, but two times (or even more?) is fantastic.\nEach Copy Card event in Chaos randomly selects 3 cards, of which you choose 1 to copy. If you want your target card to appear as one of the choices, one strategy is to remove as many alternatives as possible.\nInstead of removing basic cards right away, instead remove other characters’ unique cards. By sacrificing their deck’s strength, you can build one deck to be especially strong.\nUnique cards\nSome characters have cards with the Unique attribute, which means they can’t be copied. Some cards gain Unique from Epiphanies. Since Unique cards will not be chosen as Copy targets, you don’t need to remove them in preparation for Copy events.\nPairing characters with these cards will make it a little bit easier to copy the card you are targeting."},"games/Chaos-Zero-Nightmare/characters/Mei-Lin":{"slug":"games/Chaos-Zero-Nightmare/characters/Mei-Lin","filePath":"games/Chaos Zero Nightmare/characters/Mei-Lin.md","title":"Mei-Lin","links":[],"tags":[],"content":"\n  Mei-Lin\n  \n  \n    \n  \n\nMemory Fragments (18/18)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSet BonusesPrimariesLegendary?✅️ 6/6✅️ 6/6✅️ 6/6\n\nTarget Deck (2/5 +2)\n\nBasic shield\n\n Removes\n\n\nRising Dragon Spire\n\n +1 extra hit for every Passion card played\n\n\nSpirit of the Aromata\n\n +20% own damage for every Passion card played\n\n\nUnity of Attack\n\n Move 2 basic cards to hand\n Extra Copy\n\n\nExtras\n\n Aggressive Mutant +Morale\n Copy Aggressive Mutant +Morale\n\n\n\nPotentials (9/9)\n\nBasic Card Upgrade\n\n 10/10\n\n\nUnique Card Upgrade\n\n 10/10\n\n\n3-1 (Ember from Strike)\n\n 1/1\n\n\n5-1 (Increase Strike damage)\n\n 1/1\n Attack above 500\n\n\n5 (Increase Crit %)\n\n 5/5\n\n\n6 (Increase Crit DMG)\n\n 5/5\n\n\n7 (Increase Weak Point DMG)\n\n 1/1\n Attack 861/600\n\n\n"},"games/Chaos-Zero-Nightmare/characters/Mika":{"slug":"games/Chaos-Zero-Nightmare/characters/Mika","filePath":"games/Chaos Zero Nightmare/characters/Mika.md","title":"Mika","links":[],"tags":[],"content":"\n  Mika\n  \n  \n    \n  \n\nMemory Fragments (18/18)\n\n\t\n    Set Bonuses\n    Primaries\n    Legendary?\n  \n  \n    6/6\n    5/6\n    5/6\n  \n\nTarget Deck (4/6)\n\nBasic attack\n\n Remove\n\n\nBasic heal\n\n Remove 1\n\n\nSource of Water\n\n Decrease cost when recovering\n Duplicate\n\n\nBlessing of Waves\n\n Gain shield for overheal\n\n\nTactical Analysis\n\n Upgrade\n\n\n\nPotentials ()\n\nUnique Card Upgrade\n\n 10/10\n\n\n"},"games/Chaos-Zero-Nightmare/index":{"slug":"games/Chaos-Zero-Nightmare/index","filePath":"games/Chaos Zero Nightmare/index.md","title":"Chaos Zero Nightmare","links":["games/Chaos-Zero-Nightmare/characters/Mei-Lin","games/Chaos-Zero-Nightmare/characters/Mika"],"tags":[],"content":"Actively farming characters\n\n  Mei-Lin\n  \n  \n    \n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMemory FragmentsTarget DeckPotentials✅️ 18/18✅️ 2/5 +2✅️ 9/9\nDetails →\n\n  Mika\n  \n  \n    \n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMemory FragmentsTarget DeckPotentials❌️ 0/6❌️ 1/3 +2❌️\nDetails →"},"games/Chaos-Zero-Nightmare/micro/202512041329":{"slug":"games/Chaos-Zero-Nightmare/micro/202512041329","filePath":"games/Chaos Zero Nightmare/micro/202512041329.md","title":"202512041329","links":["Chizuru","games/Chaos-Zero-Nightmare/characters/Mei-Lin","Rin","Tressa","Renoa","Yuki"],"tags":[],"content":"Chizuru is interesting, but doesn’t really add anything new to my lineup since Mei-Lin is already strong single-target.\nObvious synergy is with Rin and Tressa, and I don’t have either of them built. Shame that Renoa’s bullet discard doesn’t trigger Will-o-wisp.\nA strong multi-target attacker is probably what I need, and that makes me wonder if I should have just pulled Yuki. But using her in her showcase was kind of underwhelming and I’m not sold on the character design either.\nSo I think I need to just resist the FOMO and wait for someone I can really get behind."},"games/index":{"slug":"games/index","filePath":"games/index.md","title":"Games","links":[],"tags":[],"content":"This section of the wiki will be for compiling information about the games I play.\nThis includes reference material, notes on personal progression, and my thoughts about the game experience."},"index":{"slug":"index","filePath":"index.md","title":"Invisible Wiki","links":[],"tags":[],"content":"My wiki"}}