{"about/Post-ideas":{"slug":"about/Post-ideas","filePath":"about/Post ideas.md","title":"Post ideas","links":[],"tags":[],"content":"\nJournaling in 2025\nStrudel\n\nstrudel.cc\n\n\n"},"about/Site-todo":{"slug":"about/Site-todo","filePath":"about/Site todo.md","title":"Site todo","links":["notes/Quartz-customizations/Disable-Folder-Listings-for-certain-index-pages"],"tags":[],"content":"In addition to using this site as a general wiki for my thoughts, I’m eyeing the possibility of migrating my entire blog to this format. I Currently make my site with Jekyll (a great product!) but I have a lot of customization living in each post’s frontmatter, and while I do have a variety of convenience scripts set up, I kind of need to be sitting at my desktop machine in order to create and publish posts.\nWith Quartz, I just add a new file somewhere, slap on a few words, and it’s already a part of my website. I want to see if there is a way to stay within this dead-simple workflow, and somehow recreate the functionality of my current site.\nTodos\n\nGame wiki section\n\n Start writing things about games I am playing\n Micro-posts\n\n Start writing micro-posts for my thoughts while playing\n Set up a workflow to easily write/save new files with the correct name and location (Obsidian script, or Shortcuts?)\n Display a game’s micro posts on that game’s top page\n\n\n\n\nBlog section\n\n Make a folder for writing blog posts, and copy some over\n Home page display\n\n List recent blog posts on the home page\n\n And micro-posts?\n\n\n Display each blog post’s 5-color code + summary\n\n\n Set up an RSS feed for just the blog posts\n Obsidian script to publish done drafts\n\n Generate the post’s 5-color code\n Generate tags for the post\n Update the frontmatter\n\n\n Migrate all past blog posts\n\n Make sure that the URLs don’t change\n\n\n\n\nOther\n\n Set up automatic deploys (rsync) in Github Actions\n Disable Folder Listings for certain index pages\n Make a section for Haiku?\n Decide how much I want to change the site’s layout/CSS\n Enable hover hover-over links for only certain links\n\n\n"},"about/ai":{"slug":"about/ai","filePath":"about/ai.md","title":"My AI manifesto","links":[],"tags":[],"content":"This is my personal manifesto for how I will and will not use generative AI. I believe it can be an extremely useful tool in certain situations, but can also have many negative repurcussions if used incorrectly.\n1: Use to expand my abilities, not as a crutch.\nA: Teach me new things\nAs a coding assistant, AI can quickly show me the correct syntax. It can suggest implementations, and teach me how to implement new functions. These are extremely useful, and help me to be exponentially more productive as a hobby developer.\nI must take care to use this as a tool to help me learn and grow. Instead of receiving the AI’s solution and calling it done, I need to understand what it has suggested and why, so that next time I will be better able to produce that answer on my own.\nB: Do things I can’t do\nIf there is a trivial thing that I actually can’t do, and it is a progress blocker, I will use AI to fill in the gaps in my skill. Drawing a logo image for a silly pet project, creating a colorful, abstract background image, etc. It doesn’t make sense for me to learn how to do that for myself, so I feel comfortable delegating that to AI.\nC: Don’t do things I can do\nI do not use AI to write for me. I am able to write for myself, to express my thoughts through words in order to share my ideas with others. I believe that skills deteriorate without practice, and I am afraid of ever losing that ability. I will never delegate my writing, my thinking, and my shaping of ideas.\n2: Treat as a tool for creators, not as a creator unto itself.\nI work in a very creative, collaborative environment so this is very relevant professionally as well. It’s possible for me have an AI generate ideas, texts, and images, and by doing make me seem self-sufficient without collaborators. I will not do that.\nA: Help those who create\nThere are many ways for creative professionals to use AI as a tool within their process. If an artist uses AI somehow to help in the creation of their own art, that feels fine. As above, my hope is that they will use it as a way to expand their capabilities, and not as a crutch.\nB: Don’t try to be a creator\nIt feels wrong for a non-artist to generate images using AI and treat it as creative output. If I need visual artwork as part of a product, it will be created by a human creator. AI creations will not replace human creations.\nAI can be used as a tool through the creative process, but will not be directly creating any part of the finished product. That is the responsibility of the creators, the people, and is too important to be delegated.\nC: Help me to collaborate\nWhile I will always value my ability to communicate through words, sometimes an image can be far more efficient. Finding common ground through concept art, such as by generating many sample images to collectively define what is needed, can be a fast way to reach a shared understanding.\nThe ease of producing many different formats for presenting an idea allows for experimentation in communication, which has possibilities that aren’t even fully explored yet.\nCorollaries\n1B + 2B: Do what I can’t do, while not replacing real creators\nI will use AI to do things that I cannot do, but I will not treat the AI as a creator. Anything I create that directly uses something generated by AI will be presented as a proof-of-concept. I will not treat it as a finished product.\nAnything that I present as a finished product will be ultimately created by people who can take responsibility as creators. Delegating that role to an AI is irresponsible."},"about/colophon":{"slug":"about/colophon","filePath":"about/colophon.md","title":"Colophon","links":[],"tags":[],"content":"This site is build with Quartz v4, which is a static-site generator that transforms a folder of Markdown files into a website.\nIt’s designed to work well with Obsidian’s features, and that is what I use to write my content. I’m not that deep in the Obsidian ecosystem, and I don’t really use any advanced features, but everything about it, especially PC/Mobile cross-functionality, is pretty good.\nBecause I access my Obsidian Vault on both desktop and mobile, the vault is saved in a weird location in my iCloud drive:\n~/Library/Mobile Documents/iCloud~md~obsidian/Documents/Obsidian/\n\nWhen building this site with Quartz, I have a script that batch-copies the files from my Obsidian vault into the Quartz folder, which it then uses to generate the site. The generated site is pushed to Github, where I have an Action setup to copy the contents of the public/ folder to my VPS.\nI’ve always felt that it’s unwieldy to install static-site generators on the VPS, so I prefer to do the generation on my local machine and just copy over the outputted files.\nSince the Markdown content is synced via iCloud, I can even set up a cron task on my home computer to build + deploy every hour."},"about/contact":{"slug":"about/contact","filePath":"about/contact.md","title":"Contact me","links":[],"tags":[],"content":"Please feel free to get in touch! It would make me very happy.\nI don’t get a lot of views here, so I will probably respond very soon.\nYou can reach me via:\n\nThe fediverse at @alex@invisibleparade.com\nEmail at alex.onsager@gmail.com\n\nThanks for reading!"},"about/index":{"slug":"about/index","filePath":"about/index.md","title":"About Me","links":[],"tags":[],"content":"\nMy name is Alex. I grew up near Boulder, CO and spent most of my childhood reading books, playing music, and playing video games. I learned programming by making bad games for my TI-83 calculator. The first things I published online were bad flash websites.\nIn college I studied programming and human-computer interaction. A team of classmates and I made a few apps on Facebook, which eventually turned into a startup. This was the first time I made something that was used by a large number of people. It became my introduction to making real products that have users and make money.\nI have been working at a mobile game company in Japan since 2010. Because my day-job doesn’t currently involve much programming, I like to work on fun projects on the side that let me build things directly.\nPart of the reason I maintain this blog is the hope that it will help me make more connections online. Please feel free to get in touch! It would make me very happy."},"about/now":{"slug":"about/now","filePath":"about/now.md","title":"What I'm doing /now","links":[],"tags":[],"content":"Personal Life\nNothing much has changed for our family these past few years, and that is by design. Work is stable, life is stable, everybody is happy. I am very thankful for that.\nWork\nSince 2022 I have been leading a department that is tasked with making our studio better at creating new games. This involves encouraging all staff to submit game ideas at any time, working with people to strengthen game ideas and create attractive pitches, coaching teams through early development phases, maintaining a corporate strategy for the release of new games, and more. It allows me to work directly with a lot of people throughout the company, and has been tremendously fun.\nHobbies\nIn 2022 I joined a Haiku study group. We decide on a few prompts every month and submit our poems in advance of a meet-up, where we comment on each other’s pieces and have our teacher critique them. Haiku is fascinating because its extreme minimalism (only 17 characters allowed) makes it feel like putting together a puzzle. It is also a great way to learn about nature and Japanese culture.\nLast year I set up GoToSocial as a solo instance to join the Fediverse, and that has been a lot of fun. It’s nice to be social on the internet again. I think this has helped motivate me to update this site more, and I’m having a lot of fun making little updates to the site as well.\nAI tools have been super useful for programming as a hobby. It has made it so much easier to finish and ship my little projects, and I have already developed a slew of little utilities that I use often. I’m still writing words by hand though, because I think being able to organize my thoughts into communicative sentences is such an important skill.\nI also started keeping a physical journal at the beginning of this year, and one month is the longest I have ever kept up the habit so I am hopeful that it will continue. I had always admired people who keep physical journals; I thought it was a wonderful habit. I never could get into it though, and had resigned myself to thinking that I just wasn’t that kind of person. But my wife convinced me that if that is the kind of person I want to be, then it’s worth putting in the effort to make the change.\nSo far, I am really enjoying it. I’m using the most simple interpretation of Bullet Journal. It’s turning to be a super helpful framework to guide the kinds of information I should keep, and the format for recording it."},"games/Chaos-Zero-Nightmare/Characters/Mei-Lin":{"slug":"games/Chaos-Zero-Nightmare/Characters/Mei-Lin","filePath":"games/Chaos Zero Nightmare/Characters/Mei-Lin.md","title":"Mei-Lin","links":[],"tags":[],"content":"\n  Mei-Lin\n  \n  \n    \n  \n\nMemory Fragments (18/18)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSet BonusesPrimariesLegendary?✅️ 6/6✅️ 6/6✅️ 6/6\n\nTarget Deck (2/5 +2)\n\n\n                  \n                  Playstyle \n                  \n                \n\nAggressive Mutant + Confiscation lets me keep using Forbidden: Violence, which quickly becomes 0-cost because of all of the card draw.\nThis interaction then fuels a powerful Rising Dragon Spire.\nBetter versions of Unity of Attack would have been really nice.\n\n\n\nBasic shield\n\n Removes\n\n\nRising Dragon Spire\n\n +1 extra hit for every Passion card played\n\n\nSpirit of the Aromata\n\n +20% own damage for every Passion card played\n\n\nUnity of Attack\n\n Move 2 basic cards to hand\n Extra Copy\n\n\nExtras\n\n Copy Rising Dragon Spire\n Aggressive Mutant +Vulnerable\n Forbidden: Violence\n Confiscation\n Second Confiscation\n\n\n\nPotentials (9/9)\n\nBasic Card Upgrade\n\n 10/10\n\n\nUnique Card Upgrade\n\n 10/10\n\n\n3-1 (Ember from Strike)\n\n 1/1\n\n\n5-1 (Increase Strike damage)\n\n 1/1\n Attack above 500\n\n\n5 (Increase Crit %)\n\n 5/5\n\n\n6 (Increase Crit DMG)\n\n 5/5\n\n\n7 (Increase Weak Point DMG)\n\n 1/1\n Attack 861/600\n\n\n"},"games/Chaos-Zero-Nightmare/Characters/Mika":{"slug":"games/Chaos-Zero-Nightmare/Characters/Mika","filePath":"games/Chaos Zero Nightmare/Characters/Mika.md","title":"Mika","links":[],"tags":[],"content":"\n  Mika\n  \n  \n    \n  \n\nMemory Fragments (18/18)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSet BonusesPrimariesLegendary?✅️ 6/6✅️ 6/6✅️ 6/6\n\nTarget Deck (4/6 + 3)\n\nBasic attack\n\n Remove\n\n\nBasic heal\n\n Remove 1\n\n\nSource of Water\n\n Decrease cost when recovering\n Duplicate\n\n\nBlessing of Waves\n\n Gain shield for overheal\n\n\nTactical Analysis\n\nUpgrade\n Draw 1 (Divine)\n\n\nExtras\n\n Attack!\n Rally\n Wanderer of the Void\n\n\n\nPotentials (0/4)\n\nUnique Card Upgrade\n\n 12/13\n\n\n5 (Health Proficiency)\n\n 1/5\n\n\n7 (Source of Water Recovery)\n\n 0/1\n Ego Recovery 72/40\n\n\n"},"games/Chaos-Zero-Nightmare/Characters/Rei":{"slug":"games/Chaos-Zero-Nightmare/Characters/Rei","filePath":"games/Chaos Zero Nightmare/Characters/Rei.md","title":"Rei","links":[],"tags":[],"content":"\n  Rei\n  \n  \n    \n  \n\nMemory Fragments\n\n\n                  \n                  Recommended sets \n                  \n                \n\nTetra(2p) + Healer(2p) + Seth(2p)\n\n\n\n\n                  \n                  Recommended stats \n                  \n                \n\nIdeal: HP%\nDesire: HP%\nImagination: EGO &gt; DEF% = HP%\nSubstats: EGO Regen &gt; HP/DEF &gt; HP%/DEF%\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nShockSuppressionDenialIdealDesireImagination🟧 0/5🟧 0/5🟧 0/5🟧 0/5🟧 0/5🟧 0/5SET NAMESET NAMESET NAMESET NAMESET NAMESET NAMEAttackDefenseHealth✅️ STATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTAT\nTodo\n\n[ ]\n\nTarget Deck ()\n\nBasic attack\n\n Remove\n\n\nBasic heal\n\n Remove\n\n\n\nPotentials (0/4)\n\nUnique Card Upgrade\n\n 0/10\n\n\n5 ()\n\n 0/1\n\n\n7 ()\n\n 0/1\n\n\n"},"games/Chaos-Zero-Nightmare/Characters/Renoa":{"slug":"games/Chaos-Zero-Nightmare/Characters/Renoa","filePath":"games/Chaos Zero Nightmare/Characters/Renoa.md","title":"Renoa","links":[],"tags":[],"content":"\n  Renoa\n  \n  \n    \n  \n\nMemory Fragments\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nShockSuppressionDenialIdealDesireImagination🟧 4/5🟧 4/5🟧 4/5🟧 5/5🟧 5/5🟧 4/5Conqueror’sConqueror’sBlack WingConqueror’sBlack WingConqueror’sAttackDefenseHealth✅️ Crit %✅️ Void DMG✅️ Attack✅️ Crit %✅️ AttackDefense✅️ Crit DMG✅️ Attack✅️ Crit DMGHealth %HealthEgo✅️ AttackDefense✅️ Crit %✅️ Crit DMG✅️ Crit %✅️ Crit %✅️ Attack %✅️ Crit DMGDefense %✅️ Extra DMG✅️ Extra DMG✅️ Extra DMGDOTHealthHealth %\nTodo\n\n Change Black Wing to Executioner’s\n Raise all to +5\n Get to 60% Crit %\n\nTarget Deck ()\n\nBasic attack\n\n Remove\n\n\nBasic heal\n\n Remove 1\n\n\n\nPotentials (0/4)\n\nUnique Card Upgrade\n\n 8/10\n\n\n5 (Crit % Proficiency)\n\n 4/5\n\n\n7 (Dirge Bullet Damage)\n\n 0/1\n Crit % 45.6/60\n\n\n"},"games/Chaos-Zero-Nightmare/Characters/template":{"slug":"games/Chaos-Zero-Nightmare/Characters/template","filePath":"games/Chaos Zero Nightmare/Characters/template.md","title":"template","links":[],"tags":[],"content":"\n  NAME\n  \n  \n    \n  \n\nMemory Fragments\n\n\n                  \n                  Recommended sets \n                  \n                \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nShockSuppressionDenialIdealDesireImagination🟧 0/5🟧 0/5🟧 0/5🟧 0/5🟧 0/5🟧 0/5SET NAMESET NAMESET NAMESET NAMESET NAMESET NAMEAttackDefenseHealth✅️ STATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTATSTAT\nTodo\n\n[ ]\n\nTarget Deck ()\n\nBasic attack\n\n Remove\n\n\nBasic heal\n\n Remove\n\n\n\nPotentials (0/4)\n\nUnique Card Upgrade\n\n 0/10\n\n\n5 ()\n\n 0/1\n\n\n7 ()\n\n 0/1\n\n\n"},"games/Chaos-Zero-Nightmare/Duplicating-cards-effectively":{"slug":"games/Chaos-Zero-Nightmare/Duplicating-cards-effectively","filePath":"games/Chaos Zero Nightmare/Duplicating cards effectively.md","title":"Duplicating cards effectively","links":[],"tags":[],"content":"A lot of characters benefit greatly from having a key card duplicated as many times as possible. One time is good, but two times (or even more?) is fantastic.\nRemove other Epiphany cards\nEach Copy Card event in Chaos randomly selects 3 cards, of which you choose 1 to copy. If you want your target card to appear as one of the choices, one strategy is to remove as many alternatives as possible.\nInstead of removing basic cards right away, you can instead remove other characters’ unique cards. By sacrificing their deck’s strength, you can build one deck to be especially strong.\nThis is easier to pull off after your characters have developed a fair amount, as survival becomes less of an issue.\nUnique cards\nSome characters have cards with the Unique attribute, which means they can’t be copied. Some cards gain Unique from Epiphanies. Since Unique cards will not be chosen as Copy targets, you don’t need to remove them in preparation for Copy events.\nPairing characters with these cards will make it a little bit easier to copy the card you are targeting.\nThe first boss is key\nIt’s much easier to duplicate your target cards at the first boss fight. By the time you reach the second, you just have too many cards to control it effectively.\nIf you haven’t duplicated your target card at the first boss fight, that might be a good time to reset your run."},"games/Chaos-Zero-Nightmare/Events/Forbidden-Catalysts":{"slug":"games/Chaos-Zero-Nightmare/Events/Forbidden-Catalysts","filePath":"games/Chaos Zero Nightmare/Events/Forbidden Catalysts.md","title":"Forbidden Catalysts","links":[],"tags":[],"content":""},"games/Chaos-Zero-Nightmare/Farming-Strategy":{"slug":"games/Chaos-Zero-Nightmare/Farming-Strategy","filePath":"games/Chaos Zero Nightmare/Farming Strategy.md","title":"Farming Strategy","links":["games/Chaos-Zero-Nightmare/Duplicating-cards-effectively"],"tags":[],"content":"\n\n                  \n                  Laboratory 0 \n                  \n                \n\nA lot of this information may be specific to farming on Laboratory 0. I’ll need to update this if mechanics change in the next event.\n\n\nHere are a list of some general tips to farming Chaos to build strong decks for your characters.\nChaos Difficulty\nThe best difficulty to farm is considered to be Difficulty 8, for a few reasons:\n\nEnemy levels increase a lot when moving up to 9\n8 with Nightmare mode gives consistent access to Tier 13-14 save data, which is generally enough to fit the decks you want.\n\nChaos Effects\nSome effects are much easier to manage than others. Things like:\n\nDecrease health (take damage) at beginning of each turn\nIncrease Elite and Boss HP &amp; Damage\nIncrease number of Elite fights\nDecrease max health\n\nare not too bad. Especially for Laboratory 0, the scary monsters who can end your run are actually in normal fights. So choosing Elite fights has a lot of benefits.\nThe bad effects you want to avoid are:\n\nEnemies gain Morale/Fortify after X turns\nEnemies gain Morale/Fortify upon enemy death\n\nbecause these can create impossible fights that will wipe your run.\nReducing credits is fine if you just want to finish the runs, but if you’re trying to build a great deck you need a fair amount of credits to remove cards, buy neutral cards, and buy equipment. So events within Chaos that give credits are pretty valuable.\nChaos Upgrades\nThere is an upgrade in the Chaos system that increases the chance of encountering Rare Species (upgraded versions of normal enemies) by up to 45%. The problem with this is that sometimes the enemies are strong enough to end your run, while the only upside is that you get more Chaos Orbs.\nHowever! If you reset your Chaos Upgrades, all tiers remain unlocked and you can choose which upgrades to enable. And you get all of our Chaos Orbs back.\nSo just reset, and re-enable everything except for the Rare Species probably up. Profit.\nDeck Building\nSome principles to keep in mind:\n\nDuplicating cards effectively\n"},"games/Chaos-Zero-Nightmare/Micro/202512041329":{"slug":"games/Chaos-Zero-Nightmare/Micro/202512041329","filePath":"games/Chaos Zero Nightmare/Micro/202512041329.md","title":"202512041329","links":["Chizuru","games/Chaos-Zero-Nightmare/Characters/Mei-Lin","Rin","Tressa","games/Chaos-Zero-Nightmare/Characters/Renoa","Yuki"],"tags":[],"content":"Chizuru is interesting, but doesn’t really add anything new to my lineup since Mei-Lin is already strong single-target.\nObvious synergy is with Rin and Tressa, and I don’t have either of them built. Shame that Renoa’s bullet discard doesn’t trigger Will-o-wisp.\nA strong multi-target attacker is probably what I need, and that makes me wonder if I should have just pulled Yuki. But using her in her showcase was kind of underwhelming and I’m not sold on the character design either.\nSo I think I need to just resist the FOMO and wait for someone I can really get behind."},"games/Chaos-Zero-Nightmare/Micro/202512042050":{"slug":"games/Chaos-Zero-Nightmare/Micro/202512042050","filePath":"games/Chaos Zero Nightmare/Micro/202512042050.md","title":"202512042050","links":["games/Chaos-Zero-Nightmare/Characters/Renoa","Conqueror's-Aspect"],"tags":[],"content":"Renoa is pretty good now, but it sounds like she is getting pretty significant buffs/fixes.\nUp until now, her 3-1 and 7 potentials, which increased the strength of Dirge Bullet, had not been applied to the discard effect.\nIn addition, the Conqueror’s Aspect set bonus will also start applying to Dirge Bullet. So that’s a flat 35% damage increase, as well as a 35% boost to crit damage. Insane!"},"games/Chaos-Zero-Nightmare/Micro/202512081104":{"slug":"games/Chaos-Zero-Nightmare/Micro/202512081104","filePath":"games/Chaos Zero Nightmare/Micro/202512081104.md","title":"202512081104","links":["games/Chaos-Zero-Nightmare/Characters/Mei-Lin","games/Chaos-Zero-Nightmare/Characters/Mika","Cassius","Veronica","games/Chaos-Zero-Nightmare/Characters/Renoa","Nia","games/Chaos-Zero-Nightmare/Characters/Rei"],"tags":[],"content":"Tried a Mei-Lin + Mika + Cassius team, and it worked really well. The card draw was a great help in setting up combos and extending them as much as possible. I have a few good +1AP epiphanies on my Draw cards, so I ended up having a lot of AP left over. I may even be able to drop Mika for Veronica if I ever draw her.\nMy second team remains an unsolved issue, though. I’m going to stick with Renoa + Nia, so if my third is not Cassius then maybe Rei? Or maybe even move Mika over here."},"games/Chaos-Zero-Nightmare/index":{"slug":"games/Chaos-Zero-Nightmare/index","filePath":"games/Chaos Zero Nightmare/index.md","title":"Chaos Zero Nightmare","links":["games/Chaos-Zero-Nightmare/Characters/Mei-Lin","games/Chaos-Zero-Nightmare/Characters/Mika","games/Chaos-Zero-Nightmare/Characters/Renoa","games/Chaos-Zero-Nightmare/Characters/Rei"],"tags":[],"content":"Actively farming characters\n\n  Mei-Lin\n  \n  \n    \n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMemory FragmentsTarget DeckPotentials✅️ 18/18✅️ 2/5 +2✅️ 9/9\nDetails →\n\n  Mika\n  \n  \n    \n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMemory FragmentsTarget DeckPotentials✅️ 18/18✅️ 4/6 +3❌️ 0/4\nDetails →\n\n  Renoa\n  \n  \n    \n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMemory FragmentsTarget DeckPotentials❌️ 4/6❌️❌️\nDetails →\n\n  Rei\n  \n  \n    \n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMemory FragmentsTarget DeckPotentials❌️ 0/6❌️❌️\nDetails →"},"games/index":{"slug":"games/index","filePath":"games/index.md","title":"Games","links":["games/Chaos-Zero-Nightmare"],"tags":[],"content":"This section of the wiki will be for compiling information about the games I play.\nThis includes reference material, notes on personal progression, and my thoughts about the game experience.\nMobile\n\n\n\n\n\n\n\n\n\n\n\n\n\nTitleStatusChaos Zero Nightmare🎮 Playing\nPlayStation 5\n\n\n\n\n\n\n\n\n\n\n\n\n\nTitleStatusFantasy Life i⏳ Hiatus"},"index":{"slug":"index","filePath":"index.md","title":"Invisible Parade","links":["Games/"],"tags":[],"content":"Hello, and welcome to my website. Web development is one of my favorite hobbies, and becoming a proficient writer is one of my greatest ambitions. This is a space for me to practice the two.\nGames"},"links/2025/coding-trance-music":{"slug":"links/2025/coding-trance-music","filePath":"links/2025/coding-trance-music.md","title":"Coding Trance Music from Scratch (Again)","links":[],"tags":["coding","music","creation","learning","tool"],"content":"Everything about this is so, incredibly cool. I need to learn more about this tool, and this creator."},"links/2025/game-design-is-simple-actually-raph-koster":{"slug":"links/2025/game-design-is-simple-actually-raph-koster","filePath":"links/2025/game-design-is-simple-actually-raph-koster.md","title":"Game design is simple, actually – Raph Koster","links":[],"tags":["game","design","learning","resource","approach"],"content":"A really phenomenal resource for learning how to approach game design. I probably need to keep revisiting this and learning from it."},"links/2025/scoundrel":{"slug":"links/2025/scoundrel","filePath":"links/2025/scoundrel.md","title":"How to Play Scoundrel | The Best 1-Player Card Game of All Time","links":[],"tags":["scoundrel","cardgame","gaming","strategy","play"],"content":"I love the idea of creating a new card game while constraining yourself to using a standard deck of playing cards."},"links/2025/the-colonization-of-confidence-sightless-scribbles":{"slug":"links/2025/the-colonization-of-confidence-sightless-scribbles","filePath":"links/2025/the-colonization-of-confidence-sightless-scribbles.md","title":"The Colonization of Confidence., Sightless Scribbles","links":[],"tags":["colonization","confidence","creativity","writers","ai"],"content":"A powerful nonfiction piece about writers pushing back against LLMs. While there are many useful applications of AI, replacing human creativity is not one of them."},"links/index":{"slug":"links/index","filePath":"links/index.md","title":"Links","links":[],"tags":[],"content":"These are things I found around the internet and liked enough to save"},"micro/index":{"slug":"micro/index","filePath":"micro/index.md","title":"Micro","links":[],"tags":[],"content":"My tweets toots are mirrored here"},"notes/Coding/CSS-ideas":{"slug":"notes/Coding/CSS-ideas","filePath":"notes/Coding/CSS ideas.md","title":"CSS ideas","links":[],"tags":[],"content":"Colors\nFirst define your basic colors using OKLCH.\n:root {\n  /* Raw LCH values: Lightness, Chroma, Hue */\n  --lch-blue: 54% 0.15 255;\n  --lch-red: 51% 0.2 31;\n  --lch-green: 65% 0.23 142;\n \n  /* Semantic colors built on primitives */\n  --color-link: oklch(var(--lch-blue));\n  --color-negative: oklch(var(--lch-red));\n  --color-positive: oklch(var(--lch-green));\n}\n \n@media (prefers-color-scheme: dark) {\n  :root {\n    --lch-blue: 72% 0.16 248;   /* Lighter, slightly desaturated */\n    --lch-red: 74% 0.18 29;\n    --lch-green: 75% 0.20 145;\n  }\n}\nThen, you can use native CSS functions like color-mix() to modify these base colors:\n.card {\n  --card-color: oklch(var(--lch-blue-dark));\n \n  /* Derive an entire color palette from one variable */\n  --card-bg: color-mix(in srgb, var(--card-color) 4%, var(--color-canvas));\n  --card-text: color-mix(in srgb, var(--card-color) 30%, var(--color-ink));\n  --card-border: color-mix(in srgb, var(--card-color) 33%, transparent);\n}\nThis feels much more intuitive, and more controlled, than coming up with various hex values and sprinkling them throughout your stylesheets.\nSpacing\nUse character width for horizontal spacing, and rem for vertical spacing\n:root {\n  --inline-space: 1ch;      /* Horizontal: one character width */\n  --block-space: 1rem;      /* Vertical: one root em */\n}\n \n.component {\n  padding-inline: var(--inline-space);\n  margin-block: var(--block-space);\n}\nReferences\n\nVanilla CSS is all you need\nModern CSS patterns in Campfire\n"},"notes/Coding/direnv":{"slug":"notes/Coding/direnv","filePath":"notes/Coding/direnv.md","title":"direnv","links":[],"tags":[],"content":"direnv lets you define environment variables to be loaded only within certain directories. It’s a great way to save secret variables that are project-specific, without cluttering your global shell config.\nInstallation\nbrew install direnv\necho &#039;eval &quot;$(direnv hook zsh)&quot;&#039; &gt;&gt; ~/.zshrc\n\nUsage\necho &#039;export SECRET_TOKEN=&quot;super-secret&quot;&#039; &gt; .envrc\necho &#039;export API_KEY=&quot;12345&quot;&#039; &gt;&gt; .envrc\ndirenv allow\n\nWhenever you cd into this folder, the environment variables will load.\nDon’t commit the secrets!\nAdd to .gitignore:\n.envrc\n"},"notes/Quartz-customizations/Disable-Folder-Listings-for-certain-index-pages":{"slug":"notes/Quartz-customizations/Disable-Folder-Listings-for-certain-index-pages","filePath":"notes/Quartz customizations/Disable Folder Listings for certain index pages.md","title":"Disable Folder Listings for certain index pages","links":[],"tags":[],"content":"Quartz automatically generates index pages for folders, and shows a list of all pages under that folder.\nYou can create your own index.md file to change the title and add any content you want, but disabling the list of pages was not as easy.\nI ended up editing FolderContent.txs directly, to look for an option called hideFolderContent in the page frontmatter.\n// check if folder content should be displayed according to frontmatter\nconst showFolderContent: boolean =\n\tfileData.frontmatter !== true\n\t\n[. . .]\n \nreturn (\n\t&lt;div class=&quot;popover-hint&quot;&gt;\n        &lt;article class={classes}&gt;{content}&lt;/article&gt;\n        {showFolderContent &amp;&amp; (\n\t        &lt;div class=&quot;page-listing&quot;&gt;\n\t          {options.showFolderCount &amp;&amp; (\n\t            &lt;p&gt;\n\t              {i18n(cfg.locale).pages.folderContent.itemsUnderFolder({\n\t                count: allPagesInFolder.length,\n\t              })}\n\t            &lt;/p&gt;\n\t          )}\n\t          &lt;div&gt;\n\t            &lt;PageList {...listProps} /&gt;\n\t          &lt;/div&gt;\n\t        &lt;/div&gt;\n        )}\n\t&lt;/div&gt;\n)\nThis wraps the portion of the page that shows folder content in a conditional, which can be toggled off by adding a variable to any page’s frontmatter."},"notes/Quartz-customizations/Links":{"slug":"notes/Quartz-customizations/Links","filePath":"notes/Quartz customizations/Links.md","title":"Links","links":[],"tags":[],"content":"I’m basically creating a new type of post called a Link, which consists of a link to an external site + my brief comments about it. Making this work the way I want will take a bit of tweaking.\nPagination\nPagination doesn’t exist on Quartz! This is a pretty big difference from the traditional blog structure, so I need to consider how I want to format my content.\nProbably the easiest option is to divide my content into pages by year (or quarterly or monthly if I end up with too many pages) as an archival view, and have a list of the most recent ones somewhere on the home page.\nI already organize the files into folders by year, so that should not be hard.\nCustomize the list display.\nBy default, Quartz shows the date, the title as a link to the page, and tags.\n\n Hide the tags. They take up too much space.\n Make the title link to the source URL\n\nGet this from the file frontmatter\n\n\n Show the page content directly under the link\n\nIt’s short enough that there shouldn’t be a need to click through.\n\n\n\nHide files in the Explorer\nThere are going to be a lot of files, and a lot of them probably will have long names.\nFor just the Links folder (and probably Posts too) I don’t want the explorer to list every page. Honestly, probably just having the parent folder shown open will be good enough."},"notes/Quartz-customizations/Overview-plugin":{"slug":"notes/Quartz-customizations/Overview-plugin","filePath":"notes/Quartz customizations/Overview plugin.md","title":"Overview plugin","links":[],"tags":[],"content":"I created a custom plugin to show a static list of the main sections of the site.\n(The options aren’t used, but I left them in so that I would remember how)\ninterface Options {\n  favouriteNumber: number\n}\n \nconst defaultOptions: Options = {\n  favouriteNumber: 42,\n}\n \nexport default ((userOpts?: Options) =&gt; {\n  const opts = { ...userOpts, ...defaultOptions }\n  function Overview(props: QuartzComponentProps) {\n \n\t  return (\n\t\t\t&lt;div class=&quot;overview&quot;&gt;\n\t\t\t\t&lt;div class=&quot;section&quot;&gt;\n\t\t\t   \t&lt;h3&gt;\n\t\t\t\t\t&lt;a href=&quot;/about/&quot;&gt;About&lt;/a&gt;\n\t\t\t\t&lt;/h3&gt;\n\t\t\t\t&lt;p class=&quot;meta&quot;&gt;About me and this site&lt;/p&gt;\n\t\t\t&lt;/div&gt;\n\t\t\t&lt;div class=&quot;section&quot;&gt;\n\t\t\t&lt;h3&gt;\n\t\t\t\t\t&lt;a href=&quot;/posts/&quot;&gt;Posts&lt;/a&gt;\n\t\t\t\t&lt;/h3&gt;\n\t\t\t\t&lt;p class=&quot;meta&quot;&gt;Longer things I wrote&lt;/p&gt;\n\t\t\t&lt;/div&gt;\n\t\t\t&lt;div class=&quot;section&quot;&gt;\n\t\t\t&lt;h3&gt;\n\t\t\t\t\t&lt;a href=&quot;/games/&quot;&gt;Games&lt;/a&gt;\n\t\t\t\t&lt;/h3&gt;\n\t\t\t\t&lt;p class=&quot;meta&quot;&gt;Thoughts and reference&lt;/p&gt;\n\t\t\t&lt;/div&gt;\n\t\t\t&lt;div class=&quot;section&quot;&gt;\n\t\t\t&lt;h3&gt;\n\t\t\t\t\t&lt;a href=&quot;/micro/&quot;&gt;Micro&lt;/a&gt;\n\t\t\t\t&lt;/h3&gt;\n\t\t\t\t&lt;p class=&quot;meta&quot;&gt;My &lt;del&gt;tweets&lt;/del&gt; toots&lt;/p&gt;\n\t\t\t&lt;/div&gt;\n\t\t\t&lt;div class=&quot;section&quot;&gt;\n\t\t\t&lt;h3&gt;\n\t\t\t\t\t&lt;a href=&quot;/links/&quot;&gt;Links&lt;/a&gt;\n\t\t\t\t&lt;/h3&gt;\n\t\t\t\t&lt;p class=&quot;meta&quot;&gt;Things I liked&lt;/p&gt;\n\t\t\t&lt;/div&gt;\n\t\t\t&lt;div class=&quot;section&quot;&gt;\n\t\t\t&lt;h3&gt;\n\t\t\t\t\t&lt;a href=&quot;/notes/&quot;&gt;Notes&lt;/a&gt;\n\t\t\t\t&lt;/h3&gt;\n\t\t\t\t&lt;p class=&quot;meta&quot;&gt;Assorted information&lt;/p&gt;\n\t\t\t&lt;/div&gt;\n\t\t&lt;/div&gt;\n    )\n    \n  }\n  \n  Overview.css = `\n    .overview p.meta {\n    \topacity: .6;\n      margin: 0 0 1rem;\n      font-style: italic;\n    }\n  `\n \n  return Overview\n}) satisfies QuartzComponentConstructor\n \n "},"notes/Quartz-customizations/PageList":{"slug":"notes/Quartz-customizations/PageList","filePath":"notes/Quartz customizations/PageList.md","title":"PageList","links":[],"tags":[],"content":"I’m probably going to end up tweaking this class a lot.\nDon’t show tags on the page list\nIt just takes up too much space.\nDelete the tags element from the returned HTML string.\nCustom display for subfolders\nI wanted to make the distinction between a folder and a file clear, so a folder now shows an icon to indicate that it’s a folder.\nI also wanted to show how many pages were contained within a subfolder, but that was a little bit complicated."},"notes/index":{"slug":"notes/index","filePath":"notes/index.md","title":"Notes","links":[],"tags":[],"content":"A jumble of assorted information."},"posts/a-boy-named-sue-and-a-theory-of-names":{"slug":"posts/a-boy-named-sue-and-a-theory-of-names","filePath":"posts/a-boy-named-sue-and-a-theory-of-names.md","title":"A Boy Named Sue, and a Theory of Names","links":[],"tags":["article","people","psychology","life"],"content":"What will you name your child? "},"posts/a-fathers-bookshelf":{"slug":"posts/a-fathers-bookshelf","filePath":"posts/a-fathers-bookshelf.md","title":"A Father's Bookshelf","links":[],"tags":["personal","books","parenting","house"],"content":"For a long time, I’ve avoided collecting too much stuff. I buy Kindle versions of books whenever possible, but there is a small shelf for the few books I have carried around with me over the years. My son, who is not quite two years old, will sometimes rummage through my books and leave them in a heap once he realizes there are no pictures, but it made me remember what my own father’s bookshelf was like for me.\nI’m pretty sure I found Calvin and Hobbes on his bookshelf, and I ended up reading it countless times as I grew up. I found The Hobbit, which led to The Lord of the Rings, and then whatever other high fantasy I could get my hands on. I found The Royal Road to Card Magic, and my interest in card magic ended up being a pretty big part of my life after that. I didn’t read Gödel, Escher, Bach, but I recognized it from that bookshelf when I was introduced to it many years later.\nA bookshelf creates serendipity. I encountered those books early, before anybody would have thought, “Ah, I know just the book that would interest this young man.” And discovering something of my dad’s and taking it for myself was much more exciting than being told, “Hey come look at this thing I liked when I was your age.”\nSo, since I’m the father now, I went and bought a big bookshelf for myself. I want to go through my parents’ storage to reclaim my favorite books, and I’ll slowly fill out my own bookshelf with books I think are worth keeping around – just in reach for my kids to discover on their own."},"posts/a-striking-perspective-on-new-york-city-property":{"slug":"posts/a-striking-perspective-on-new-york-city-property","filePath":"posts/a-striking-perspective-on-new-york-city-property.md","title":"A Striking Perspective on New York City Property Values | Metrocosm","links":[],"tags":["article","economy","graph","data","america"],"content":"Property values across the U.S., where the area of each state has been substituted for its total property value."},"posts/a-teenagers-view-on-social-media-backchannel":{"slug":"posts/a-teenagers-view-on-social-media-backchannel","filePath":"posts/a-teenagers-view-on-social-media-backchannel.md","title":"A Teenager’s View on Social Media — Backchannel — Medium","links":[],"tags":["article","tech","app","social-network","teens"],"content":"Very informative description of how teens and college students use the major social networks"},"posts/adding-color-to-posts-automatically":{"slug":"posts/adding-color-to-posts-automatically","filePath":"posts/adding-color-to-posts-automatically.md","title":"Generating Colors from Post Titles","links":[],"tags":["design","blog","color","tool","automation"],"content":"This blog has an intentionally simple design, but lately I’ve been thinking that it needs more color. A lot of the posts don’t have images and are just text, so large areas of the page are black and white with nothing visually interesting. That said, trying to include an image with every post is a pain. I would probably spend more time browsing stock images than actually writing the posts.\nPicular was a big inspiration. Generating colors from text by searching for images is a great idea, and I decided to automatically get a set of colors based on each post’s title. Picular doesn’t have an API that I could use, so I wrote a quick script that does something similar. Unless I’ve changed things since I published this post, there should now be a row of colors next to each post’s title.\nGetting colors from images\nI’ve included the script itself at the end of the post so you can the details of how it works, but the general process is as follows:\n\nDo a Google Image search for the title of the post\nGet the first five images\nFor each image, find the color that is most prominent\nSave the list of colors to the post\n\nHere are the results for the title “My Vacation in Tahiti”:\n\n  \n    \n    \n    \n    \n    \n  \n  \n    #626E6F\n    #53C2D6\n    #7693C6\n    #39547B\n    #515E65\n  \n\n\nAfter playing around with it, I found that just looking at the most frequently used color usually isn’t good enough. Most of the time you just end up with a lot of black and white. Instead of looking for the most common color, I should instead look for the most interesting color. There is a lot of room for optimization here, and Picular probably does a lot behind the scenes to make its results visually appealing. For now, I’m just ignoring any colors that are close to black or close to white. So far it’s working well enough for my uses.\nEven with these adjustments, this method tends to find a lot of colors that are either very dark or very bright. The colors often felt too strong compared to the rest of the site’s design. I thought about doing some adjustments to the colors to tone them down, but realized that it’s much easier to cheat by reducing the opacity of the colorful bars via CSS.\nI now also include this script in the rake task that generates my post files for Jekyll, so after I write a post it will automatically fetch colors before publishing. I might write another post about how that works, but for now you can see the file here (sorry if I’ve changed things since I wrote this and it’s no longer there).\n\nPrerequisites\n\nCreate a custom search engine powered by google\nGet an API key for the Custom Search JSON API\n\nThis is the only good way that I have found to get image search results without using a credit card. The custom search engine requires that you specify a site to search when you create it, but you can change the settings to search the entire web afterwards and it works fine.\nThe Script\nrequire &#039;net/https&#039;\nrequire &#039;uri&#039;\nrequire &#039;json&#039;\nrequire &#039;yaml&#039;\nrequire &#039;rmagick&#039;\n \nCONFIG = YAML.load_file(&quot;_local_config.yml&quot;)\n \n# Does an image search for the post title\n# and returns 5 prominent colors\ndef colors_from_title(title)\n  # Make the search query\n  uri  = &quot;www.googleapis.com&quot;\n  path = &quot;/customsearch/v1&quot;\n  uri = URI(uri + path +\n            &quot;?key=&quot; + CONFIG[&#039;google_api_key&#039;] +\n            &quot;&amp;q=&quot; + URI.escape(title) +\n            &quot;&amp;cx=&quot; + CONFIG[&#039;search_cx&#039;] +\n            &quot;&amp;searchType=image&amp;num=5&quot;)\n  request = Net::HTTP::Get.new(uri)\n  response = Net::HTTP.start(\n    uri.host, uri.port, :use_ssl =&gt; uri.scheme == &#039;https&#039;\n  ) do |http|\n    http.request(request)\n  end\n \n  # Get the image results.\n  # Using the thumbnails makes processing faster\n  image_urls = []\n  parsed_json = JSON.parse(response.body)\n  parsed_json[&#039;items&#039;].each do |item|\n    image_urls &lt;&lt; item[&#039;image&#039;][&#039;thumbnailLink&#039;]\n  end\n \n  # Process each image and get its most dominant color\n  colors = []\n  image_urls.each do |image_url|\n    original = Magick::Image.read(image_url).first\n    # Reduce to 16 colors to speed up processing\n    q = original.quantize(16, Magick::RGBColorspace)\n    # Sort colors in order of frequency\n    palette = q.color_histogram.sort {|a, b| b[1] &lt;=&gt; a[1]}\n    # Default to most common value, will try to replace\n    color = q.to_color(palette[0][0])\n    palette.each do |p|\n      pixel = p[0]\n      hsl = pixel.to_HSL\n      if hsl[2] &lt; 0.3\n        # Skip this color because too dark\n        next\n      elsif hsl[2] &gt; 0.8\n        # Skip this color because too light\n        next\n      else\n        # Use this color\n        color = q.to_color(pixel)\n        break\n      end\n    end\n    colors &lt;&lt; color\n  end\n  colors\nend"},"posts/adding-css-support-for-dark-mode":{"slug":"posts/adding-css-support-for-dark-mode","filePath":"posts/adding-css-support-for-dark-mode.md","title":"Adding CSS Support for Dark Mode","links":[],"tags":["css","design","mac","dark-mode","color"],"content":"{% include image.html image=“darkmode.png” width=“600px” %}\nmacOS Mojave added a system-wide Dark Mode, but it doesn’t do much if all of the websites you see are still bright white. To address this, there is a new CSS media query prefers-color-scheme that can detect Dark Mode and change styles accordingly. There are three possible values: no-preference, light, and dark. You can read more in the W3C specification.\nThis new option looks to be supported in Safari 12.1 and Firefox 67. As of this writing both of these have not been released officially, but you can try it out in the Safari Technology Preview\nI’ve added Dark Mode support to this site, using code that looks something like this\n@media (prefers-color-scheme: dark) {\n  body {\n    color: $text-color-dark;\n    background-color: $background-color-dark;\n  }\n \n  img { opacity: 0.9 }\n \n}\nYou should probably tweak colors a bit more than simply switching black and white to keep things looking nice, and I found that reducing image opacity can help to reduce the contrast with bright pictures."},"posts/adguard-was-preventing-sites-from-loading-in-safari-sometimes":{"slug":"posts/adguard-was-preventing-sites-from-loading-in-safari-sometimes","filePath":"posts/adguard-was-preventing-sites-from-loading-in-safari-sometimes.md","title":"Adguard was preventing sites from loading in Safari sometimes","links":[],"tags":["safari","adguard","vpn","filtering","cdn"],"content":"For some reason, some sites would not load in Safari. Certain assets, often hosted on a CDN but not always, would hang forever and keep the page from loading. Other browsers worked, curl worked, so it didn’t seem like a DNS issue. It was driving me crazy.\nI think I finally caught the culprit: Adguard’s network filtering.\nAdguard gives you the option to filter all of your internet traffic for various apps on your computer. By default, it does so through a “Network Extension” that registers a local VPN to filter all traffic.\nFor some reason, this was tripping up just Safari and stopping certain assets from loading. An alternative mode called “Automatic Proxy” is available to avoid conflicts with other VPN applications and such, and switching to this mode seems to have fixed the problem for me. Good!\nSee Adguard’s documentation here."},"posts/ai-manifesto":{"slug":"posts/ai-manifesto","filePath":"posts/ai-manifesto.md","title":"My AI manifesto","links":[],"tags":["manifesto","ai","creativity","learning","responsibility"],"content":"This is my personal manifesto for how I will and will not use generative AI. I believe it can be an extremely useful tool in certain situations, but can also have many negative repurcussions if used incorrectly.\n1: Use to expand my abilities, not as a crutch.\nA: Teach me new things\nAs a coding assistant, AI can quickly show me the correct syntax. It can suggest implementations, and teach me how to implement new functions. These are extremely useful, and help me to be exponentionally more productive as a hobby developer.\nI must take care to use this as a tool to help me learn and grow. Instead of receiving the AI’s solution and calling it done, I need to understand what it has suggested and why, so that next time I will be better able to produce that answer on my own.\nB: Do things I can’t do\nIf there is a trivial thing that I actually can’t do, and it is a progress blocker, I will use AI to fill in the gaps in my skill. Drawing a logo image for a silly pet project, creating a colorful, abstract background image, etc. It doesn’t make sense for me to learn how to do that for myself, so I feel comfortable delegating that to AI.\nC: Don’t do things I can do\nI do not use AI to write for me. I am able to write for myself, to express my thoughts through words in order to share my ideas with others. I believe that skills deteriorate without practice, and I am afraid of ever losing that ability. I will never delegate my writing, my thinking, and my shaping of ideas.\n2: Treat as a tool for creators, not as a creator unto itself.\nI work in a very creative, collaborative environment so this is very relevant professionally as well. It’s possible for me have an AI generate ideas, texts, and images, and by doing make me seem self-sufficient without collaborators. I will not do that.\nA: Help those who create\nThere are many ways for creative professionals to use AI as a tool within their process. If an artist uses AI somehow to help in the creation of their own art, that feels fine. As above, my hope is that they will use it as a way to expand their capabilities, and not as a crutch.\nB: Don’t try to be a creator\nIt feels wrong for a non-artist to generate images using AI and treat it as creative output. If I need visual artwork as part of a product, it will be created by a human creator. AI creations will not replace human creations.\nAI can be used as a tool through the creative process, but will not be directly creating any part of the finished product. That is the responsibility of the creators, the people, and is too important to be delegated.\nC: Help me to collaborate\nWhile I will always value my ability to communicate through words, sometimes an image can be far more efficient. Finding common ground through concept art, such as by generating many sample images to collectively define what is needed, can be a fast way to reach a shared understanding.\nThe ease of producing many different formats for presenting an idea allows for experimentation in communication, which has possibilities that aren’t even fully explored yet.\nCorollaries\n1B + 2B: Do what I can’t do, while not replacing real creators\nI will use AI to do things that I cannot do, but I will not treat the AI as a creator. Anything I create that directly uses something generated by AI will be presented as a proof-of-concept. I will not treat it as a finished product.\nAnything that I present as a finished product will be ultimately created by people who can take responsibility as creators. Delegating that role to an AI is irresponsible."},"posts/amazing-crossword-puzzle":{"slug":"posts/amazing-crossword-puzzle","filePath":"posts/amazing-crossword-puzzle.md","title":"Amazing Crossword Puzzle","links":[],"tags":["crossword","puzzle","new-york-times"],"content":"{% include image.html image=“crossword.gif” width=“500px” %}\nThe New York Times crossword puzzle the day before the 1996 presidential election.\nThe relevant clues:\nAcross\n\nForecast\nLead story in tomorrow’s newspaper (!), with 43-Across\nTitle for 39-Across next year\n\nDown\n\nSewing shop purchase\nShort writings\nTrumpet\nBlack Halloween animal\nFrench 101 word\nProvider of support, for short\nMuch-debated polital inits.\n"},"posts/an-ai-that-begins-novels":{"slug":"posts/an-ai-that-begins-novels","filePath":"posts/an-ai-that-begins-novels.md","title":"An AI That Begins Novels","links":[],"tags":["AI","creativity","writing","fun"],"content":"This neural network was trained to output unique opening lines to novels. Some of the results are surprisingly great:\n\nI have just been informed, that the debate over the question ‘is it right or wrong to have immortal souls’ has been finally brought to a conclusion.\nWhen I was a boy, I was fond of the story of the pirate god.\nHe had a strange name, and he was a very big boy indeed.\nThe village of Pembrokeshire, in the county of Mersey, lies on a wide, happy plain, which, in a few years, was to become known as the “Land of the Endless Mountains.”\nI was playing with my dog, Mark the brown Labrador, and I had forgotten that I was also playing with a dead man.\nHow many times have I had the misfortune to die?\nThe first day I met my future self, I was aboard the old dirigible that lay in wait for me on the far side of the moon.\n\nIt’s hard to call these creative since the AI probably has no concept of what these words actually mean, but there are some really compelling ideas in here.\nThe last sentence in particular struck me as having so many interesting elements that could be explored more as the story progresses. At the very least, these serve as excellent starting places for ideas that a normal person wouldn’t have on their own."},"posts/apple-sets-the-design-standard":{"slug":"posts/apple-sets-the-design-standard","filePath":"posts/apple-sets-the-design-standard.md","title":"Apple sets the design standard","links":[],"tags":["apple","design","product","article"],"content":"A pretty good article describing Apple’s success with their high attention to design."},"posts/are-games-still-for-kids":{"slug":"posts/are-games-still-for-kids","filePath":"posts/are-games-still-for-kids.md","title":"Are Video Games Still For Kids?","links":[],"tags":["game","opinion","nintendo","children","product"],"content":"I grew up in the 90s, and back then video games were made for kids. Toys were for kids, and video games were just the newest, most exciting toys around.\nBut as my generation grew up, we never really stopped playing games. As we became adults, the game companies kept making games for us, and games shifted to targeting an older audience. It makes sense that these would be successful since adults have more money to spend on games than kids do. Video games became a form of entertainment just like movies, and they started using serious storylines and graphic violence in the same ways.\nWhile this is great for the adults, I can’t help but feel that the kids are being left behind. The young adults making exciting new things are mostly making them for people like themselves, and very few companies are still focusing on entertainment for children. So now kids play Call of Duty, sign up for Facebook, watch YouTube, and are bombarded with content that really isn’t appropriate for their age.\nNintendo is a shining exception. The Switch is designed to be family-friendly and has many games suitable for young children. I was recently in a shopping mall that was holding an event for kids to try out the new Mario game, and they had a Mario there to greet them and take pictures.\nNintendo’s first steps in the mobile app industry - which is notorious for promoting competition and bad spending habits - includes games like Animal Crossing that have minimal payment mechanics and have only positive interactions between players.\nEven Nintendo’s eSports efforts include a focus on kids. Splatoon has held national tournaments exclusive to Elementary School students, to find the best Splatoon-playing kids in the country.\nCynics will say that Nintendo’s strategy is to start making life-long customers from a young age, but I just think it’s nice to see a giant game company that hasn’t forgotten about the children."},"posts/automating-materials-science-with-machine-learning":{"slug":"posts/automating-materials-science-with-machine-learning","filePath":"posts/automating-materials-science-with-machine-learning.md","title":"Automating Materials Science with Machine Learning","links":[],"tags":["tech","science","AI","robot","article"],"content":"\nA robot arm dips a pipette into a dish and transfers a tiny amount of bright liquid into one of many receptacles sitting in front of another machine. When all the samples are ready, the second machine tests their optical properties, and the results are fed to a computer that controls the arm. Software analyzes the results of these experiments, formulates a few hypotheses, and then starts the process over again. Humans are barely required.\nThe setup, developed by a startup called Kebotix, hints at how machine learning and robotic automation may be poised to revolutionize materials science in coming years. The company believes it may find new compounds that could, among other things, absorb pollution, combat drug-resistant fungal infections, and serve as more efficient optoelectronic components.\n\nThis sounds like a perfect application for machine learning. It’s a great combination of smart design and brute force effort."},"posts/aws-lambda":{"slug":"posts/aws-lambda","filePath":"posts/aws-lambda.md","title":"AWS Lambda","links":[],"tags":["aws","lambda","automation","script","dev"],"content":"\n  You can trigger an AWS Lambda function to automatically create a thumbnail when an image is uploaded to Amazon S3, verify address updates in an Amazon DynamoDB table, or process click-stream data in an Amazon Kinesis stream, without having to manage any compute infrastructure.\n  Billing is metered in increments of 100 milliseconds, making it cost-effective and easy to scale automatically from a few requests per day to thousands per second.\n"},"posts/beautiful-vs.-effective-prose":{"slug":"posts/beautiful-vs.-effective-prose","filePath":"posts/beautiful-vs.-effective-prose.md","title":"Beautiful vs. Effective Prose","links":[],"tags":["personal","writing","prose","language","english"],"content":"A long time ago, I fancied myself a writer and strove to write beautiful prose. I read a lot and borrowed from styles that I admired, but oftentimes my sentences ran on, and I relied on my thesaurus too heavily. But I enjoyed the process of writing and reached a familiarity with words that allowed me to simply let my thoughts flow through my fingers onto the page.\nAt university, I discovered The Elements of Style and quickly became an advocate instead of lean, effective prose. I strove to convey my thoughts using fewer words. Composition took more effort as I scrutinized each phrase. I was happy with the results, and I felt a deliberate craftsmanship that seemed more pronounced than before.\nThen, I moved to Asia and began communicating primarily with people for whom English wasn’t their first language. I started using short, simple sentences that got straight to the point. If the purpose of writing is communication, then all that’s really important is to tell the other person what they need to know, right? Saying things in a fancy way will only complicate things.\nIt was around this time that I first saw the Simple English Wikipedia, and my first thought was, “Now this is the pinnacle of knowledge transfer. This is how you provide the most information to the most number of people as efficiently as possible.”\n“But,” nagged a deep and quiet part of my mind, “that can’t be the full story. Poetry and literature, sure, it’s easy to set those aside and say maybe that it’s an art form, it’s writing for the sake of writing, and that’s why the pursuit of beauty can occur. Normal, day-to-day writing is not the same.\n“What about, say, Journalism? That’s writing to share information, but when you recall the most esteemed journalists they aren’t the ones who write like a press release. They are those who have perfected their craft, who can shape their words into a compelling picture to evoke emotional reactions in the reader. Isn’t that what you should strive for?”\nYes, of course. Beautiful or effective? You want a lot of both. And unless you’re writing an instruction manual, sometimes prose needs to be beautiful to be effective. I haven’t taken writing seriously in a very long time, so unfortunately my writing now is not much of either, but I suppose now is a fine time to start looking for my best voice again."},"posts/becoming-a-better-writer":{"slug":"posts/becoming-a-better-writer","filePath":"posts/becoming-a-better-writer.md","title":"Becoming a Better Writer","links":[],"tags":["personal","opinion","writing","life"],"content":"I just ordered Strunk &amp; White’s “The Elements of Style,” 50th anniversary edition. I don’t have the book yet, but the purchase inspired me to pay more attention to writing. Hopefully this can be someplace where I can practice writing, incorporating new ideas and polishing my prose. No high hopes yet, as I don’t often continue such things for long, but we’ll see how it goes :)"},"posts/becoming-a-parent-introduced-me-to-stress":{"slug":"posts/becoming-a-parent-introduced-me-to-stress","filePath":"posts/becoming-a-parent-introduced-me-to-stress.md","title":"Becoming a parent introduced me to stress","links":[],"tags":["parenting","stress","emotions","optimism","mindfulness"],"content":"I have always been a calm and happy person. Aggressively optimistic, even. I made it through the first 1/3 of my life without feeling much stress, only getting angry on rare occasions. Anger management, emotional therapy, mindfulness exercises, these were all things that I had no need for.\nI thought that this was a personality trait, but now I realize that I was simply blessed with an easy life. It’s not that I was particularly good at dealing with stress, I just didn’t have much stress coming my way.\nWell, parenting is not easy. It is demanding. uncontrollable, scary, and stressful. I love my kids dearly and would not want them to change for the world, and that seems to make it even harder. I want so badly to be the parent they deserve, to guide them with a gentle hand and encourage their every exploration.\nBut it is hard.\nAnd I am feeling the stress that had nothing to do with me until now. I feel frustrated when things don’t go the way I expected, I feel ashamed when I neglect opportunities to engage my kids, and I feel angry when situations get out of my control.\nI have to tell myself to take a deep breath and count to ten. I have to spend time with myself to sort out my feelings and learn what my needs are. All of these techniques that I had always overlooked as having nothing to do with me, are now suddenly instructive and eye-opening.\nIn my head, I know that I am probably overestimating the impact that I have on my children’s growth. They are their own people, and they will live their lives to their fullest. They will learn from and be influenced by so many more sources than just their father.\nBut I want to give them everything I can. I want to be a rock-solid, positive influence like my parents were for me. I want to teach them the names of flowers, and insects, and constellations, and construction trucks, and super-heroes, and inventors, and mountains, and countries, and exotic foods. I want to make things with them so that they can understand how things work, how they can take things apart and put them back together again. I want to show them that they are special, and that they have so many unique things to offer to the world.\nBut I am not that father yet. I’ve learned how selfish and impatient I can be. I’m new to this, too, so of course it will take a lot of time, effort, and patience.  I need to take things one step at a time, and also let myself recognize that I am already doing a fine job.\nBut now, I am stressed out.\nBut it will be worth it."},"posts/bike-rides-wandering-mind":{"slug":"posts/bike-rides-wandering-mind","filePath":"posts/bike-rides-wandering-mind.md","title":"Bike rides for my wandering mind","links":[],"tags":["commute","bike","mindfulness","friends","freedom"],"content":"My daily commute includes a 20-minute bike ride to the train station. I started this as a way to keep my body moving, but I’ve come to love it for the freedom it gives my mind. I can think about whatever I want to, but it’s also all right to not think about anything.\n{% include wing_glyph.html -%}\nThe weather is nice today, and I listen to the birds talking at one another.\nThe sun has started getting higher in the sky when I leave, so I’ll probably want to start wearing my sunglasses again soon.\n{% include wing_glyph.html -%}\nI can look ahead to what I will do today, or work through a tricky problem I’ve been stuck on. Or I can look around and notice things around me.\nOr I can let my mind wander and think about any random thing. Or I can just focus on riding the bike.\nOr I can space out for a while.\nIt doesn’t matter, and there’s no pressure.\n{% include wing_glyph.html -%}\nI see the nice older lady who lives a few streets down walking her Shiba. I slow down to say hello, and she wishes me a good day at work. I don’t actually know her name, and my window to ask politely has long passed. But I do know her dog’s name, and she knows our kids’ names, and we talk every now and then. She’s very soft-spoken and polite.\n{% include wing_glyph.html -%}\nI’ve considered listening to music while I ride, or a even a podcast, but the idea is just viscerally unappealing to me.\nWe spend so much of our time putting things in, though our eyes, or our ears. Consumption is implied to be productive, which means passing up on an opportunity to consume is a poor use of your time. I don’t buy it. I won’t be productive while I’m on a bike.\nI like having this time to myself, to take a break from the pressure to put anything in, or to push anything out. Confession: sometimes I hold my breath, just for a change of pace from always breathing in and breathing out and breathing in and breathing out.\nI suppose this is what leads many people to meditation, but I don’t have the discipline to make time like that at home. If I ever had a quiet 30 minutes to do with as I please (fellow parents of young children are laughing along with me), I would, with zero hesitation or regret, use it to play Clair Obscur: Expedition 33.\n{% include wing_glyph.html -%}\nI shift my hips and counter-steer to ease into the turn.\nIt doesn’t really feel like I’m turning, in the strictest sense of the word. I push down and bend the bike’s motion through careful twists while I stay centered on top. Riding a bicycle is one of the few physical activities that give me joy to perform. I feel extremely comfortable on a bike, and I’ve come to appreciate that more and more.\nGently weaving back and forth between the manhole covers is a game I play while looking for the smoothest path.\n{% include wing_glyph.html -%}\nHere’s the big hill that lets me get going pretty darn fast on the way down. I know I need to be careful, but I just can’t help it. I feel the wind blast my face, and hear it whistle around my ears.\nI love to go fast. That is something that I’ve come to recognize about myself. On skis or a snowboard, I would always end up going just a little bit too fast. When I reach the bottom I am sweating, with burning legs and a big grin on my face. There’s something tremendously satisfying about hitting those speeds using only my body and a plank of reduced friction.\nHow fast am I going now? It must be at least 30km/h, but honestly it probably feels a lot faster than it actually is.\nRiding a motorcycle, too — that was a special experience. I only had mine for about 6 months before selling it to move out of the country, but I still vividly remember how it feels. With just a little twist of your wrist like so, you’re immediately pulled forward by the tank of raw power you’re sitting on. So easy, and so liberating. All of that power sitting right there, ready, just waiting for you to lean forward and whisper, “Yes, you may.”\n{% include wing_glyph.html -%}\nThere aren’t dedicated bike paths here, but most of my route goes through small residential streets so it’s very pleasant. You do need to be careful though, around the many branching side-streets.\nThere is more foot traffic here, and the person riding ahead is going fairly slowly. I could try to pass, but the streets are narrow, so I’ll just ride slower for a while and stay behind. That’s fine.\nThe most important thing when riding a bike through a little city like this is to be aware of your surroundings so that you can anticipate what might happen. The next most important thing is to know when to slow down, or to even stop for a second. Too many people will do anything at all except slow down.\n{% include wing_glyph.html -%}\nFor some reason there is a fairly big rice paddy here, right behind a modern apartment building. Who own this? Why did they decide on this spot to create a rice paddy?\nThe muddy water is accented by neat rows of small green sprigs — they must have planted them pretty recently. In the summer, this entire field will become shockingly green.\n{% include wing_glyph.html -%}\nI’ve arrived at the bicycle parking lot at the station. You have to get a ticket at the machine when you go in, and there’s a lady in front of me. The screen says “Push the button for a ticket” and she’s pushing the picture of the button, thinking it’s a touch-screen. I point her to the big green button that’s below the screen. She laughs. She thanks me, and we laugh together."},"posts/blockchain-platforms":{"slug":"posts/blockchain-platforms","filePath":"posts/blockchain-platforms.md","title":"The Value of Blockchain Platforms","links":[],"tags":["tech","blockchain","analysis","product","business"],"content":"I’ve been thinking a lot recently about what benefits there are to building a new product on a blockchain. Blockchains allow an app to be decentralized, and the biggest value they bring is a solid way to handle trust and consensus in an environment with no central authority. I was having a hard time thinking of products that would really benefit from being decentralized, but I came across an idea about decentralized platforms that makes a very strong case for using blockchains.\nThe idea, introduced to me by this post by Alex Tabarrok, is that a blockchain-based platform is uniquely able to align its needs with the needs of the users. If a traditional platform wants to create economic value for itself, it often needs to do things at the expense of its users. It can’t maximize value for both the users and the platform at the same time. But a blockchain-based platform can, through its tokens, increase its value directly by increasing value for its users.\nFacebook creates value for its users by making it easy for them to communicate and keep in touch with their friends. But if Facebook and its stockholders want to create value (= money) for themselves, they need to start selling data and adding advertisements. This doesn’t add any value to its users and actually creates negative value. There is a conflict of interest because the needs of the users and the needs of the platform are not aligned, and the company needs to find a balance so that everybody involved is just happy enough.\nFor a decentralized platform with tokens powering its blockchain, the value of the platform lives in the value of the token. Users of the platform give value to the token by using it and interacting with it, so a popular platform will have more valuable tokens. The best way to make a token more valuable is to increase the value that the platform provides to its users. There is no conflict of interest because there is no way to increase the value of the blockchain itself at the expense of the value it provides its users.\nDiaspora* is a decentralized version of Facebook, and Mastadon is a decentralized version of Twitter. These platforms don’t have anything like tokens, and there is no revenue involved in either of the projects. While this is refreshing, having no monetary incentive for the people involved makes it less likely for the project to grow. Blockchain might be the missing ingredient that allows a decentralized platform to really gain momentum and start a new era of user-centric services."},"posts/box-line-text-a-minimal-whiteboard-app":{"slug":"posts/box-line-text-a-minimal-whiteboard-app","filePath":"posts/box-line-text-a-minimal-whiteboard-app.md","title":"Box Line Text: A minimal whiteboard app","links":[],"tags":["app","tool","whiteboard","web","fun"],"content":"This is a great implementation of an extremely minimal whiteboard app. There is no UI, and you can click to add text or click+drag to add boxes and lines. Zoom options in your browser will change the size, and you can save the HTML if you want to keep a copy.\nIt’s probably not enough for work meetings, but I thought it was a great, fun product."},"posts/buy-a-mac":{"slug":"posts/buy-a-mac","filePath":"posts/buy-a-mac.md","title":"Buy a mac","links":[],"tags":["article","apple","mac","opinion"],"content":"This article is so strange. It shows all the reasons why buying a PC with Windows Vista is a terrible idea, and yet the author seems perfectly happy with his Vista computer, even after paying absurd amounts of money to fix something that shouldn’t have broke in the first place.  "},"posts/cdp":{"slug":"posts/cdp","filePath":"posts/cdp.md","title":"Communication-driven productivity","links":[],"tags":["productivity","communication","framework","preparation","objectives"],"content":"Or, “The latest chapter in my fool’s quest to discover a productivity framework that magically makes me effortlessly productive”. So it goes.\nI’ve always considered my todo list as a list of things I need to do (for obvious reasons). But I had a minor epiphany and realized that, in my current role, everything I do has exactly zero value until I communicate it to the right people.\nFor example: One big item on my todo list now is to finish writing a proposal for improving how we evaluate new game ideas. But if the overarching objective is “Improve how we evaluate new game ideas”, the direct actions to achieve this are “Convince the right important people and get approval”, followed by “Tell everybody about the changes”. These are accompanied by the prerequisite sub-tasks, “Write up a convincing proposal” and “Update the existing guideline documents”.\nIn fact, almost everything I want to accomplish can be divided as The Communication and The Preparation for the communication. In most cases, the communication is the part that holds the actual impact.\nIt’s a subtle difference, but is very important for my perspective. Previously, I moved through my tasks sequentially. First I write the proposal. After that’s finished, then I schedule a meeting to present it. If that goes well, I propagate the results.\nWith this new framework though, I’m grounded in the final goal, and understand that everything hinges on the right communication. Writing the proposal is top on the list and is what takes most of my time, but in terms of actually achieving things, it’s just a precursor to the real action of using it to convince people.\nI used to be a Maker. I had a list of things (mostly documents) I had to produce in order for my team to progress. Some meetings were necessary, like everybody getting together at the beginning to figure out what exactly we needed to make and how, but the focus was on the doing that came after. Focused work uninterrupted by meetings was ideal.\nMy current role flips that on its head, though. I can do all day on my laptop, but it won’t make any difference until I communicate it to the right people. By habit, I was pleased by having an entire day free of meetings, but slowly it dawned on me that those days weren’t accomplishing anything. Of course I need time for myself to output certain things, but it should be framed as being preparation for an upcoming communication, and not as the actual goal.\nAside: I’m very conscious of my usage of the word “meeting” here, because it is such a loaded term. Nobody like a day full of meetings. But a day full of communication, conversation, and discussion? That is more palatable.\nSo what does this mean for me? I haven’t settled on a workflow yet, but when I record something I need to do I will frame it as the following:\n\nThe key thing I want to accomplish\nThe communication required to make that happen\nThings I need to prepare for that communication\nNotes and deadlines for the above\n\nSome communications might require no preparation. Those are the easy wins, as I can immediately set a time for discussion (or even just send an email) and put it out of my mind.\nSome tasks might require no communication. These are random things that I have to do for whatever reason, and will probably end up being mostly busy-work. I’ll find space for these somewhere in-between, as they are not a priority.\nThe core of my efforts should be the preparation + communication combos. If I want to enforce a fast pace upon myself, I could even book the meeting first and hold myself accountable to prepare in time.\nThis should be a simple enough framework to chunk my efforts into meaningful objectives, while setting clear priorities. The key insight for me is that communication is the star of the show, and my personal outputs are merely the preparation."},"posts/chrono-trigger-retrospective":{"slug":"posts/chrono-trigger-retrospective","filePath":"posts/chrono-trigger-retrospective.md","title":"Chrono Trigger Retrospective","links":[],"tags":["game","chrono-trigger","review","article"],"content":"\nChrono Trigger basically began as a jam session — a couple of star designers and a manga artist getting together to brainstorm and seeing what they might produce. No pressure. No cynicism.\n[ … ]\nUltimately, the best thing about Chrono Trigger is something that can’t quite be quantified in terms of mechanics, aesthetics, or plot. It’s impossible to play without getting the sense that that its designers really had a lot of fun in conceiving it (barring a stomach ulcer or two) and were wholly dedicated to making sure they got it right. Chrono Trigger is a labor of love effected by a group of very talented game designers, and their enthusiasm for the project permeates every aspect of the experience.\n\nTalk about nostalgia. I still consider Chrono Trigger to be the best game of all time, and this article expresses its appeal perfectly. If you haven’t played it before, fire up the emulator. If you have played it before, reading this will make you want to play again."},"posts/cinemagraphs":{"slug":"posts/cinemagraphs","filePath":"posts/cinemagraphs.md","title":"Cinemagraphs","links":[],"tags":["cinemagraph","photography","animation","art"],"content":"{% include image.html image=“cinemagraph-cab.gif” width=“615px” %}\nThese mostly-still images with subtle animations add a great new depth to photographs.\nSee more at Jamie Beck’s Tumblr"},"posts/comments-are-back":{"slug":"posts/comments-are-back","filePath":"posts/comments-are-back.md","title":"Comments are back","links":[],"tags":["comments","writing","communication","blog","discourse"],"content":"This site has gone through many forms, and comments have come and gone. Now they are back, made possible by commento++. Commento was popular and on my radar for a while, but the original repository has been dead for a while. Commento++ is a fork that has been dead for… a little bit less of a while. But it has a few improvements from the original, and as long as it’s stable I don’t care so much.\nBut the better question is not how, but why have comments? (Or why not to?)\nI didn’t have comments for a long time, because I decided that this blog was a place where I didn’t care what other people said. It was a space for me to write and save things, just for myself. That’s fine, too.\nBut I’ve been thinking a lot about what it means for me to write on this blog, espeically in the context of generative AI getting so good at replacing mediocre writers. Paul Graham’s post Writes and Write-Nots resonated with me. The ability to write well is equivalent to the ability to think well. By continuing to write, on my own, I hope I can keep up my ability to think well.\nAnd in many contexts, writing is also the ability to turn your thoughts into words and share them with other people. It is the ability to communicate. Writing in a personal journal might be good for my thinking, but I want to focus on my communication too. So, comments.\nI’ll write articles on this blog with the intent of communciating my thoughts to my readers, few as they are. And since communication is a two-way street, I wanted some kind of commenting system to get feedback and discourse. So I hope you find my posts here engaging, and would be very happy if you left me a comment, too."},"posts/crosspooter":{"slug":"posts/crosspooter","filePath":"posts/crosspooter.md","title":"CrossPooter - Poot your toots around the web","links":[],"tags":["crosspooter","rss","gotosocial","bluesky","script"],"content":"{% include image.html image=“projects/crosspooter.jpeg” description=“CrossPooter logo, showing a smiling cartoon face among arrows branching away” %}\nCrossPooter is a simple script for personal use, that reads the RSS feed of this website and posts the latest article to GoToSocial and Bluesky. It was inspired by EchoFeed, but I wanted to try my hand at making something similar myself.\nYou can see the source code here.\nFeatures\nCrossPooter reads the RSS feed of this website and checks if the latest article has been posted yet. If not, it will grab the article’s OpenGraph tags to construct a post.\nThe post will include a link to the article, the article’s title, and the article’s description. It will also attach an image if one is available.\nThe script is inteded to be run via cron every hour or so. I’m assuming that I won’t be posting new articles faster than that, so the script only checks the latest article.\nThings I learned building this\nBluesky was very straightforward since I just used the official python sdk. GoToSocial probably would have worked with the Maston library, but the API was simple enough that I wanted to try just sending HTTP requests.\nI’m still very inexperienced when it comes to creating complex HTTP requests, so I stumbled a lot with setting the correct headers and formatting the data in the correct way. But it was a good exercise in reading source code and documentation, and now I have a stronger handle on how to do it."},"posts/detroit-become-human":{"slug":"posts/detroit-become-human","filePath":"posts/detroit-become-human.md","title":"Detroit: Become Human","links":[],"tags":["game","opinion","review","robot","story"],"content":"{% include image.html image=“2020/detroit.jpg” %}\nIn this review, I&#039;ll talk about a few parts of the game that stood out to me, and I&#039;ll do my best to do so while avoiding spoilers.\nDetroit: Become Human is a story-heavy adventure game developed by Quantic Dream, the studio I knew best as the creators of Heavy Rain.\nThe story takes place in a future where androids are commonplace and indistinguishable from humans aside from a computer chip placed on their temple. Predictably, the androids are mistreated and repressed by humans, and you eventually find yourself in the middle of a robot uprising.\nYou assume the role of three different characters with interweaving narratives, and the actions you take as each character determine the course of the story. The result is a giant web of branching storylines with many different possible outcomes.\nRoleplay\nThe key to making this type of game engaging is how well you can sympathize with and roleplay as the protagonists. If you understand the characters and their motivations – and can see the world through their eyes – each of the actions you take over the course of the story becomes more meaningful.\nRobots do as they are told\nIn one early scene, you play as an android who is newly hired as a maid. You are set to performing menial tasks around the house, like picking up trash and washing dishes. Working through these tasks establishes your role as someone who does what they are told (It was even a little unnerving how eagerly I worked on these missions, happy to keep checking off finished work in the mission list). Because of this initial set-up, taking an action that goes against your owner’s orders becomes a much more meaningful scene.\nWhat should I want to do?\nWhile playing as another of the three main characters, an early scene presented what I thought would be a difficult, morally ambiguous decision to make. But as I was considering what the best action might be, the cutscene continued and the character made his own decision without any input from me. I was relieved that the difficult choice wasn’t my responsibility, and this scene was very important in establishing who this character is and how he behaves in certain situations.\nBut it was this character that I had the most difficulty playing as the story progressed. I was never sure if I should make decisions based on “What I want to do” or “What I think he would do” or “What I think he should do”. Do I follow my understanding of this person’s personality and values, or do I push him to change and break out of his mold? Probably because of my indecision, I ended up not being able to do a good job of either. Seeing the conclusion of the story showed me which decision would have led to a more positive ending, but the right path wasn’t clear to me on my first playthrough.\nExploring the Story\nDetroit: Become Human shows you how your decisions affect the story in the form of a map with branches leading to different outcomes.\n{% include image.html image=“2020/detroit_map.jpg” description=“The story map of the first chapter”%}\nI’m not sure if this is a feature common to adventure games (I hadn’t seen it before), but this was a godsend when making multiple playthroughs. You can even jump to a point in the story that you had already seen and start playing again from that point, free to make different decisions to unlock new parts of the story. You can’t help but wonder what would have changed if you acted a different way, and this lets you see without having to start the game from the beginning and skip through 80% identical cutscenes. It was because of this freedom and ease of access that Detroit: Become Human became the first game in recent memory in which I unlocked 100% of achievements.\nPurists might say that this ability to jump around the story detracts from the experience, but I honestly think I wouldn’t have played the game a second time without it. As a result, this feature is what allowed me to experience the amazing story in its entirety.\nIf the developers had chosen to design a game that presents the story from start to finish in the best way possible, they might not have included this map. I think that many existing adventure games had this approach. But instead, I think this game chose to present the story including all of the branching outcomes in the best way possible. None of the paths is the one correct path. They all tell parts of the same story, and I was very glad to have had the complete experience."},"posts/dinner-for-2":{"slug":"posts/dinner-for-2","filePath":"posts/dinner-for-2.md","title":"Dinner for 2","links":[],"tags":["opinion","people","life"],"content":"I was at a restaurant last night and saw a couple having dinner together. At a few points, the guy was texting on his phone and the girl was looking really bored. Boo on him. And then once he finished he left his phone sitting open on the table. I guess he was expecting replies? Maybe that sort of thing is commonplace now, but I still think it’s rude.  "},"posts/donkey-kong-and-me":{"slug":"posts/donkey-kong-and-me","filePath":"posts/donkey-kong-and-me.md","title":"Donkey Kong and Me","links":[],"tags":["article","game","history","product","story"],"content":"An excellent story about the making of Donkey Kong and what it was like to work in an early video game company. "},"posts/dragonsweeper---a-lovely-minesweeper-game":{"slug":"posts/dragonsweeper---a-lovely-minesweeper-game","filePath":"posts/dragonsweeper---a-lovely-minesweeper-game.md","title":"Dragonsweeper - A lovely minesweeper game","links":[],"tags":["minesweeper","strategy","gaming","monsters","challenge"],"content":"This is a really excellent take on minesweeper. Spaces can contain monsters of various strength, and you need to spend HP to defeat them. By collecting EXP and hearts to level up and heal yourself, the goal is to become strong enough to slay the dragon.\nIt took me a few tries to get a handle on the strategy, but this is super fun!"},"posts/extremely-loud-and-incredibly-close":{"slug":"posts/extremely-loud-and-incredibly-close","filePath":"posts/extremely-loud-and-incredibly-close.md","title":"Extremely Loud and Incredibly Close","links":[],"tags":["book","review","Jonathan-Safran-Foer"],"content":"Amazingly imaginative\nThis is the story of Oskar Schell, a young boy who is on a quest around New York City, attempting to solve a mystery left in the wake of his father’s death in the 9/11 attacks. The story is told in the form of narratives, letters, and journal entries from the perspective of three individuals, and their interwoven stories are revealed expertly in parallel. The book works as a scrapbook, with the reader discovering elements from the story appearing on the pages, as though they had been pasted in.\nThe best part of this book is the people you meet, and the stories they tell. Oskar meets a great number of people around the city, and each offers a delightful kernel of his or her life. Alongside these quick glimpses are stories and asides presented by the major characters, not necessarily relevant but always illuminating. Every anecdote is a gem that begs to be savored, and I often found myself setting down the book so I could digest.\nThis, I believe, is my absolute favorite book. I recommend it to everybody. Written by Jonathan Safran Foer, I believe it to be far superior to Everything is Illuminated."},"posts/facebook-and-non-profits-revolutionizing-with-samasource":{"slug":"posts/facebook-and-non-profits-revolutionizing-with-samasource","filePath":"posts/facebook-and-non-profits-revolutionizing-with-samasource.md","title":"Facebook and Non-Profits: Revolutionizing with Samasource","links":[],"tags":["facebook","samasource","nonprofit","business"],"content":"Originally posted on the fbFund blog\nWhile a Stanford undergrad, I began my online career with gleeful audacity. The Monday after Facebook Platform launched, my friend and I released Facebook’s original Graffiti application. We were unexperienced and had no viral component, so we soon lost the battle to Mark Kantor et al.’s version. But Graffiti gave us excitement and hunger. The following fall we enrolled in Stanford’s course on Facebook applications, using the opportunity to develop Send Hotness. This time, we nailed the virality. A few advertising payouts later, we were the proud owners of two companies. Doped up on adrenaline, we loved every minute. I stepped down eventually once I remembered that I had schoolwork to do, but I felt sure that this was my path.\nFast forward to April 2009. Graduation is pending, and I have the thrilling chance to commit my waking hours to some product. As it turns out, I basically had one choice:\n\nWe’re developing a real-time, web 2.0, social algorithm-based consumer-facing interface that will revolutionize what users do when they [blank]\n\nMany were great products, but I was saddened by those whose blanks were literal. They revolutionized where there was no value, turning a frivolous activity into a a well-designed and sexy frivolous activity. I needed more than that, and I looked for a way off of this path to inconsequence.\nThis is when I met Leila Chirayath Janah, the founder and CEO of Samasource. Having been in operations for 6 months at the time, Samasource’s mission was to bring dignified, computer-based work to women, youth, and refugees living in poverty. They recognized the tremendous untapped talent in impoverished countries and strove to bring prosperity by providing a sustainable livelihood. This is an idea that will change the world, and I was hooked from the start.\nI now have the privilege of being Samasource’s VP of Technology, and we have truly been blessed by being invited to participate in fbFund REV this summer. It’s an unexpected meeting of my past and current passions, and it has been tremendously fruitful. The Facebook platform, as well as other social channels, have a huge potential to effect social change and support these initiatives.\nSamasource’s project this summer is to bring our services to the Facebook platform by allowing partners in rural Asia and sub-Saharan Africa to offer quality assurance and testing to application developers. I believe that Facebook can bring together resourceful entrepreneurs and skilled rural workers in a way that was previously unheard of. As an application developer you are working one-on-one with a real person from across the world. This is a very moving realization, as I found when first inviting our service partners to join the site. For these individuals, having a Facebook profile is itself a powerful first step. Many have little or no web presence, and this will be their first chance to build a legitimate online reputation. Imagine the excitement of becoming plugged into such a dynamic international network for the first time, seeing no limit to where your work can take you.\nSo as it turns out, I am now committing my waking hours to a great product. We are remodeling the means by which an individual can rise out of poverty. We are enabling people to make socially responsible decisions that will change a life forever. Samasource is revolutionizing by giving work."},"posts/facebook-is-no-longer-a-communication-platform":{"slug":"posts/facebook-is-no-longer-a-communication-platform","filePath":"posts/facebook-is-no-longer-a-communication-platform.md","title":"Facebook Is No Longer a Communication Platform","links":[],"tags":["opinion","social-network","facebook","product","politics"],"content":"When I started using Facebook in 2005, it was exclusive to college students and was by far the best way to communicate with my classmates. It was the first time I could learn what my friends were up to without asking each one individually. Everything I wanted to know about my friends was in one easily accessible place.\nAll recent updates were shown as one long list, but Facebook eventually introduced the News Feed. This was an effort to filter everyone’s updates to show just the most important ones. Facebook made educated guesses about whose updates were most important to you and hid the ones you wouldn’t care about. I think they also kept an option to see all updates in chronological order if you didn’t want to miss out on anything.\nNews Feed seemed fine at first, but unfortunately it’s no longer useful as a way to keep in touch with people. Instead of showing you the updates that should be most important to you, Facebook now shows you the things that you are most likely to click on. Often, this means you only see pictures or videos on the home page.\nWhen people posted YouTube videos or links to articles, they got more clicks than regular status updates. Facebook liked that and started showing more and more videos and links in the News Feed, and this made them get even more clicks. At some point, people started noticing that posts about themselves got almost no attention, while links to content would get lots of reactions. People stopped posting about themselves and started posting links instead.\nFacebook prioritizes this kind of content so much that my News Feed doesn’t have any information about my friends anymore. It’s filled with posts by strangers that my friends have liked or commented on at some point. Because Facebook’s criteria for a good post is now so different from what we should expect, we have tragic situations like people never noticing that their friends were dying.\nFacebook no longer has any use to me as a communication platform. It has just turned into a click-generating machine."},"posts/first-image-of-a-black-hole":{"slug":"posts/first-image-of-a-black-hole","filePath":"posts/first-image-of-a-black-hole.md","title":"The First Image of a Black Hole","links":[],"tags":["space","news","black-hole","astronomy","photography"],"content":"{% include image.html image=“blackhole.jpg” description=“Credit: Event Horizon Telescope collaboration et al.” %}\nFor the first time ever, scientists have captured an image of a black hole. The black hole chosen is a supermassive black hole at the center of the Messier 87 galaxy, 55 million light-years away from Earth. This is huge news, since before this we only had theoretical proofs of black holes with no direct evidence.\nA black hole technically doesn’t look like anything since it emits no light, so I understand this to be a capture of light that came very close to the black hole. It appears in a very distinct way that confirms the presence of a black hole.\nThis is a photograph of a tiny amount of light that has spilled away from a black hole, 55 million light-years away. The fact that we have telescopes that can accurately capture that light is mind-boggling.\nBlack holes have so much gravity that any light that comes close enough will bend in a very noticeable way. Light that came from our direction can even curve around the black hole and come back at us. The ring that we see around the black hole is actually light that has come from all different directions, which have curved to end up reaching us. One side appears brighter because the black hole is spinning very fast, and the light that was pushed towards us with the spin experiences something like the Doppler Effect for sound.\nThis video by Veritasium does a great job describing what exactly is happening. Although it was released in anticipation of the actual image, the results were exactly as predicted."},"posts/five-steps-to-an-effective-tech-team":{"slug":"posts/five-steps-to-an-effective-tech-team","filePath":"posts/five-steps-to-an-effective-tech-team.md","title":"Five Steps to an Effective Tech Team","links":[],"tags":["business","team","startup","work","programming"],"content":"I recently experienced two of the most informative and useful meetings of my life. Lloyd Taylor, the former VP of Technical Operations at LinkedIn, and Olana Khan, the former COO of Kiva, graciously donated their time to speak to us about how to organize our technology goals. We had been in the process of formalizing our thoughts for an upcoming board meeting, but their expert feedback allowed us to cement in some much-needed structure. In addition, we also were given invaluable advice about how to lead an effective technology team in general.\nPreface – Agile Development\nFirst, I should set the stage by describing our new development process. Because Samasource is a tiny organization with no shortage of exciting new ventures to pursue, we adopted an agile development framework. This idea has gotten a lot of traction, and Eric lead us through the implementation. He actually wrote up a monster post about it on his blog, but I’ll briefly summarize here.\nWe divide our attention into short sprints, each lasting one or two weeks. Sprints represent all of the tasks that we will be focusing on during that time, and allow us to keep our minds off of other distractions until it comes time to organize the next sprint.\nEach sprint is comprised of various user stories, which encapsulate a qualitative end-goal. For example, one user story from our first sprint was “Website Visitors Understand the Mission and Trust the Org”. What this does is it allows us to focus on the real impact that our work will be making. We will not be blindly executing tasks from stale to-do lists, and will make sure that each project has tangible impact.\nAnd each user story is made up of tasks, which are small, discrete items of work that take a short amount of time to complete. This allows us to quantify the work that will be done.\nThis system of agile development allows us to be flexible from week to week with what we prioritize, ensures us that we are working towards a real goal with measurable impact, and breaks the work down into bite-size pieces. With this basic system in place, we can begin talking about business organization and the steps we can take to make the engineering team as effective as possible.\n\n1. Set Clear Priorities\nAt Samasource, and nearly all other startups, the list of things we want to do is ten times longer than the list of things we can do. Another way to look at it is that you can do anything but can’t do everything. The first thing you need to do if you want to be focused and productive is to clearly establish a system for prioritizing. Take the time to think about what the organization’s overall mission is, and align all engineering goals with the organization’s goals. The user-stories in our agile process help us do this, as we can always keep the big-picture objective in mind.\nEach organization is going to have different objectives and different ways of prioritizing, but the point is to be clear about what those methods are, be deliberate in assigning priorities to different objectives, and to be ruthless about cutting out low priority items. Some important questions to ask are, can the company survive without this feature? How does this affect our bottom-line? Does this item relate to any organizational bottlenecks? I’ve tried to organize our projects into 4 categories:\n\n\nHigh priority items that either fix bottlenecks or have high return on investments\nMedium priority items that would be great but aren’t necessarily killing us\nLow priority items that would be great but that we could do without\nItems that don’t immediately affect business processes but are essential steps towards achieving high-priority goals.\n\n\nOnce you have the system in place, run every idea through it and be certain of what your main priorities are. You need to be sure that your time is being used in the best way possible.\n2. Be Clear About Costs\nBuilding things takes time. No matter how passionate or incredibly talented you are, at some point you’re going to have to say that you can’t do it all. This is perfectly reasonable. The important thing is how to communicate this information, and how you prioritize your time with that idea in mind.\nIt is your responsibility to be clear about what the cost of each project is, and also to be upfront about communicating this. If there are two high priority items that will each take 4 full days to complete, you won’t be able to finish both this week. Creating a concrete and dependable system for allocating engineering resources will make it easier to make this point. It certainly should be formatted more as a mathematical fact, and not as a reflection of the engineer’s ability. And if something ends up taking longer than anticipated, or if an unexpected issue comes up that needs to be taken care of, this needs to be realized as early as possible. There is room for flexibility in a sprint schedule, but making changes early is far preferable to explaining later why a deadline was not met.\nOnce you have a system for establishing priorities and costs, you will have a strong ability to set determine immediate goals for your next development cycle. High priority items with low costs will obviously be at the top of the list, while low priority items with high costs will need to be reevaluated. Determining your goals for the week becomes a logical exercise in cost/benefit analysis, motivated by actual numbers. Being systematic about these decisions makes things more efficient, but it also gives the management team a solid framework for motivating decisions. The rationale behind decisions is far easier to communicate, and everybody involved can be on the same page.\n3. Run Short Development Cycles\nOur sprints generally last one work week, and give us a compact set of objectives that we can focus on. If you’re only looking a week into the future, you have a short list of user stories that you are concerned with. Because you took the time at the beginning of your sprint to prioritize your projects, you don’t have to worry about that during the week. You can focus entirely on the list of items in front of you, and sprint forward with confidence.\nA specific benefit of keeping the cycles short is that if something new and distracting comes up, you will be able to postpone its evaluation until the beginning of the next cycle. Most things generally can wait one week before being acted upon, and nothing hurts productivity more than having your head constantly turned in different directions. With the proper systems in place, the management team can also feel comfortable with postponed action on new opportunities because they know that these will be given the proper attention soon, and that items with a high priority will be acted on at that time. Again, the point is to organize your processes into reasonable, formalized systems that match your schedule and allow you to work effectively.\n4. Sharpen Your Saw\nThis is in reference to a point that Steven Covey makes in 7 Habits of Highly Effective People. If you are a logger, you will not be able to cut down more trees by simply sawing unceasingly. The loggers who get the most work done are those who take the time to step away from trees and sharpen their saws. Software engineering is no different, and you must set aside time from feature-building for maintenance.\nFor example, our system at Samasource follows a simple structure. Every fifth sprint or so, we will dedicate an entire development cycle to maintenance and optimization. Reducing time of page loads, cleaning up stale code, and rewriting functions to be more efficient are all examples of things we might do during these maintenance cycles. This is something deserving enough attention that you should formally set aside a significant amount of time to do it. Also, as often as once per sprint we will set aside a day for catchup and fixes. There may be small website upgrades that don’t find their way into weekly priorities, or there might be small bugs in some recent code that requires attention. Small things are bound to fall through the cracks, and the best way to keep them from piling them up is to regularly attend to them.\n5. Respect yourself\nI know I run the risk of sounding self-serving, but I do believe there is a message here unrelated to ego. Programmers tend to be perceived in a similar way as construction workers. “We know what we want built, and we’re paying you to build it. I don’t care about the details of how you do it as long as the finished product is what I had in mind, and the sooner you finish, the better.” But the discussion needs to be more than just that. Software development is an interesting field because the bulk of the work that goes into a project is invisible to everybody else. It is doing a disservice to everybody involved to not bring more of the process to the surface.\nThere’s an art to showing the amount of work that is being done, and it’s especially important for tech people to convey this information accurately. The aforementioned processes for organizing your effort will make it much easier for non-technical people to be on the same page. Breaking down ideas into discrete tasks allows everybody to understand what is being done to achieve a certain goal. An engineer’s time is both valuable and finite, so everybody will benefit from a solid understanding of where that time is going.\nConclusion\nThese ideas represent the current state of Samasource’s tech team, and I think that this exercise in strategic organization has been invaluable. These processes are a work in progress but I believe that they’ll allow us to grow rapidly and work effectively. I’d love to hear your feedback on these ideas, and whether you incorporate similar principles at your workplace."},"posts/gogol-bordello-oakland-2009":{"slug":"posts/gogol-bordello-oakland-2009","filePath":"posts/gogol-bordello-oakland-2009.md","title":"Gogol Bordello – Oakland 2009","links":[],"tags":["gogol-bordello","music","concert","review"],"content":"I recently saw Gogol Bordello perform live for the second time. The first was a year (two years?) ago in San Francisco, and it was the wildest, most exhilarating event I have ever attended. Many concerts have “that one song,” that brings the entire audience together in a fever of enthusiasm to focus entirely on the music and the performance. Gogol Bordello managed to maintain this state for the entire 2 hour show. The rush of being in a huge crowd of people screaming in unison and immersed in the moment, led by the gods of gypsy punk, was indescribable. But enough about last year.\nThe Oakland show was pretty good. The guys brought us a show as wild and passionate as ever before, so I think the crowd was the missing factor. There was nothing wrong with it per se – A few too many sweaty, angry men in the mosh pit for my tastes but that’s almost unavoidable – so I’m willing to bet that the San Francisco crowd that night was just too good to follow. Everybody in that theater was there to see the band, and loved – lusted, even – the music they performed. That just doesn’t happen every day, and it has earned Gogol Bordello a permanent place in my heart."},"posts/google-s-alphazero-destroys-stockfish-in-100-game-match":{"slug":"posts/google-s-alphazero-destroys-stockfish-in-100-game-match","filePath":"posts/google-s-alphazero-destroys-stockfish-in-100-game-match.md","title":"Google's AlphaZero Destroys Stockfish In 100-Game Match","links":[],"tags":["AI","tech","google","article","chess"],"content":"Google’s AlphaZero program is a machine that plays chess, and it has managed to quickly become the strongest chess AI in the world by implementing machine learning techniques. While existing chess AIs have mostly been massive dictionaries of moves that are put together by humans, AlphaZero learned chess entirely on its own with minimal human input.\nAs I understand it, the hardest part of creating an AI that solves problems like chess is finding some way to calculate if you’re winning or not. If that were easy to do, the program could just look at all of its possible moves (which is not very many for a computer) and see which one would leave it winning by more. The trouble is that it’s very hard to tell if you’re winning. You might need to consider all possible outcomes many moves in advance, which quickly becomes too many to calculate.\nSuccessful chess AI programs, of which Stockfish is the most popular, have a giant list of common board situations and good moves to make. An opening table lists moves that can happen towards the beginning of a match, and an endgame tablebase shows possible situations at the end of a match. The middle of a match is much more complicated and has far many more possibilities, so it’s difficult to create tables like this. The strength of a chess AI boils down to how big its tables are, and how quickly it can search them within the match’s time limits. But:\n\n[I]t took AlphaZero only four hours to “learn” chess. Sorry humans, you had a good run.\nThat’s right — the programmers of AlphaZero, housed within the DeepMind division of Google, had it use “machine learning,” which is sometimes called “reinforced learning.” Put more plainly, AlphaZero was not “taught” the game in the traditional sense. No opening book, no endgame tables, and apparently no complicated algorithms dissecting minute differences between center pawns and side pawns.\n\nI think this means that the program just played a lot of chess games on its own, and learned for itself what positions and moves lead to more wins. It’s possible that it built an intuition of how much it is winning, or how likely it is to get more ahead, at any point in a match. It can learn which moves don’t pay off immediately but might give an advantage later. Programs like Stockfish can’t really plan ahead, which is why they need to search their tables for the best move on every turn. AlphaZero isn’t limited by whether or not it was explicitly taught a certain situation. This ability also makes the searches much more efficient:\n\nIndeed, much like humans, AlphaZero searches fewer positions that its predecessors. The paper claims that it looks at “only” 80,000 positions per second, compared to Stockfish’s 70 million per second.\n\nThat’s 0.01% of searching effort required, which gives a huge advantage over an entire match.\nIf you’re interested, you can read the full paper here."},"posts/gravity-summit-stanford-wrap-up":{"slug":"posts/gravity-summit-stanford-wrap-up","filePath":"posts/gravity-summit-stanford-wrap-up.md","title":"Gravity Summit Stanford: Wrap-up","links":[],"tags":["social-network","analysis","communication","report"],"content":"Tuesday, May 5th was Gravity Summit’s “Social Media Marketing for Business” at Stanford. I’ve known Rodney Rumford since Joachim and I made Graffiti for Facebook, and he was kind enough to save me a spot.\nThe focus of the talks was very much aimed towards large businesses; presentations were given by such notable people as Bob Pearson of Dell, Inc. and Charles Miller from DIRECTV. That said, it seemed there were plenty of small business owners attending, and many of the points were generalizable. The main idea is:\nSocial Media is conversation. When a business or individual understands this, they can do great things.\nBob Pearson pointed out that “the majority of customers don’t call you.” Businesses have largely been detached from consumers, interacting only when the customer pursues a purchase. This no longer should be the case, as businesses now have the tools to actively engage in conversation with their customers and meet them halfway.\nSocial Media brings conversations into the open, and allows businesses to be aware of what people are saying. They then need to actively engage in these conversations and be involved in the dialogue. In doing so, businesses will learn more about the community and share more about themselves. In short, they must learn to be transparent. "},"posts/hobbies-that-i-am-no-good-at":{"slug":"posts/hobbies-that-i-am-no-good-at","filePath":"posts/hobbies-that-i-am-no-good-at.md","title":"Hobbies that I am no good at","links":[],"tags":["actor","juggling","hobby","creativity","enjoyment"],"content":"A distinguished actor appeared on TV and talked about their love for juggling. They had taken lessons at various times and always sets aside time to practice because they enjoy it so much. They then recounted how they recently met their juggling teacher of ~10 years past, displayed their current juggling skills, and was met with astonishment at how they had not improved one bit in all that time!\nIt was a funny story, but what struck me was just how nice it was that juggling was a constant source of enjoyment for this person despite apparently being no good at it. That’s a hard thing to do.\nI think that the internet is partly to blame, since the entire world’s top talent is now at our fingertips. It is too easy to see the best of the best, compare ourselves to them, and end up thinking, “Well what is the point of me doing this at all, then?”\nBut we must allow ourselves to enjoy things, even in the face of our clear mediocrity. Is there anything I enjoy doing – and let myself enjoy – that I am not good at? Am I denying myself of any hobbies just because of a lack of skill? Let’s dig in.\nHobby: Web development\nThis one is tricky, because I used to be decent at it but am now well behind the curve. I can slap together some HTML + CSS + JavaScript and make an OK web page. I was adept at Ruby on Rails 10 years ago and can still fuddle through making a web app.\nBut I touched python for the first time last year. I used Docker for basically the first time last year. I have no idea how to fix a Linux server when things don’t go exactly according to Getting Started guides. I have never touched a JavaScript framework. I have a small comfort-zone and am totally lost outside of it.\nThese things don’t bother me though, because I enjoy the time I spend tinkering. Occasionally I decide I want to try something new, and I stumble and fumble my through it and maybe learn a little along the way. This is possibly the only creative activity that I can enjoy in a pure, for the love of the craft kind of way. I like that.\nNot-yet-a-Hobby: Drawing\nSometimes I get a hankering to draw a picture, and I always enjoy the time I spend doing it. But I am not a good artist. I’m especially terrible at drawing faces. Awful.\nI can’t call it a hobby, since I rarely make time to draw. I have a suspicion that I would enjoy it if I let myself, and that the main thing holding me back is that I think I’m no good at it.\nHobby: Haiku\nA few years ago I developed an interest in Haiku. The hyper-minimal structure makes it so that changing just one preposition, or modifying the word order a little, can have a huge impact on the poem’s overall meaning and impact. I think that’s fascinating.\nI was lucky to find a group of people that meet regularly for Haiku. We decide on a few prompts, spend a month writing 3 Haiku each, and come together to comment on each other’s pieces and have our teacher critique us.\nI think that I’m not bad at Haiku, but to be honest, I thought that I would’ve gotten a little better at it by now. This isn’t discouraging though, as I find myself not really caring how skillful I am. The exercise of distilling a scene to its barest core and painting its picture with my words is fun. I feel like there are some low-hanging fruits for improvement if I put more effort into study, but I’m pretty happy just puttering along at my own pace."},"posts/homers-last-theorem":{"slug":"posts/homers-last-theorem","filePath":"posts/homers-last-theorem.md","title":"Homer's Last Theorem","links":[],"tags":["article","math","simpsons","tv"],"content":"A look into the deep, dark, strangely complicated world of Simpsons mathematics.\nI knew that Futurama has a lot of great mathematics involved, but I didn’t realize that it started in the Simpsons."},"posts/how-to-cook-popcorn-in-a-pan":{"slug":"posts/how-to-cook-popcorn-in-a-pan","filePath":"posts/how-to-cook-popcorn-in-a-pan.md","title":"How to Cook Popcorn in a Pan","links":[],"tags":["cooking","popcorn","recipe","life","tips"],"content":"The best way to cook popcorn in a pan. The secret is to heat up the kernels evenly in hot oil first, before heating them over a flame to pop them quickly all at once.\n\nCoat the bottom of a pan with a small amount of oil and place over medium heat.\nPut three popcorn kernels in the pan and wait for all three to pop.\nPut the rest of the kernels in the pan, cover with a lid, and remove from the heat for 30 seconds.\n\n\nThis heats the kernels evenly, getting them all ready to pop together.\n\n\nReturn the pan to the heat, where the popcorn should start popping right away.\n\n\nIt helps to keep the lid ajar and shake the pan occasionally to keep the popcorn dry.\n\n\nOnce the popping slows to a few seconds between pops, pour the popcorn into a bowl.\nAdd salt to taste.\n\n{% include image.html image=“popcorn.jpg” description=“Photo by Keegan Evans from Pexels” %}"},"posts/i-grew-up-in-high-school":{"slug":"posts/i-grew-up-in-high-school","filePath":"posts/i-grew-up-in-high-school.md","title":"I Grew Up in High School","links":[],"tags":["personal","life","teenager","adult","memory"],"content":"I might even say that I didn’t grow up in any meaningful way before I started high school.\nI’ve always felt like I have very limited memories of middle school and elementary school. The problem, as I realized recently, isn’t that I have few memories. Rather, it is that my memories don’t seem to include my thoughts – what I wondered, what I thought about, and how I felt about certain things. When probing my memories I get plenty of clear images, but I can’t help but feel like an observer; I can see my past-self doing things and reacting to events, but I have no idea what that child was thinking. I mean, I can guess. I’m sure I’d be pretty good at guessing, since I know the kid well, but it’s strange that this isn’t part of the memory.\nThis isn’t the case for high school though. I can definitely see parts of my personality in that past self. My emotions come back vividly, and they are as much a part of my memories as the actual events. For me, high school is when everything happened. I had my first romantic relationship. I solidified precious long-term friendships. I opened up to people and brought them into my life. I discovered my passions, and followed them with all of my might. I became closer to my friends than I believed possible. I began to seriously think about the future. I kept dark secrets, and shared them with a trusted few. I cried as many tears of happiness as I did tears of pain. I was confused about the world, and sought to understand it. I struggled to understand myself.\nAll of these invaluable experiences are what allowed me to grow up. And I believe that it was made possible by those around me, who shared my experiences and allowed me to join theirs. By no means do I claim to be grown-up now, but my point is this – in high school, I took my first steps towards adulthood."},"posts/i-want-to-love-mastodon":{"slug":"posts/i-want-to-love-mastodon","filePath":"posts/i-want-to-love-mastodon.md","title":"I want to love Mastodon...","links":["2024/12/27/installing-gotosocial-on-coolify"],"tags":["mastodon","federation","moderation","community","bluesky","social"],"content":"But it’s just not doing it for me.\n\nUpdate 2024/12/27\nI have set up my own instance of GoToSocial, and have written about it here. \nThis seems like the best solution for me.\n\nThe main selling point of Mastodon is its federation I think, and I tend to agree with Tim Bray’s points that some kind of decentralized, protocol-based network for social exchange is what will endure. Having one service run by one group of people is brittle. Having many services run by many groups of people is resilient.\nPeople explain that Mastodon and the Fediverse are similar to email. You can make an account with any provider, and it lets you speak to anyone on a different service. You can have a Gmail account and still send emails to a Fastmail account.\nBut for me, the analogy is not apt, mainly because of server rules and moderation.\nModeration of Mastodon\nEach Mastodon server has its own set of rules and moderation guidelines. There are things you can’t say on certain servers, and servers can even blacklist other servers if they notice a strong trend of bad activity. Let’s be clear, I prefer keeping angry Nazis away. But it’s not the same as an email provider.\nImagine if Gmail didn’t allow you to send emails that made derogatory comments. Or emails that contained copyrighted images. Or if Fastmail stopped allowing you to send emails to Hotmail users because there was too much spam coming from it.\nThe point is not whether those are good or bad decisions, but that it does matter who you sign up with.\nWho do I want moderating my experience?\nWhen comparing Bluesky to Mastodon, one point brought up often is that it is venture-backed. The service needs to generate money, and in the long run, for-profit services will go to shit. This is probably true.\nHonestly, I’m OK with staying while it’s good and getting out when it gets bad. That’s what I’ve done with Facebook and Twitter and Instagram and whatever else. That’s life online.\nThe more pressing issue in the short term is who I want to be running the service I sign up for. The unpaid volunteers of a particular Mastodon instance who want to keep the service good because they care? Or paid employees of a publically scrutinized company who want to keep the service good for a strong salary?\nAm I crazy to say that the latter feels more stable and reliable?\nPassion projects fizzle out when the passion dies, but money keeps the wheels turning. Bluesky’s mission now is agreeable to me, so I’ll stay on their service and feel peace of mind. As the service strays from this ideal in the future, as it most likely will, I’ll look around for whatever better option is available then.\nThe actual best solution\nIf I want freedom and permanence together, the best solution is probably to run my own Mastodon server. And that does seem like the answer I’m looking for. I’m in control of my data and can do with it as I please. I can connect to other Mastodon instances and participate in the larger community. And while the small details may change, I can bet on a federated future that continues to let me maintain a node that plugs into a larger network.\nThe only problem, and it’s kind of a big one, is the price and the hassle. Setting up a Mastodon server is still kind of a lot of work, and the cost of upkeep is significant. I hope that entry costs will continue to go down because that is the future that I am most excited to see."},"posts/identity-vs-community":{"slug":"posts/identity-vs-community","filePath":"posts/identity-vs-community.md","title":"Identity and Community on the Fediverse","links":[],"tags":["fediverse","identity","community","interconnected","resilience"],"content":"The Fediverse, a network of interconnected social media services, requires users to choose a service for their account, tying their identity to that community. This can be problematic if the community experiences issues like spam, moderation problems, or shutdown. If we could decouple identity from community, like Reddit did with subreddits, users could more freely participate in multiple communities — and the network overall would be more accessible and resilient.\nThe way things work\nThe Fediverse allows anyone to create their own social networking service — their own mini-X or mini-Instagram, if you will. There are many of these services now, each usually centered around a common interest.\nAdditionally, all of these separate services are built to communicate with each other, so that you can interact with users and their posts on any compliant service. Instead of having a few, huge, separate services, there are now many, small, interconnected services.\nYou do need to choose a service at which to initially create an account, but after you have, you are free to interact with anyone who is a part of this federated network.\nAnything you post online is saved to your chosen service, and is then broadcasted to the broader network. If you decide to move your account to a different service, there is a system to notify your contacts so that they will automatically be connected to your new account. However, your posts saved to the previous service will not come with you — you will have a fresh, new account.\nThe problem with choosing a service\nWhen I first tried to join the Fediverse, [I hated the idea]({% link _posts/2024-12-02-i-want-to-love-mastodon.md %}) of needing to choose a service. Yes, you can connect and interact with anyone regardless of which service their account belongs to, so it seems like your choice of a service matters little. But consider the following hypothetical scenario:\nMaking a choice\nI look for a service at which to create my account. Several of my friends have accounts at &lt;tootsosaurus.rex&gt; and it seems to have a fun vibe, so I choose it.\nThings are good. In additional to the members of &lt;tootsosaurus.rex&gt;, I also make some friends at &lt;happyfun.house&gt;, another casual and pleasant service. In &lt;woordworking.club&gt; I find a small community of very helpful people who give me tips on my DIY projects. I also love browsing everyone’s finished photos.\nThen, bad things happen.\nOverrun by spam\nFirst, &lt;tootsosaurus.rex&gt; becomes more popular and explodes with spam accounts. The admins are not able to handle the spam well, and other instances begin blocking access from &lt;tootsosaurus.rex&gt; to protect their users from the spam. I can no longer talk to my friends at &lt;happyfun.house&gt;. This is a huge bummer, but since most of my friends are on &lt;tootsosaurus.rex&gt; there is not much I can do.\nA Nazi is uncovered\nThen, it turns out that one of the moderators of &lt;tootsosaurus.rex&gt; is a Nazi. This is a huge bummer, and I seriously consider leaving the service for another. Ultimately though, it would be a lot of work to set up a new account — inertia wins, and I stay.\nBurn-out and shut-down\nThen, the owner of &lt;tootsosaurus.rex&gt;, facing wide criticism for their actions (and lack of), declares that it is no longer worth the trouble and that they will shut down the service. After a brief grace period, my account will disappear. This is a huge bummer.\nI need to find a new service. The easy option is &lt;happyfun.house&gt;, but they have been growing very quickly too, and I’m afraid of a similar thing happening again. I could go to &lt;woordworking.club&gt;, but I’m definitely not enough of a woodworker to tie that label to my online identity.\nThere seems to be no good choice.\nCreating your own service\nThat was a hypothetical scenario, but all of those things can — and have — happen. These are the things that I needed to consider when choosing a service, and it was paralyzing. Ultimately, I ended up side-stepping the decision by [creating my own server]({% link _posts/2024-12-27-installing-gotosocial-on-coolify.md %}).\nThis is fine, and everything works as expected. But, it is really hard to find and join communities when I’m starting with a home server of Population: One.\nOr, maybe it isn’t too much harder than one should expect, but it would be so much easier to join communities if I could just click join somewhere and be included on their list.\nThe root of the problem\nI think the main issue is that currently identity and community are tied together. If I want an identity on the Fediverse, I need to create an account with a service somewhere, which becomes my defacto community. If I have only one account, I will only officially be a member of one community.\nIf that community disappears, so does my identity.\nI can, of course, create a new account and switch my contacts to the new one, but none of my posts will come with me. It’s like moving to a new house and filing a change of address, but having to leave all of your things behind and starting with an empty house. Or like moving to a new boat after my old boat sinks to the bottom of the ocean.\nThe Reddit model\nThere should be a way to de-couple identity and community. Reddit’s subreddits are actually a very resilient model that might work here.\nOn Reddit, anybody can create a subreddit — a discussion board centered on any common interest. After creating a Reddit account, you are free to join any subreddits that interest you. Each subreddit will have its own moderation and be relatively self-governed, outside of extreme situations.\nSome subreddits will inevitably have drama, and in the worst cases they may shut down or become unusable. Motivated users would then create a replacement subreddit with new leadership and move over. Since user accounts are tied to Reddit as a whole and not to any particular subreddit, this is easy to do. The collapse of one subreddit does not have any impact on your personal account, or on your activity on other subreddits.\nA better solution?\nImagine if the Fediverse treated identities and communities as separate concerns.\nFirst you will create an identify, which will feel a lot like an email address. Most people will sign up at an identity provider, much like Gmail or Yahoo, but it would be moderately straightforward to set one up for yourself if desired.\nOnce you have an identity, you are then free to join any of the many communities on the Fediverse. These communities can be created by anybody, and are often centered around a common interest. You can join any number of communities and be listed as a member there. You can also follow individual users directly.\nWhen you post something online, you can choose where to publish it:\n\nTo your own profile, viewable at your personal feed\nTo a particular community, viewable at its community feed\nBoth 1 and 2\n\nWith this framework, lets consider the hypothetical huge bummers from before:\n1. My identity provider becomes spammy, and is blocked\nSpam is rampant and various communities begin blocking access from accounts created with this provider — I need to create a new account. The posts that I had been posting to my personal feed probably will not come with me.\nBut all of the posts that I had posted to various communities will remain there. By notifying my change of identity, my old posts and membership status will be updated to point to my new identity. All in all, this is not too disruptive.\n2. A moderator of my favorite community was a Nazi\nI no longer want to be associated to that community, and I will stop posting there. It may or may not be easy to delete my old posts.\nBut my identity is not tied to that community, so this is not a big deal. My friends and I will decide where our next online hangout will be.\n3. My favorite community is shut down\nThe service will disappear, along with all of the posts that I had made to that community.\nThis is essentially the same as #2 above. My account will be intact, and I can continue to participate in other communities.\nThis feels like a good idea!\nI can’t be the first person to have thought of this, so maybe there is a good reason why things haven’t been architected in this way. I’m curious to learn why!"},"posts/index":{"slug":"posts/index","filePath":"posts/index.md","title":"Posts","links":[],"tags":[],"content":"I write these thinking that somebody might read them, so they have a little bit of polish."},"posts/installing-gotosocial-on-coolify":{"slug":"posts/installing-gotosocial-on-coolify","filePath":"posts/installing-gotosocial-on-coolify.md","title":"Installing GoToSocial on Coolify","links":["2024/12/02/i-want-to-love-mastodon"],"tags":["fediverse","gotosocial","mastodon","server","coolify"],"content":"Following up to my earlier post about the fediverse, I discovered GoToSocial. Compared to Mastodon which required a fair amount of server overhead (more than I could justify for just playing around online), GoToSocial is very lightweight: 1 CPU, 1GB memory, and 15GB-20GB of storage space for the first year or so. Sold!\nThis would let me set up my own single-user server, which solves all of my misgivings about Mastodon.\n\nDisclaimer:\nI am a total novice at all things server-related! I am probably at least a little bit wrong about some of the things I write here. Please take my experience with a grain of salt, and correct me if you can.\n\nI have a VPS with Coolify to manage the multiple apps I have running, and all things considered it makes things very easy.\nI used a docker-compose file to deploy GoToSocial, and their example file was almost perfect as-is.\nPort settings\nCoolify acts as a reverse proxy, so I used that part of the configuration:\nservices:\n  gotosocial:\n  ...\n    ports:\n      # - &quot;443:8080&quot;\n      ## For letsencrypt:\n      #- &quot;80:80&quot;\n      ## For reverse proxy setups:\n      - &quot;127.0.0.1:8002:8080&quot;\n8002 was just an open port that I chose, and Coolify is smart enough to use that port to route traffic from my GoToSocial domain.\nFile permissions\nRobb Knight’s blog post showed me how to fix the sqlite database being unable to load because of a permissions issue. I had a similar issue with the Wazero compilation cache directory not being created, but I ended up just commenting that line out because it works without.\nShooting myself in the foot\nI knew I had to mount a volume to make the database persist across redeploys and not be wiped fresh every time. Coolify’s documentation made it very clear,\n\nThe base directory inside the container is /app.\nSo if you need to store your files under storage directory, you need to define /app/storage as the destination path.\n\nSo, I changed the settings to make sure that things were stored under /app\nservices:\n  gotosocial:\n    ...\n    environment:\n      ...\n      GTS_DB_ADDRESS: /app/storage/sqlite.db\n    volumes:\n      - ~/gotosocial/data:/app/storage\nWhich worked, except!\nI hadn’t realized that media storage also defaulted to the same (first) /gotosocial/storage directory. Since this directory was no longer being bound, it was wiped clean after every redeploy.\nRemote media was fine because it could be fetched again, but images I uploaded were lost.\nI poked around in the terminal and saw that both /app/storage and /gotosocial/storage were being created and used with no issues, so I just switched the database address back to the default /gotosocial/storage… and everything worked as expected.\nSo, I don’t quite understand what the Coolify docs were trying to tell me.\nEnd\nThings seem to be working fine now, and I’m using mostly Semaphore to interact with the instance.\nYou can follow me here!"},"posts/installing-python3-modules-on-macs-in-2024":{"slug":"posts/installing-python3-modules-on-macs-in-2024","filePath":"posts/installing-python3-modules-on-macs-in-2024.md","title":"Installing Python3 modules on Macs in 2024","links":[],"tags":["python","mac","virtualenv","installation"],"content":"When trying to install python modules on a new Mac, I kept getting thwarted by this error:\nerror: externally-managed-environment\n \n× This environment is externally managed\n╰─&gt; To install Python packages system-wide, try brew install\n    xyz, where xyz is the package you are trying to\n    install.\n    \n    If you wish to install a non-brew-packaged Python package,\n    create a virtual environment using python3 -m venv path/to/venv.\n    Then use path/to/venv/bin/python and path/to/venv/bin/pip.\n    \n    If you wish to install a non-brew packaged Python application,\n    it may be easiest to use pipx install xyz, which will manage a\n    virtual environment for you. Make sure you have pipx installed.\n \nnote: If you believe this is a mistake, please contact your Python installation or OS distribution provider. You can override this, at the risk of breaking your Python installation or OS, by passing --break-system-packages.\nhint: See PEP 668 for the detailed specification.\nIt seems like installing modules into a virtual environment is the way to go, which is what I had been doing for individual applications, but I wanted to be able to run this script from Alred workflows.\nCreate a virtualenv in a central place that is easy to access\npython3 -m venv ~/.virtualenvs/python3\nsource ~/.virtualenvs/python3/bin/activate\npip install xyz\nUse this virtualenv whenever I run the script\nBy specifying the python executable inside the virtualenv we created, we can be sure that it can access the modules we installed there.\n~/.virtualenvs/python3/bin/python /path/to/my/script.py &quot;{query}&quot;\nBonus\nAdd an alias to my ~/.zshrc so that can just type vpython /path/to/my/script.py\nalias vpython=&#039;~/.virtualenvs/python3/bin/python&#039;"},"posts/internet-in-a-box":{"slug":"posts/internet-in-a-box","filePath":"posts/internet-in-a-box.md","title":"Internet in a Box","links":[],"tags":["education","community","connectivity","resources","innovation"],"content":"\nInternet-in-a-Box “learning hotspots” are used in dozens of countries, to give everyone a chance, e.g. in remote mountain villages in India.\nIt works without internet — like a community fountain, but for the mind — wirelessly serving anyone nearby with a smartphone, tablet or laptop.\n\nI love everything about this project. It acts as a Wi-Fi hotspot with preloaded data that can serve the community. Wikipedia, eBooks, online courses, medical reference material, the possibilities are endless.\nWill it also let people connect with each other through this central hub? Assuming you could supply people with devices, how would a digital messaging utility transform a community? (There is a cynic in me that announces, “Bringing the Worst Parts of Nextdoor to the World!” but I choose to be optimistic today.)"},"posts/is-that-a-cigarette-or-a-lollipop":{"slug":"posts/is-that-a-cigarette-or-a-lollipop","filePath":"posts/is-that-a-cigarette-or-a-lollipop?.md","title":"Is that a Cigarette or a Lollipop?","links":[],"tags":["life","candy","thought"],"content":"I saw a girl at a bus stop who appeared to have a cigarette in her mouth. “Yuck,” I thought. Then, I realized it was a lollipop. I immediately wanted to become her friend.\nYou see, there is something special about lollipops. As far as your mouth is concerned, you could just as well be eating a normal hard candy. But the stick makes a world’s difference. You are proclaiming to the world, “I am enjoying a candy.” There is no way to be inconspicuous about eating a lollipop. You have committed to this act, and do so with no shame.\nAnd anybody who feels such passion for candy is all right in my book."},"posts/iterations-of-googles-logo":{"slug":"posts/iterations-of-googles-logo","filePath":"posts/iterations-of-googles-logo.md","title":"Iterations of Google's logo","links":[],"tags":["design","article","product","google","history"],"content":"I&#039;m definitely glad they keep iterating until they got to the current version, but that 2nd revision’s pretty neat too."},"posts/katamari-damacy-postmortem":{"slug":"posts/katamari-damacy-postmortem","filePath":"posts/katamari-damacy-postmortem.md","title":"Katamari Damacy postmortem","links":[],"tags":["game","developer","postmortem","katamari","anniversary"],"content":"By Game Developer Magazine:\n\nWe recently received a request to publish the Katamari Damacy postmortem from the December 2004 issue of Game Developer. It has been posted here in full for the first time in 2024 to celebrate the game’s 20 year anniversary. Please enjoy.\n\nThis article was written by the game’s director, Keita Takahashi, and has been translated into English from the original Japanese. I wish I could find the original text, but this is a great read regardless.\nIt’s easy to take a successful game and say “Here are its unique features and the reasons why we think they led to success.” But this portmortem also includes regrets from the game’s development, which gives a really rare, close look into what the team’s ambitions were and how they thought about the game’s design."},"posts/leather-sneakers-by-spingle":{"slug":"posts/leather-sneakers-by-spingle","filePath":"posts/leather-sneakers-by-spingle.md","title":"Leather Sneakers by Spingle","links":[],"tags":["japan","shoes","product","craft","leather"],"content":"{% include image.html image=“spingle.jpg” %}\nSpingle is a company based in Hiroshima, Japan that makes hand-crafted leather shoes, and they also have an excellent sneaker lineup. Because the leather molds to your feet over time, the shoes become more comfortable the more you wear them.\nThey are a little pricey, but they should last a long time and the cost is completely reasonable considering the work that goes into them. And there are plenty of sneakers that cost even more."},"posts/lets-stop-the-hate":{"slug":"posts/lets-stop-the-hate","filePath":"posts/lets-stop-the-hate.md","title":"Let’s stop the hate","links":[],"tags":["lgbt","opinion","personal","people","politics"],"content":"I&#039;m a supporter of LGBT rights. I&#039;m generally not too vocal about it, but with recent events culminating in the Orlando mass shootings, I had to say something.\nI&#039;ve been thinking a lot about the LGBT rights movement recently. Hopefully this effort can be another step forward following the Civil Rights Movement, as we work towards equal rights and treatment for all.\nThe Civil Rights Act made it illegal to discriminate based on race, color, religion, sex, or national origin. Setting religion aside for a moment, the rest are distinctions that generally lead to noticeable physical differences. The ease of identification is probably one factor that helped the prejudice spread so much, and led to institutional disenfranchisement as well as terrible acts of discrimination and violence.\nGay rights, though. There&#039;s no real difference between gay people and straight people, transgender people and cisgender people. It&#039;s just a preference; it&#039;s how people feel. Why are we judging, discriminating, and even killing people based on how they think and feel? At this point an explicit anti-discrimination law is probably an essential step to stopping it, but honestly this feels like the sort of thing that we teach on posters in our primary school classrooms. It&#039;s depressing that it needs a place in the Constitution of the United States of America.\nI don&#039;t know if every anti-LGBT person comes from a religious perspective, but I think many do. If you believe that the Almighty says it&#039;s a sin for two people of the same sex to love each other, then that&#039;s a tough thing to reconcile. I get that. It&#039;s a tragic situation, and it&#039;s going to be hard to work out.\nBut when it comes down to it, I believe that all major religions are centered around teaching love and respect. We can work together to make the world a better place, by cherishing our relationships with those around us. Religion can be a way to guide us, give us purpose, and achieve more than the sums of individual effort. That&#039;s why I have no patience for those who twist religion to teach hate. We need it to stop."},"posts/litestack-all-your-data-infrastructure":{"slug":"posts/litestack-all-your-data-infrastructure","filePath":"posts/litestack-all-your-data-infrastructure.md","title":"Litestack: All your data infrastructure","links":[],"tags":["ruby","rails","sqlite","database","gem"],"content":"From the repository:\n\nLitestack is a Ruby gem that provides both Ruby and Ruby on Rails applications an all-in-one solution for web application data infrastructure. It exploits the power and embeddedness of SQLite to deliver a full-fledged SQL database, a fast cache , a robust job queue, a reliable message broker, a full text search engine and a metrics platform all in a single package.\n\nI’ve been learning Python for my small projects recently, but for something that wants a full stack I’ll definitely be checking this out."},"posts/lucid-dreaming":{"slug":"posts/lucid-dreaming","filePath":"posts/lucid-dreaming.md","title":"Lucid Dreaming","links":[],"tags":["personal","sleep","dream","mind","skill"],"content":"I was consistently able to have lucid dreams when I was in high school. Partway through a dream, I would realize that I was dreaming and could then control the rest of the dream to a small extent. As I’ve grown older though, this has become less and less common. Maybe age has changed something about my brain.\nNaturally, I’ve been interested in lucid dreaming and have read a lot about it. Tim Ferriss has a fascinating beginner’s guide on his blog. Different people seem to have different approaches and theories, so I thought I would write about my own experiences.\nEntering a lucid dream\nThe breakthrough for me was trying to wake up from nightmares. I would pull my eyes open to try to force them to open in real life. Sometimes it worked, but other times the nightmare would already be over because I was focused so much on trying to open my eyes. At some point, I realized that if it’s all in my head, there’s no reason why I shouldn’t be able to change it to be less scary.\nThe next time I had a nightmare, instead of trying to wake up I tried to change the dream. I tried to imagine myself on a calm beach. It didn’t work very well. The whole dream just became hazy, and I woke up right away. Still, progress!\nSignals to realize you are dreaming\nIn Inception, the characters have totems that they use to determine if they are in a dream. If the totem is slightly different from the way they remember, they know that it is an imperfect version of the totem that exists within a dream.\nIt sounds like science fiction, but some people have similar methods of invoking lucid dreams before they even fall asleep. One of my friends in high school would hold an image of a French horn in his mind as he was falling asleep. He would then see the French horn in the dream, and it would be a sign for him to realize he is dreaming.\nOne thing that I have read (and noticed personally) is that it’s common to not be able to read clocks in dreams. It’s hard to describe, but the clock face is hazy and it’s as if your mind can’t register what time is showing. Or if I ever am using a smartphone in a dream, I always struggle to get it to do what I want. I consistently mistype the same words over and over. These are all signals that can help me to realize that I am dreaming.\nControlling a lucid dream\nI read about people with tremendous control over their lucid dreams. People who fly through the air freely and visit beautiful places around the world. Athletes who perform their sport in their dreams to develop muscle memory without fear of injury. Mathematicians who use the dream-space to visualize multiple dimensions and work out complicated formulas.\nEven after becoming lucid within a dream, I had a hard time controlling them. I was never able to fly, for example. The closest I got was jumping far by falling slowly. Changing my location was generally impossible, too. Like my attempted visit to the beach, changing too much about the dream around me would just wake me up. Instead, I could look for a door that leads into a room with a pool, for example, but it would often take me some time and effort to find that door.\nIt felt like my dreams had rules, and if I pushed too hard the dream would collapse and I would wake up. I had to be very careful to only make changes that fell within the dream’s rules to make sure that I could stay inside the dream.\nOnce I realize that the dream is fading, I try to stop pushing against it and surrender myself to the dream’s natural flow. This usually lets the dream get back on track, but sometimes I get caught up in it and forget to become lucid again. Supposedly, spinning around or rubbing your hands together is a good way to make a dream more “solid” again if you’ve weakened it too much (who discovers these things?), but I’ve never been able to remember to test this technique. I’m sure there are other tricks that people have developed, but they probably all require a lot of practice."},"posts/meals-as-a-social-activity":{"slug":"posts/meals-as-a-social-activity","filePath":"posts/meals-as-a-social-activity.md","title":"Meals as a Social Activity","links":[],"tags":["life","thought","meal","social","friend"],"content":"Today I ate dinner alone. I think there is nothing wrong with that, but you just don’t see people alone in restaurants all that often (Aren’t you going to be bored? Do you want a magazine or something?). Eating meals, in most cultures everywhere, is regarded as a social activity. I would like to explore why, and have a few hypotheses.\nEverybody has to do it. Three times a day, nearly everybody will eat food at roughly the same time. People share this activity, and so it makes sense for that time to be designated for social interaction. If everybody had tea at 3, or went to the gym at 4, then those would just as strongly be considered a social activity.\nWe are forced to sit down. In our busy lives, we are either doing something or are on our way elsewhere to do something. We need to eat though, and eating takes a few minutes, so we take a break and sit down. Meals become social times because they are the only times when social interaction is reliably possible.\nFor some, the social aspect of meals is essential. I have friends who refuse to spend meals alone, going out of their way to seek a companion or else not eating at all. This may even be the norm. Again, you never see people eating alone at restaurants. Why is this? When did conversation turn from a pleasant circumstance into an essential feature? If hypothesis two is true, then it may be because we depend upon meals for interaction. That doesn’t explain not eating, though. If you are forced to eat dinner alone, the conclusion ought to be, “Oh well, I guess I’ll eat alone today,” and not, “My meal is ruined, so I’ll settle for a quick sandwich.” Conversation is so essential that in its absence we lose all motivation to put effort into a meal. Solitude is preventative of food consumption.\nNo. That’s not true. Solitude prevents meals, and we resort to mere food consumption. A meal then, ought to be defined as an instance of eating food with others. We have redefined our culinary habits to be inherently social.\nWhere, then, does that put me? I usually eat meals very quickly, eager to get on with more interesting and productive parts of my life. Conversation is enjoyed, but only in the capacity of my minimal meal time. On the other hand, I enjoy good food and will seize any chance to eat well, even at the cost of doing so alone. It seems I regard meals primarily as food consumption, and enjoy it for gustatory factors. It is probably indicative that I required this posting to realize that meals are inherently social.\nBut I don’t think there’s anything wrong with that. I am a sociable person who appreciates food. I enjoy conversation at irregular intervals and don’t mind time spent alone. Don’t get me wrong though, I would love to have dinner together. In fact, let’s do it soon."},"posts/mental-training-and-learning-to-swim":{"slug":"posts/mental-training-and-learning-to-swim","filePath":"posts/mental-training-and-learning-to-swim.md","title":"Mental Training, and Learning to Swim","links":[],"tags":["swimming","learning","personal","mind","dream"],"content":"During my last year at university, I decided to learn to swim. I was reasonably confident in my ability to stay afloat in deep water and not die, but it wasn’t what you could call swimming. Luckily, two of my close friends were excellent swimmers and they agreed to work with me in the mornings before class.\nAs an aside, I did take swimming lessons on and off for a few years when I was a kid, but apparently I retained nothing from those classes. Maybe I was just a terrible swimmer the entire time? Possibly related, [I have very few memories from my elementary and middle school years]({% post_url 2010-06-06-i-grew-up-in-high-school %}), so I have a suspicion that I didn’t do a whole lot of thinking when I was a kid. In any case, I was essentially a total beginner to swimming when we started. I knew that you kicked your legs and paddled with your arms to go forward, but that was about it.\nIt turns out that learning how to swim as an adult is an interesting experience because you have developed a pretty good awareness of your body, and can pay close attention to what your limbs and muscles are doing. My friends watched me swim, pointed out parts of my body that weren’t being used correctly, and I adjusted my motions. While swimming, I tried to focus entirely on my body’s movement and ignore other things, like the water around me. Extend forward with your arm. Roll your body to bring the shoulder forward. Push down and back with the other arm. Turn your head up to take a breath. Reach forward with the back arm and extend. Repeat on the other side. Keep your legs kicking. This became my mantra, and I filled my head with it.\nI won’t pretend that it was easy, because it wasn’t. There were too many things to pay attention to, so I felt like I was always forgetting at least one thing. But I stuck with it. I was thinking about the movements enough that eventually I starting doing it even outside of the pool. Remembering how it felt to move through the water, I went through the motions in my mind while walking to class. Without actually moving my arms, I imagined stretching them forward, rolling my body, pushing back, and reaching forward again. I often had dreams about swimming too. It was pretty much the same thing, but in the dreams it felt more like I was really moving.\nWe started my swimming lessons in the fall and only had access to an outdoor pool, so the lessons stopped once it got cold, after only a few weeks. But even then, I kept going through the movements in my mind and having swimming dreams. I didn’t decide to do this; it just seemed to be the front-most thing in my mind a lot of the time. The experience of learning how to swim was fascinating to me. I was using my entire body in ways I hadn’t before, and the careful introspection of my motions was a new, fun challenge.\nCome spring, we got in the pool again for the first time in a few months, and I swam my first lap. It felt good, and it felt familiar. The motions felt just the way I had been imagining them in my mind. When I asked my friends how my form looked, they seemed puzzled. “It’s crazy but it seems like you got… better? How did that happen?”\nI had heard of mental training for sports before, like boxers shadow-boxing while imagining their next opponent. I didn’t know too much about the technique but it seemed like I had been doing something similar for swimming. It sounds a little magical to get better at something without actually doing it, and it definitely felt that way too, but I haven’t been able to recreate it for anything else since then. Swimming must have been the perfect activity at the perfect time to capture my attention – both conscious and subconscious."},"posts/momokuro-fans":{"slug":"posts/momokuro-fans","filePath":"posts/momokuro-fans.md","title":"When a music festival was cancelled, idol fans supported the local community","links":[],"tags":["japan","festival","fans","community","compassion"],"content":"Some uplifting news from Japan:\nOn April 13th in Shibata City of Niigata prefecture (Japan), the popular idol group Momoiro Clover Z had been planning a large music festival in cooperation with a large number of other artists, as well as local police, schools, and city government. However, on the day of festival the weather took a turn for the worse, and warnings were issued for strong winds, flash floods, and avalanches.\nAlthough more than 10,000 people had arrived in the city already, the group made the decision to cancel the event and quickly organized an online broadcast of the artists’ musical performances in its place.\nAmong this, the group’s fans have received wide attention for their excellent reaction to the bad news. Making endless reassurances online that “the group made the correct decision” and that “safety is more important than anything,” they then turned their attention to the impact this would have on the local community and businesses. Fans called upon each other to buy food prepared at  food stands to prevent excess waste, and to spend money at local businesses before returning home to support the community as much as possible.\nThere was no backlash, and no hard feelings. Just praise and compassion from everyone involved."},"posts/music-of-the-city---an-art-project-idea":{"slug":"posts/music-of-the-city---an-art-project-idea","filePath":"posts/music-of-the-city---an-art-project-idea.md","title":"Music of the City - an Art Project Idea","links":[],"tags":["art","music","idea","people","photography"],"content":"I’ve had an idea for a fun art project in my head for many years now, and I don’t see myself going through with it any time soon, so I’ll compromise by just writing about it.\nThe idea is to photograph people (with permission) who are wearing headphones in the city. Their photo will be shown along with the song they happened to be listening to. It would be interesting to see if a viewer would see any correlation between a person’s visual appearance and their taste in music. The prompt “What song was playing right now” is much more interesting than “What is your favorite music,” and some people might think that I caught them at just the wrong time, making things more fun for me.\nSince the subjects will generally be preoccupied, I imagine I’d design a small pamphlet that quickly describes the project and hand that out to people who don’t look too busy.\nMaybe one day."},"posts/natural-lighting-in-the-office":{"slug":"posts/natural-lighting-in-the-office","filePath":"posts/natural-lighting-in-the-office.md","title":"Natural Lighting in the Office","links":[],"tags":["personal","work","health","office"],"content":"I’ve come to learn that I really enjoy working in environments with only natural lighting. At my job, I work in a large open room with about 50 people. Many of them are artists who need to minimize the glare on their screens, so the great big windows covering the walls of our room are always covered with blinds, and we instead have fluorescent lights turned on (these do cause glare too, but at least they are more predictable so people can tilt their screens to minimize it).\nBut every once in a while, I’ll be in the office on a weekend, or early in the morning, and I’ll have the room to myself. The lights stay off, the blinds come down, and I immediately feel peaceful and refreshed. I’m noticeably happier and feel great while I’m working. At home too, I’ve set up my desk next to the window and I love the light that comes in from outside. Now that I’m aware that this is something that has a big impact on me, I’ll do my best to seek out environments with natural lighting in the future."},"posts/nava-ora-unica-wristwatch":{"slug":"posts/nava-ora-unica-wristwatch","filePath":"posts/nava-ora-unica-wristwatch.md","title":"NAVA Ora Unica Wristwatch","links":[],"tags":["design","watch","product","review"],"content":"{% include image.html image=“ora-unica-watch.jpg” width=“540px” %}\nI happened upon this watch in the mall over the weekend and loved how unconventional it is. The inner end of the loop acts as the hour hand, and the outer end is the minute hand. The in-between part seems to move freely, so you have a watch face that looks pretty different each time you look at it.\nI’d probably need to pause for a few seconds to decipher the time so it’s not exactly practical, but it would be a good conversation starter for sure."},"posts/obsidian-icloud-sync-between-mac-and-iphone":{"slug":"posts/obsidian-icloud-sync-between-mac-and-iphone","filePath":"posts/obsidian-icloud-sync-between-mac-and-iphone.md","title":"Obsidian iCloud sync between Mac and iPhone","links":[],"tags":["obsidian","notes","productivity","sync","icloud"],"content":"Just using iCloud sync has been pretty solid in my experience. I have two Macs and one iPhone that share a single vault, and I’ve had no major issues… except for one.\nBecause the entire Obsidian folder lives inside of iCloud, the .obsidian settings folder is also synced. Usually a good thing, except that the multi-pane view I have setup for desktop keeps getting pushed onto mobile. Because the panes all become tiny, and because Obsidian reverts to this view every time I use the app on desktop again, Obsidian basically became unusable on my phone.\nThe solution\nThe strategy is to force the desktop and mobile versions to use different config files. I can create a desktop-specific config folder and tell my two desktops to look at that one instead of the default.\nIn Preferences &gt; About there is an option to “Override config folder” and specify a different folder location. It seems that this setting is set locally and isn’t synced along with the rest of the data.\nFirst I created a copy of the existing .obsidian config folder to somewhere else on my computer.\ncp /{Vault location}/.obsidian ~/Documents/.obsidian_desktop\nThen, I create a symlink to that new config folder within my Obsidian vault. This will exist on the mobile vault too, but should just be ignored\nln -s ~/Documents/.obsidian_desktop /{Vault location}/.obsidian_desktop\nThen, within the Obsidian desktop app I override the config folder and set it to .obsidian_desktop\nBecause I created  .obsidian_desktop inside my Documents folder, which is synced to iCloud, my second desktop will get the folder automatically. I just need to change the settings within the Obsidian desktop app there too, to get it to start looking at the new config.\nThere is nothing to do for the mobile app, and now the desktop and mobile versions will be looking at different configs so layouts will remain independent.\nThe only thing I have to be careful of is that adding plugins and changing settings will not transfer between desktop and mobile, so I will need to make changes to both manually. This probably won’t be annoying for me because I have things mostly setup the way I like them now, but is something to keep in mind."},"posts/okunoshima---the-island-of-bunnies":{"slug":"posts/okunoshima---the-island-of-bunnies","filePath":"posts/okunoshima---the-island-of-bunnies.md","title":"Ōkunoshima - The Island of Bunnies","links":[],"tags":["travel","photo","rabbit","japan","personal"],"content":"{% include image.html image=“okunoshima/okunoshima24.jpg” %}\nLocated east of Hiroshima in the Seto Inland Sea, Ōkunoshima (大久野島) is a small island home to over 700 rabbits. The rabbits are wild but friendly, and tourists arrive every day with bags full of food and treats. The island was relatively unknown in Japan until recently when its populality among foreign visitors brought it into the spotlight.\n\nA Dark History\nŌkunoshima today is a paradise of cuteness, but its origins are sinister. Chosen for its remote location, it contained secret facilities used to develop and produce poison gas for chemical weapons. The island was erased from maps at the time to hide its existence. The ruins of these facilities still exist, covered by moss and providing a grim backdrop for those who choose to explore the island.\n{% include image.html image=“okunoshima/okunoshima06.jpg” description=“One of the ruins on the island” %}\nMost visitors are here for the bunnies, but it is important to not forget these parts of history. There is also a small museum showing the history of the island as a chemical weapons plant, decorated with messages promoting peace sent from students around the country.\nMeeting the Bunnies\nAs soon as you get off the ferry, you will be greeted by adorable bunnies waiting for a snack. You are encouraged to bring food for the rabbits, as you will not be able to buy any on the island. You will find the rabbits relaxing in the shade, sitting in little holes they have dug, or foraging in the bushes. But once you approch and start to open your bag of pellets or vegetables, they will all come running and beg for a treat. If you come in the sping or autumn, you might see tiny baby bunnies come hopping with their mothers.\n{% include image.html image=“okunoshima/okunoshima04_wide.jpg” description=“A baby bunny has come out for a bite to eat” %}\nBecause the bunnies are so friendly it can be easy to forget that they are wild animals. You should never try to pick one up, and definitely never give them any food meant for people. As long as you remember that you are visiting them in their home, you should be able to spend a lovely day socializing with them.\nRabbits are actually nocturnal! If you spend the night on the island, you can walk around at night or early in the morning to see rabbits much more energetic than during the day. Most tourists just visit for the day, so this is your chance to have the bunnies to yourself. There is only one hotel on the island so you might need to make reservations in advance if you want to do this.\nFor anybody wishing to surround themselves with adorable bunnies, or just looking for a unique travel destination, Ōkunoshima is a wonderful island to visit. Remember to pack an extra bag for treats!\n{% include gallery.html image_dir=“okunoshima” %}"},"posts/old-japan-photos":{"slug":"posts/old-japan-photos","filePath":"posts/old-japan-photos.md","title":"Photos of Japan that haven't changed in 150 years","links":[],"tags":["japan","history","culture","photography","heritage"],"content":"I was pointed to an article on Cosmographia which in turn shared an archive of photos taken in 19th century Japan. These are amazing photos, but what struck me was how familiar some of them felt. Photos taken from 150 years ago should feel like looking into another world, but some of these scenes, the architecture, are still very present today. It makes it clear how cultural artifacts are so remarkably well-preserved here.\nHere are some photos that stood out to me, alongside their modern-day comparisons.\nYoumeimon gate at Nikko Toshogu\n{% include double-image.html\nimage-one=“2025/old_japan/yomeimon-before.jpg”\ndescription-one=“Yomeimon Gate in the past, from Smithsonian Archives”\nimage-two=“2025/old_japan/yomeimon-today.jpg”\ndescription-two=“Yomeimon Gate today, from Wikipedia”\n%}\nThe southern moat at Osaka Castle\n{% include double-image.html\nimage-one=“2025/old_japan/osakajo-before.jpg”\ndescription-one=“Osaka Castle in the past, from Smithsonian Archives”\nimage-two=“2025/old_japan/osakajo-today.jpg”\ndescription-two=“Osaka Castle today, from www.shirofan.com”\n%}\nThe bridge at Sumiyoshi-taisha\n{% include double-image.html\nimage-one=“2025/old_japan/sumiyoshi-before.jpg”\ndescription-one=“Sumiyoshi-taisha in the past, from Smithsonian Archives”\nimage-two=“2025/old_japan/sumiyoshi-today.png”\ndescription-two=“Sumiyoshi-taisha today, from www.sumiyoshitaisha.net”\n%}\nThe pagoda at Shitenno-ji\n{% include double-image.html\nimage-one=“2025/old_japan/shitennoji-before.jpg”\ndescription-one=“Shitennoji in the past, from Smithsonian Archives”\nimage-two=“2025/old_japan/shitennoji-today.jpg”\ndescription-two=“Shitennoji today, from Wikipedia”\n%}\nOld Japan is ingrained in New Japan\nJapan is filled with modern scenes, from sprawling cityscapes to modern skyscrapers, bustling intersections to garish side-streets. Yet often right next to these scenes you can also find elements of an old culture, perfectly preserved and very much of a part of modern life.\n{% include image.html\nimage=“2025/old_japan/yasaka.jpg”\ndescription=“Yasaka shrine, from photo53.com”\n%}\nI’m sure this is a big part of the country’s allure to visitors, to be able to experience not only a foreign culture, but in many cases a culture from a different time as well. It’s easy to take for granted when you live here, but it truly is a rare and special environment."},"posts/one-cut-of-the-dead":{"slug":"posts/one-cut-of-the-dead","filePath":"posts/one-cut-of-the-dead.md","title":"One Cut of the Dead (カメラを止めるな！）","links":[],"tags":["zombie","movie","review","japan"],"content":"One Cut of the Dead (カメラを止めるな！) is a low budget Japanese zombie movie that became hugely popular here. I just watched it over the weekend and it was wonderful. The writing is very funny and very clever, and when it was over I found myself immediately wanting to watch it a second time.\nFrom Wikipedia:\n\nOne Cut of the Dead was made for 3 million Japanese Yen (approximately $25,000 in US Dollars at the time) with a cast of unknown actors. It was made in eight days after director Shinichiro Ueda participated in workshops for actors and filmmakers at the Enbu Seminar drama school in Tokyo\nOne Cut of the Dead opened in Japan in an 84-seat Tokyo art house theater with an initial theatrical run of six days.\nIt was showing at around 200 screens in Japan by March 2018 where it had officially grossed 800 million yen ($7.3 million)\n\nIt had been a while since its popularity blew up, but I knew only 3 things about the movie before I watched it:\n\nIt’s about zombies\nIt’s really good\nIt’s best to not spoil the plot\n\nIt’s been remarkably easy to avoid spoilers. It helps that the plot takes some effort to describe, bue it felt like everybody genuinely wanted to share the unspoiled experience with others even as it spread through word of mouth.\nApparently a bootleg version was somehow released on Prime Video, but the international release seems to be just starting. Hopefully this film will do well overseas, too."},"posts/original-ichat-ui":{"slug":"posts/original-ichat-ui","filePath":"posts/original-ichat-ui.md","title":"Original iChat UI","links":[],"tags":["product","design","mac","history","apple"],"content":"It&#039;s always exciting to see original prototypes of good products. Not to mention the sample conversation going on in there is rather delightful.  "},"posts/outgrowing-coolify":{"slug":"posts/outgrowing-coolify","filePath":"posts/outgrowing-coolify.md","title":"I may have outgrown Coolify","links":[],"tags":["self-hosting","docker","coolify","linux","vps"],"content":"I initially chose Coolify as a self-hosted alternative to Heroku when it got too expensive. Coolify makes a lot of things very easy, but I ended up having to dig in to the details and learn a lot to fix things that didn’t work. Now that I have learned a fair bit about server management, I’ve found that I may no longer need Coolify’s hand-holding.\nVenturing into self-hosting\nI knew next to nothing about Linux servers, Docker, reverse proxies, and the like. I had used Heroku for a long time, but its base price became restrictively expensive considering how small each of my little projects was, so I started looking for a service that could ease me into self-hosting my apps on a VPS.\nI started with Dokku, but the lack of a GUI made me uncomfortable because I really had no idea what I was doing. I was running with my eyes closed, hoping I didn’t trip. Coolify seemed to make deployments easy, and had a lot of handy tools to let me manage all aspects of my services through a web GUI, so I jumped in.\nCoolify was good, until it wasn’t\nA lot things were very easy! Go to an open-source project’s repository, find a sample Docker Compose file, paste it into a box, and hit “Go”. It handled URLs, SSL certificates, routing, and probably a lot of other things that I wasn’t fully aware of.\nBut there were plenty of things that did not go so smoothly. In these cases I had to stumble my way to a working solution, learning about what Docker Compose files do, where files are placed on my server, how to install packages that I need, and so on.\nWhen something went wrong with one of my apps, I would SSH into the server’s root and go digging through the files there to figure out what is happening. I learned how different containers are managed on the server, Docker’s command line utilities to ask each container what it is doing, various ways to change settings and reboot apps on the fly.\nThe last battle\nMy GoToSocial instance had a problem where it would randomly become unresponsive once every couple of days. I would realize that everything was timing out, and restarting the service was the only way to get things running again. It took me months of “debugging”, where I would dump out service logs, sift through documentation, and dig into every line of configuration that looked like it might be related to the problem in any way.\nAt last, I tracked down the problem.\nMy GoToSocial compose file defined a Docker network called gotosocial, as a network is required for the application and the database to communicate with each other. However, because a network is of course required, Coolify conveniently was also defining its own unique network, automatically and behind the scenes. And for some reason, a third network was also being created as the result of some combination of settings (I never did figure out why this was happening).\nOf these multiple redundant networks, the GoToSocial application was attached to only two, and the reverse proxy was attached to a different two. Something at some point would trigger some load balancing in the reverse proxy, and it would switch to its second known network, which did not have the application attached. Hence the unresponsiveness.\nAll I had to do to fix this was to delete the gotosocial network declaration in the Docker Compose file. But in discovering that solution, I ended learning a lot about how reverse proxies and Docker networks work, and walking around in a lot of code. Now, I feel pretty confident that I would be able to manage Docker-based deploys without Coolify in the middle.\nWhich brings me to my latest realization.\nNow, I can do this myself\nCoolify does a lot of (most of the time) convenient things behind the scenes, but sometimes they aren’t what I need. To understand what these conveniences are, how to work with them, when they are good and when they are not, and how to change things when I need to, I had to learn a lot about all of the moving parts of a Linux server with multiple docker containers running various services.\nNow that I have this experience, it seems like Coolify’s behind-the-scenes actions might be causing more trouble than convenience.\nI think I will get myself a fresh new VPN and start trying to replicate my apps with just manual Docker deployments + a simple Caddy configuration. Or maybe Dokku again, that’s worth a revisit.\nSo, thanks to Coolify for bringing me here, but I think our time together will be ending."},"posts/outside-of-target":{"slug":"posts/outside-of-target","filePath":"posts/outside-of-target.md","title":"Outside of Target","links":[],"tags":["personal","opinion","story"],"content":"The other day, a woman asked me if I could spare some change for poor women and children, and my automatic response was to keep walking with no response. Then, as I was walking away she called out to me and said “God bless you.” Hearing that made me feel like an awful person, because I certainly didn’t do anything to deserve it. It was on my mind for a while after that."},"posts/pay-a-subscription":{"slug":"posts/pay-a-subscription","filePath":"posts/pay-a-subscription.md","title":"If you love something, pay a subscription fee","links":[],"tags":["customer","service","subscription","satisfaction","business"],"content":"As a rule of thumb, you are more likely to be satisfied by a service that you pay for directly. This is because paying money makes you a customer of the business, and the business is thereby directly motivated to keep you satisfied.\nIf you want to find a service that will satisfy you for a long time, paying a subscription is your best bet.\nHere are some facts:\n\nIn general, a business aims to please its customers.\nA business’s customers are those who pay it money.\nIf you do not pay money to a business, you are not its customer.\n\nA user of a service who does not pay is, strictly speaking, not a customer. In most cases, the needs of the user and the needs of the customer are not too far apart, so many non-paying users are generally satisfied. But on average, in the long run, the needs of the non-user customer and the needs of the non-customer users will drift apart.\nUsers will feel a gradual, vague dissatisfaction with the service that grows over time. Certain things that used to be easy to accomplish may become less straight-forward. New offerings may be uninteresting, or even undesired.\nThe case of venture-backed companies\nFor a venture-backed company that provides a free service to its users, its customers are its investors, not its users. Of course, the investors want the company to become successful (whatever that means today), and a service’s success usually depends on having satisfied users, so the goals aren’t too detached. But when push comes to shove, the direct motivation placed on the company will be to satisfy its customers over its users. As long as users are kept minimally satisfied, efforts that generate measurable value for the company will be given priority.\nFor example, Facebook used to provide excellent ways for people to share information about their personal lives and keep up to date with their friends and family. Now, it is focused more on increasing engagement for its users — which is what its customers (investors) value — and no longer has any focus on keeping people connected.\nThe case of one-time cost applications\nYou are paying for the application, so you are the customer. Right? Well, almost. At least, you are at first.\nAs a business, the developer needs to continue generating revenue. Who are the customers it needs to please this month? Those people who are buying the app for the first time this month. The developer needs to understand what needs are going unmet now, and deliver a solution for those needs. If the needs of potential customers shifts significantly over time, so too may the offerings of the application shift.\nFor example, popular to-do tracking apps used to just focus on personal task management. Later, the industry as a whole shifted towards offering solutions for collaborative team management. More recently, everybody wants AIs to do smart things for them, so many apps are placing AI functionality front and center. The app that you loved and bought 5 years ago may be a very different app today.\nOf course, a lot of apps have pretty static use-cases and don’t change that dramatically. But you see what I mean.\nThe case of subscription-based services\nThe users are always the customers. If a user ever becomes too displeased, they will just stop paying for it. The business is always directly motivated to keep its users happy — especially the most loyal ones who have been using the service for a long time.\nFor example, Kagi Search asks its customers to pay a monthly fee to use its search engine. This is pretty shocking for anybody who is used to having search as a free feature of the internet, but —\nThere always seem to be people lamenting that Google’s search results are not as good as they used to be. It’s hard to qualify how true this actually is, but it’s definitely plausible. Deep down, the most important thing for Google is not how easy it is for users to find the things they’re looking for. The most important thing for Google is that Google generates money from its advertisers. Of course, Google needs a consistent, very large number of satisfied users in order for that to happen, and so the two needs are not too disconnected. But they are not the same, and it’s possible — likely, even — for priorities to have noticeably drifted apart.\nBut in the case of Kagi, if a user feels that search quality has declined, they will just stop paying. Because search quality declined, Kagi will make less money. In order for Kagi to make more money, they have to make search quality better. By adopting a subscription model, Kagi has fundamentally aligned the goal of the service with providing excellent search.\nThis is why a subscription-based service is the most likely to keep its users satisfied over time, and why — if you care, and if you have the choice — you should choose to use a subscription-based service over other offerings."},"posts/pay-to-win":{"slug":"posts/pay-to-win","filePath":"posts/pay-to-win.md","title":"Pay to Win","links":[],"tags":["game","app","mobile","analysis","product"],"content":"Mobile games can make a crazy amount of money. Puzzles and Dragons at its peak was said to be earning $100 million per month! Why do people spend so much?\nMobile games are generally much more simple than traditional video games, so they can’t provide the same rich experiences as traditional video games. Instead, they engage their core users by providing a satisfying experience of winning, especially against other players. Since people often play mobile games in their spare time, money is used as a shortcut to win quickly and efficiently. The entire game’s structure is built around creating an environment to support people who are willing to pay large amounts of money in order to win.\nWhat are you paying for?\nCompared to more traditional games, mobile games at first glance don’t seem to be as fun. The storyline, if one exists, is usually kept simple. Skill is rarely a factor, and user interaction is limited; in many games, you just need to tap the screen repeatedly to progress.\nIf you buy a good video game, you are paying for an engaging experience. You become a part of the world that the game makers have created for you. You directly control what happens in that world, and through some combination of time, effort, and skill, you can eventually “win” - which feels great.\nBut a lot of people can’t invest much time and effort into games. Maybe they can only play for 5 minutes every morning while they wait for their bus, but they still want to have fun. And what’s more fun than winning? So games - especially the ones on your phone - started letting people pay money to skip all that time and effort, and start winning right away. They are paying for the experience of winning because winning is fun.\nSomebody who isn’t used to this idea might think that winning won’t feel good if you spend no time and effort. As it turns out though, many people are willing to spend a lot of money to win, and they feel good doing it. I think this is because people are able to think of time, effort, and money as resources that have comparative value. Time is money, as they say, and if you have some money but no time, then you spend what you can to have a good time.\nGames built for players who pay to win\nThe best kind of winning is against real people who are also trying to win, so games that let people battle other players quickly became the most profitable. But if you have winners you need to have losers, too. If everybody started paying to win, some of those people would lose to others who paid more, and they would have reason to complain that they weren’t getting what they paid for. So these games needed to collect a population of players who were there to always lose, to keep the winners winning. This meant that the games needed to be fun to play even if you never won.\nMany games became entirely free to play and featured a progression system that rewards you for every minute you spend playing. Even you if you only have a few minutes to play, you can make immediate progress which continues to add up over time. Because everything you do leads to you advancing in the game, there is the dream that after enough time you might be able to start winning too. Of course, you would only be able to win against those who aren’t paying money. The players who are paying to win are untouchable, and people generally understood and accepted this.\nThis progression system by itself can feel rewarding enough that people are willing to spend small amounts of money to skip some of the required time. An example of this would be a city-building game where you can wait an hour for your building to finish, or spend a few coins to finish it right away. Again, money is used as a substitute for time and effort, and people are OK with it. Competition stops being a factor in these cases, so the game essentially becomes a single player game.\nPaying to win in console games: the worst of both worlds\nBecause these pay-to-win mechanics have been making so much money, larger game companies are starting to add similar features to their console games. Star Wars Battlefront 2 is a recent example that has received a lot of backlash for its payment mechanics. Some of the points that have caused the most trouble are:\n\nThe game costs $60 to play but tries to make you spend even more money within the game\nTo unlock key characters, you need to spend either money or a lot of time and effort\nTo upgrade your characters, you need to spend either money or a lot of time and effort\nIf you don’t have strong characters or strong upgrades, it’s almost impossible to win in multiplayer mode\n\n(The game also features lootboxes, which give a random item in exchange for currency. There is also a lot of backlash about the lootbox system in general since you can spend a lot of money and still not get what you want, but that’s a separate big topic that I won’t get into here)\nI actually think that the first 3 points aren’t a big problem by themselves. Just like with mobile games, it’s fine if people choose to spend money instead of time and effort. Of course, the game might be making time requirements extremely long on purpose to make people want to spend money instead, and that would be unfortunate. In general though, the money vs time/effort tradeoff is a fair one to make. But this only works in single-player games.\nCompetitive multiplayer games offer something very different to the player. $60 buys you entry to a playing field with fixed rules. How much you win, which is connected to how much fun you have, depends on your skill and effort. It’s understood that not everybody will win, but you’re at least promised a fair chance. If you’re not winning then the fault is yours.\nWhen players can pay to win it breaks that trust. It negates what you bought with that $60 package. Now it’s impossible to win against a group of users, regardless of your skill and effort. Even a progression system that improves your character over time is controversial. It’s fine to reward people for the time they spend, but there is a fine line between that and creating artificial barriers to punish people who don’t.\nPaying extra money to unlock Darth Vader quickly is fine. Making it extremely hard to win without Darth Vader is not. People are buying this game to test their skill again other players. When the game starts rewarding money spent over skill, these people are not getting what they paid for, and they have every right to complain."},"posts/perils-of-eroded-civic-knowledge-forewarned-by-fmr":{"slug":"posts/perils-of-eroded-civic-knowledge-forewarned-by-fmr","filePath":"posts/perils-of-eroded-civic-knowledge-forewarned-by-fmr.md","title":"Perils of Eroded Civic Knowledge Forewarned by Former Justice Souter","links":[],"tags":["politics","article","opinion","video","america"],"content":"This is extremely important."},"posts/picular":{"slug":"posts/picular","filePath":"posts/picular.md","title":"Picular - Google, but for Colors","links":[],"tags":["web","design","color","fun","search"],"content":"Picular is a site that lets you search for words like “water” or “summer” and see a list of related colors. It seems to work by running a Google image search and extracting the primary color of that image.\nThis is the kind of project I love. It’s simple and easy to understand, but fun to play with."},"posts/pipino-gentleman-thief-epic-magazine-medium":{"slug":"posts/pipino-gentleman-thief-epic-magazine-medium","filePath":"posts/pipino-gentleman-thief-epic-magazine-medium.md","title":"Pipino: Gentleman Thief — EPIC MAGAZINE — Medium","links":[],"tags":["article","biography","story","thief"],"content":"Magicians, Mafiosos, a Missing Painting, and the Heist of a Lifetime"},"posts/pluto-closest-approach":{"slug":"posts/pluto-closest-approach","filePath":"posts/pluto-closest-approach.md","title":"Pluto - Closest Approach","links":[],"tags":["article","pluto","nasa","space","photo"],"content":"Hello #Pluto! We’re at closest approach. Congrats to all! Follow our story &amp; view new images using #PlutoFlyby. pic.twitter.com/8JVlJrcUkY— NASA New Horizons (@NASANewHorizons) July 14, 2015\n\nAnd here is the best picture we had previously, taken by Hubble. Pretty amazing stuff\n"},"posts/political-surveys":{"slug":"posts/political-surveys","filePath":"posts/political-surveys.md","title":"Political surveys","links":[],"tags":["politics","psychology","opinion"],"content":"Studies show that people become much more likely to vote if somebody calls them and asks, “Are you planning on voting?” which is why all of the people who try to promote a certain candidate always start off with that question. Could you also ask somebody “Are you planning on buying a new Apple computer within the next month?” to boost sales?  "},"posts/pray-for-japan":{"slug":"posts/pray-for-japan","filePath":"posts/pray-for-japan.md","title":"Pray for Japan","links":["tags/prayforjapan"],"tags":["japan","tsunami","kindness","prayforjapan"],"content":"After the 3/11 earthquake, prayforjapan was a hashtag used for people around the world to send messages of encouragement to Japan. prayforjapan.jp is a site that is collecting heartwarming tweets from Japanese users, as well as messages from outside the country.\nI got emotional after reading just a few of these messages. The earthquake was a terrible tragedy, but amidst all of that I feel admiration for the spirit of the Japanese people. Messages like this show that people have really come together to help one another, and it give me great hope for the country’s recovery.\n\nI was sitting at the train station exhausted, when some of the homeless people came to me gave me some of their cardboard to keep warm. Even though we always ignore them as we walk by. It’s so warm.\n\n\nDuring my 4 hour walk back home, there was a woman with a sketchbook that said “Please use our bathroom!” who had made it available for public use. Japan is truly the warmest country in the world. I started crying after seeing that.\n\n\nI saw a group of children saying to a train station worker, “Thank you for working hard to keep the trains running yesterday.” The worker was crying. I was sobbing.\n"},"posts/procrastination-and-fear-of-failure":{"slug":"posts/procrastination-and-fear-of-failure","filePath":"posts/procrastination-and-fear-of-failure.md","title":"Procrastination and Fear of Failure","links":[],"tags":["personal","procrastination","lifehack","motivation","work"],"content":"I tend to procrastinate if I let myself, so I’ve tried my share of techniques to keep it in check. At some point, I read that a fear of failure can cause procrastination, and this really resonated with me. Realizing this has helped me understand where my urge to put things off is coming from.\nIf I have a large task in front of me, my mind rushes through everything that needs to be done and affirms how difficult it will be. I imagine (mostly subconsciously) all the ways that my output will be less than ideal, and that is what keeps me from taking action.\nSo as a quick mental technique, I recognize that this fear of failure is acting as a roadblock and tell myself that I’ll just bang out a first effort that will definitely be of poor quality. I know it will be bad, and that will be OK. Polishing that will be a task left for future me.\nIn reality, it won’t be perfect, but neither will it be terrible. Polishing it into something that I can be proud of will not be as hard as it seems now, especially once I have a first draft to work with."},"posts/programmers-stop-whining-be-productive":{"slug":"posts/programmers-stop-whining-be-productive","filePath":"posts/programmers-stop-whining-be-productive.md","title":"Programmers: Stop Whining, Be Productive","links":["posts/the-maker's-schedule-a-ten-year-retrospective"],"tags":["programming","business","manager","maker","work"],"content":"\n\n                  \n                  Update 2019 \n                  \n                \n\n10 years later, I have posted a reflection on this piece here\n\n\nI was pointed to Paul Graham’s post about programmers running on a separate schedule than other people. Programmers run on the “maker’s schedule” and prefer to work in large chunks of time, with units of at least half a day. Others, particularly their bosses, operate on the “manager’s schedule” and have things defined into hour-long chunks. Interactions between the two typically cause friction:\n\nI find one meeting can sometimes affect a whole day. A meeting commonly blows at least half a day, by breaking up a morning or afternoon. But in addition there’s sometimes a cascading effect. If I know the afternoon is going to be broken up, I’m slightly less likely to start something ambitious in the morning. I know this may sound oversensitive, but if you’re a maker, think of your own case. Don’t your spirits rise at the thought of having an entire day free to work, with no appointments at all? Well, that means your spirits are correspondingly depressed when you don’t. And ambitious projects are by definition close to the limits of your capacity. A small decrease in morale is enough to kill them off.\n\nThis is bullshit.\nI’m not attacking Graham; he is merely pointing out the problem and explaining how he responds: by placing managers on the maker’s schedule. But this mentality is held by too many programmers, each of whom strokes his or her ego by running on a special schedule and taking advantage of the night, while the inferior mortals sleep.\nCome on people, wake up (seriously, it’s 11 am already). This is not an issue of inability; it is an issue of discipline. I admit that interruptions are hard to recover from, and that a ten hour block is more productive than five two-hour blocks. But wasting an entire afternoon because you have an appointment at 3 is childish. Programmers get into a mode of thinking where they believe that the work they do is somehow more intense and more specialized than that of others. “I’m going to strap myself down and work for twenty hours,” they say, “because this is serious business. You can’t just scoot into your chair and tippy-tap for a few hours. You could really hurt yourself.” Again, bullshit.\nI had the pleasure of attending Eric Ries’ presentation on The Lean Startup. Among the huge wealth of insight he had to share, one particular anecdote stuck with me. His company had traced the root of a particular problem to insufficient training procedures for new hires. Upon speaking to a manager about this, the manager explained that he agreed the problem was there but that he had so much to do he couldn’t possibly devote several days to setting up a training program. Ries suggested that the manager take one hour right then to do whatever he would have done for the first hour of establishing the training program. The manager retorted by highlighting the absurdity of this response, but Ries persisted, and off he went. The result of his hour of work was the creation of a new wiki page with a dozen bullet points stating some things that were good to know. This turns out to be reasonably useful, and more importantly, a subsequent hour of work the next week could expand this and get a lot more done.\nI know it doesn’t always apply, but it’s commendable and inspiring. At work the next week, I found myself with 2 hours before a lunchtime meeting. I could have putzed around the internet for a couple of hours and saved my productivity to increase momentum in the afternoon, but I didn’t do that. Instead, I set up a quick database table and enabled logins on the website. After lunch I had a few minutes before a phone call, so I enabled logouts on the website. Rinse and repeat, you’ve got a social networking site by supper.\nMy point here is that anybody can be productive in any amount of time. It’s difficult, sure, and requires discipline. But productivity feels great, and it makes you far more flexible as a worker. It’s comparable to the sensation of waking up early to exercise and realizing how much time you had been wasting by sleeping past lunch. If you haven’t experienced this yet, I highly recommend it as well."},"posts/pvp-pacman":{"slug":"posts/pvp-pacman","filePath":"posts/pvp-pacman.md","title":"Game Idea: PvP Pac-Man","links":[],"tags":["game","idea","pacman","pvp","maze"],"content":"Concept\nPlay Pac-Man online against other players. 1 player plays as Pac-Man and 4 other players play as the ghosts. Pac-Man’s goal is to collect as many dots as possible, and the ghosts’ goal is to work together to catch Pac-Man. Players receive points at the end of the round based on performance, and roles are rotated for the next round.\nGameplay\nIn terms of strategy, the ghosts will need to work together in order to win. Pac-Man will move faster than the ghosts, so the ghosts’ main strategy will be to trap Pac-Man in a corner. To encourage teamwork, all ghosts will receive the same amount of points at the end of round regardless of who actually caught Pac-Man.\nThe fact that the ghosts can share information makes the game much harder for Pac-Man than the original, so he needs a new advantage too. We allow Pac-Man to see the entire map, but the ghosts can only see a small radius around them. The ghosts’ vision is shared with each other, so together they can see a large portion of the map.\nThe game then becomes a hide-and-seek game, where the ghosts spread out strategically to try to find Pac-Man. Pac-Man hides from them for as long as possible while collecting dots along the way. If the ghosts find an area with no dots, they will know that Pac-Man has already been there. Once Pac-Man is spotted, the ghosts converge on his position and Pac-Man must try to escape before becoming trapped.\nWith the gameplay changes, the characters should be changed as well. Some other ideas are:\n\nA squirrel collecting nuts vs. 4 wolves\nA thief collecting coins vs. 4 policemen with flashlights\nA human looking for supplies vs 4 zombies\n\nMockups\n{% include image.html image=“pacman-pac.jpg” description=“Pac-Man’s point of view” %}\n{% include image.html image=“pacman-ghosts.jpg” description=“The ghosts’ point of view” %}"},"posts/python-cron":{"slug":"posts/python-cron","filePath":"posts/python-cron.md","title":"Python script failing via cron","links":["2025/01/09/squirrel-archive-webpages-so-i-can-find-them-again"],"tags":["cron","debugging","python","scripting","bestpractices"],"content":"The issue\nI had setup a cron task to run my Squirrel Archiver script once per day, but for some reason the task was not executing. Nothing, including any errors, was showing up in any logs. At first I thought there was something wrong with my crontab, but other scripts set up to run in the same way were running without issue.\nCopying the commands in crontab to the terminal and running it manually worked. It was only when cron was triggering the run that it failed.\nJust to be sure, I changed my script to just print(&#039;hey&#039;), and this worked! So there must have been something wrong inside the script, and I started the tried and true debugging process of deleting chunks of code until something works.\nSide note: Since the script had to run via cron, while I was debugging it was set to run once per minute on the dot. I had to rush to make changes in time, but I also had to wait to see results, which made for an interesting experience.\nThe culprit\nI had been declaring openai_client = OpenAI() as a global variable, outside of any function. This worked fine when running the script manually, but when cron triggered it, it failed silently.\n“Why?”\nI have no idea.\n“Is initializing objects outside of functions commonly known to be a bad practice?”\nProbably.\nI wish I knew more about the reasons, but moving the declaration inside a function fixed the issue.\nSo, maybe to many it is obvious that “yes of course you shouldn’t do that”, but I’m recording it here in case anybody else out there is like me."},"posts/rebranding-the-site-invisible-parade":{"slug":"posts/rebranding-the-site-invisible-parade","filePath":"posts/rebranding-the-site-invisible-parade.md","title":"Rebranding the site: Invisible Parade","links":[],"tags":["personal","branding","rebranding","online","nostalgia"],"content":"I first started this personal website just about 20 years ago. It began as a couple of html pages, and spent time as a Wordpress blog, a Tumblr page, and is now a static blog generated by Jekyll. Through that time, it had always just had my name, alexonsager.com. This year, I’m rebranding it to Invisible Parade.\nBeing online then\nWhen I started this site I had just entered university, got my first MacBook, and was excited to become a full-fledged citizen of the internet. At the time, I thought it was cool to publish as much of yourself as possible. Tag yourself and your friends in the photos you take, scrobble the music you listen to, check in to the places you go, tweet your thoughts. Since I was broadcasting myself to the world, it made sense to put my name on my website. That’s how people would know me.\nAt the same time though, Daring Fireball was a cool site with the coolest name. Daring Fireball man, how do you top that?\nEnvious, I found a site that generates random adjective + noun combinations and hoped for inspiration. The second or third result I got was “invisible parade,” and I immediately loved the oxymoron. The whole point of a parade is to be seen by all of the people. What then, is the point of an invisible parade?\nThe name stuck in my head, and I think at one point I may have bought the .net. But I didn’t have anything to do with it, and eventually let it expire.\nBeing online now\nIt feels less in fashion to use your full name as a brand now. There is the risk of bad attention following you around, but also it’s just more useful to have a persona. There are literally a gazillion people online, so “hey I have a website” is not enough to make you interesting. You have to let people know people what you’re about, show some personality.\nMy real-name domain feels like showing up to a costume party with a name tag that just says “Hi, my name is Alex”. It doesn’t feel fun anymore!\nThe rebranding\nOn a whim I looked up the invisibleparade domain, and it was available. It felt right, so I nabbed it, and here we are. And it is kind of a perfect name for the site.\nI’m creating this parade of posts, if you will, and I’m putting in a real effort to make it interesting and nice to look at. But who’s even looking at it? What is the point of an invisible parade, or an invisible blog?\nWell, it’s fun! I like putting it together. And if anybody happens to stumble across it, I’ll be happy to show it off. So here’s to another 20 years of parading."},"posts/redesign-2025":{"slug":"posts/redesign-2025","filePath":"posts/redesign-2025.md","title":"A website redesign","links":[],"tags":["design","website","colors","theme","javascript"],"content":"I’ve overhauled the design of my website, and am very happy with how it turned out.\n{% include image.html image=“2025/index-redesign.jpg” description=“The root homepage. Old design on the left, new design on the right.” %}\n\n    \n    A post page in dark mode. Old design on the left, new design on the right.\n\nDesign considerations\nThe structure\nMy first inspiration was the concept of slash pages, which I love — they are very easy to understand, and have a fun vibe characteristic of simple webpages that are just collections of pages. I wanted to take it a step further, and use the structure of the website as a design feature. The navigation element is arranged like a file system, and the current page’s URL is displayed prominently in the header.\nThe colors\nI used colors from the uchū color palette by Wibby. I love these colors and was waiting for a project to use them in. I can tell that a lot of care went into choosing each shade, and it made handling the dark mode appearance fairly easy.\nWhich brings me to:\nDark mode\nThere is a toggle in the upper-right, but the site will otherwise default to respecting your OS’s preference. I stopped using prefers-color-scheme declarations and instead am using light-dark(), which is fantastic.\nI learned about it from this article by Sara Joy, which explained everything I needed to know and more. I won’t go into too many details here because you should just go read that article, but the main points of my implementation are:\n\nDeclare color-scheme: light dark; on &lt;html&gt;, to automatically switch themes based on the visitor’s OS.\nEach time I specify a color in the CSS, write it like color: light-dark(black, white) to define the color for light mode and dark mode, respectively.\nIf the theme toggle is clicked, update &lt;html&gt; to be only color-scheme: light or color-scheme: dark to lock it into the correct theme.\nSave the chosen theme to the browser’s localStorage to preserve the preference across visits.\n\nAll of the theme switching is done with Javascript, which has the advantage of creating a good fallback if Javascript is disabled — the default is to simply follow the OS’s preferences. And since the theme toggle button’s icon is drawn by Javascript to reflect the active theme, having no Javascript will render the button blank — which is perfect because it won’t do anything anyways.\nThat’s all the important things, I think\nYou can check out the source code here if you want to look inside.\nPlease reach out if something looks broken!"},"posts/reimagining-chess-with-alphazero":{"slug":"posts/reimagining-chess-with-alphazero","filePath":"posts/reimagining-chess-with-alphazero.md","title":"Reimagining Chess with AlphaZero","links":[],"tags":["chess","AI","game","alphazero","tech"],"content":"\nModern chess is the culmination of centuries of experience, as well as an evolutionary sequence of rule adjustments from its inception in the 6th century to the modern rules we know today. While classical chess still captivates the minds of millions of players worldwide, the game is anything but static. Many variants have been proposed and played over the years by enthusiasts and theorists. They continue the evolutionary cycle by altering the board, piece placement, or the rules—offering players “something subtle, sparkling, or amusing which cannot be done in ordinary chess.”\n\nUsing AlphaZero to evaluate modified rules, to see which would be the most productive is a really interesting application of the AI. You can evaluate beforehand whether a certain rule change would make the game less or more balanced."},"posts/relationship-test-dataclysm":{"slug":"posts/relationship-test-dataclysm","filePath":"posts/relationship-test-dataclysm.md","title":"Relationship Test - Dataclysm","links":[],"tags":["article","data","facebook","social-network","graph"],"content":"\nMy team and I wrote an app that will apply findings from a recent research paper to your Facebook graph. The app won’t post to your wall but it will show you both the shape of your friend network and which of your friends are most mathematically important to your life.\n\nInstead of looking at a metric like the number of friends you have in common, this algorithm takes it a step further. It looks at how well connected your mutual friends are with each other, and suggests that having more diverse mutual friends indicates a stronger, more important relationship.\nIf everyone at work is connected via Facebook, then you will have many friends in common with your coworkers, but this doesn’t mean that these are your most important relationships. Since all of your common friends are within the same social circle, you know that these relationships are limited in scope.\nBut if you and a friend’s mutual connections include coworkers, college roommates, and cycling buddies, then you know that your relationship with this person spans many social circles, and they are more likely to be important to you. This also is effective at picking out romantic relationships.\nThere seemed to be issues with outliers when I tried it because there were a number of people with little or no mutual friends with very high scores, but in general the results were surprisingly accurate. \nIt’s also fun to look at the graph of your network and see the clusters of different social circles."},"posts/remove.bg":{"slug":"posts/remove.bg","filePath":"posts/remove.bg.md","title":"Remove.bg - Remove the Background of Any Photo","links":[],"tags":["AI","app","photography","tool","service"],"content":"{% include image.html image=“removebg.jpg” description=“Image: Remove.bg” %}\nRemove.bg is a great service that makes it easy for anyone to remove the background of a photo. You can use it with small images for free, and pricing for HD photos seems very fair: you can pay 2 per image, or get a subscription starting at 9 per month."},"posts/ricky-jays-magical-secrets":{"slug":"posts/ricky-jays-magical-secrets","filePath":"posts/ricky-jays-magical-secrets.md","title":"Ricky Jay’s Magical Secrets","links":[],"tags":["magic","biography","article"],"content":"Ricky Jay is a legend, and is without a doubt one of my favorite magicians to watch. His shows leave you with a greater appreciation for the magician’s craft, rather than just the immediate illusion they present."},"posts/samasource-selected-for-fbfund-rev":{"slug":"posts/samasource-selected-for-fbfund-rev","filePath":"posts/samasource-selected-for-fbfund-rev.md","title":"Samasource Selected for fbFund REV","links":[],"tags":["samasource","facebook","business","nonprofit","startup"],"content":"Hooray! Along with 18 companies and one other non-profit, Samasource was chosen to participate in fbFund’s incubator program this summer. Check out the full list of winners on VentureBeat or InsideFacebook.\nWhat this means is that we’ll have Palo Alto office space, lots of media attention, an official Facebook seal of approval, and possibly free lunches /crossfingers. The catch?\n\nDue to the way fbFund is structured, the non-profit startups cannot receive funding (Facebook dev blog).\n\nBummer…\nSamasource’s Facebook product will allow developers to create work opportunities for underprivileged workers by setting up periodic testing for their active applications. With Samasource, developers lower costs, reduce poverty, and improve their applications. Being chosen as a fbFund winner, despite not entailing cash, is extremely significant. Samasource, along with Vittana, the other non-profit winner, is poised to be a frontrunner of social entrepreneurship within the Facebook ecosystem. Being able to work with Facebook officially should greatly increase product quality, market penetration, and overall social impact. Samasource also will provide a valuable service to application developers, so I have high hopes for the success of this project.\nNow a quick word about changes within fbFund. Previously the fund awarded grants to the winners, but this year the funding is in the form of an equity investment (more coverage here). This makes sense, and I think it’s a reasonable change. It does put the non-profits in an awkward spot, but I believe that’s just growing pains. Two non-profits were chosen this year, and that’s a big deal. Optimism tells me that social entrepreneurship will hold a much more prominent position in the years to come. Exciting things are happening in the world of social change, and Samasource is fortunate enough to be able to make an impact in a high-visibility environment. We will not disappoint."},"posts/shape-up-how-basecamp-does-product-development":{"slug":"posts/shape-up-how-basecamp-does-product-development","filePath":"posts/shape-up-how-basecamp-does-product-development.md","title":"Shape Up - How Basecamp does Product Development","links":[],"tags":["product","management","work","team","basecamp"],"content":"Shape Up is an amazing new web-book by Basecamp that details the process they use to define, build, and ship their products. It has great insights, but I especially appreciated how many of the ideas presented just make a lot of sense. I often nodded along in agreement and recognized concepts that we share in our team. The framework is battle-tested and realistic, and there’s a good chance I’ll be able to integrate some new ideas into our existing workflow without having to reorganize how we think about everything to fit a new metaphor.\nWhat I found the most impressive was how clearly they have defined the key ideas and concepts behind their process. Even if your team can find a groove and settle into a good way to work effectively, it takes a lot more effort to recognize why these things work and how they can be reproduced in different situations. Reading this document helped to solidify a lot of ideas I had encountered before but not fully appreciated.\nThe full document deserves a thorough read-through, but here is a summary of the main points for quick reference:\n\nRaw ideas are shaped into a concept pitch, with implementation details left open for the team to work out.\nPitches are considered at a betting table and chosen for six-week work cycles.\nSmall teams of developers and designers will be given a shaped concept and six uninterrupted weeks to finish.\nWork is broken up into scopes that incorporate front and back-end work. Scopes are finished roughly in sequence.\nThe status of scopes is displayed as being uphill (still containing unknowns) or downhill (solved and being executed)\nThe work must be shipped within the allotted time. Unfinished work won’t get an extension\nMeanwhile, new concepts are shaped in parallel. The next betting table is held during a two-week cooldown between cycles.\n"},"posts/sorry-the-elevator-is-crowded":{"slug":"posts/sorry-the-elevator-is-crowded","filePath":"posts/sorry-the-elevator-is-crowded.md","title":"Sorry the Elevator is Crowded","links":[],"tags":["product","elevator","office","japan","life"],"content":"The elevator in our office building has a small LCD panel that shows information like the current floor, but when the total weight of passengers crosses a certain threshold it also adds a short note: “Sorry the elevator is crowded”.\nIt struck me – of all possible features for an elevator display, how did they decide that they needed this one? It has no impact on the elevator’s function of moving people vertically. And a crowded elevator is not the elevator’s fault (although this is most likely just an example of Japan’s self-deprecating approach to hospitality). So why was this message deemed necessary?\nThe answer, of course, is that when designing an elevator your customer is not the people riding the elevator. It’s the people buying the elevator, such as the owners of an office building. When they compare your elevator to competitors, “Ours will make your building more pleasant to visit” must be a key selling point.\nThis was a little reminder for me that it’s crucial to identify your true customer because it will have an enormous effect on your product’s direction."},"posts/spaghetti-carbonara":{"slug":"posts/spaghetti-carbonara","filePath":"posts/spaghetti-carbonara.md","title":"Spaghetti Carbonara","links":[],"tags":["cooking","pasta","cheese","recipe","life"],"content":"For a long time I thought I didn’t like carbonara because the few I tried were too creamy and eggy. Recently I gave it another try because the picture in the menu looked delicious. It was excellent, and I decided I wanted to learn how to make it myself. I needed some practice before I felt comfortable with the timings, but overall it’s a pretty simple recipe that wasn’t hard to learn.\n{% include image.html image=“carbonara.jpg” width=“500px” %}\nIngredients\n\nSpaghetti for 2\n2 eggs\n1 block of parmesan cheese\n1 block of bacon, cut into chunks\n1 clove of garlic\nPepper\nOlive oil\n\nNotes\n\nThere are no weights and volumes because I can’t be bothered to measure things.\nYou can use 3 egg yolks if you want the sauce to be thicker.\nPecorino cheese might be more authentic, but parmesan is totally fine.\nPancetta might be more authentic, but I personally prefer normal bacon (gasp!).\nThe cheese and pepper tastes better if it’s freshly grated/ground.\n\nMethod\n\nStart cooking the pasta in boiling salted water until al dente.\nBeat the eggs in a bowl, and grate in the cheese.\n\n\nKeep adding cheese until the sauce becomes thick and creamy.\nAdd pepper to taste.\n\n\nHeat the garlic with olive oil in a frying pan over medium heat, and cook the bacon.\n\n\nCook the bacon until it starts to crisp on the outside.\nTake out the garlic once the bacon is done cooking.\n\n\nOnce the pasta is ready, add it to the frying pan and mix well with the bacon.\n\n\nAdd the pasta directly to the pan with tongs (instead of using a strainer) to get a nice amount of pasta water as well.\nRemove the pan from the heat here and take your time, so that the pan is not too hot when you add the sauce.\n\n\nAdd the sauce and mix well.\n\n\nThe heat from the pasta will be enough to gently cook the egg.\nIf the pan is too hot here, you will get pasta with scrambled eggs (gross).\nIf the sauce seems too thick, add some more pasta water.\n\n\nServe with some extra cheese and pepper on top.\n"},"posts/squirrel---archive-webpages-so-i-can-find-them-again":{"slug":"posts/squirrel---archive-webpages-so-i-can-find-them-again","filePath":"posts/squirrel---archive-webpages-so-i-can-find-them-again.md","title":"Squirrel - Archive webpages so I can find them again","links":[],"tags":["bookmarking","saving","automation","searching","content"],"content":"{% include image.html image=“2025/squirrel.png” %}\nI created a thing that lets me save webpage contents in a smart way. I know, there are a million bookmark managers and web archivers out there, but this one is for me.\nThe Motivation\nFrom Pinboard:\n\nDo you half-remember interesting things you saw online six months ago, but struggle to find them in a search engine?\n\nYes, yes, a hundred times yes. This happens to me all the time. Searching my history doesn’t work because usually the keywords I remember are not in the title. Google et al. aren’t much help either.\nI want a way to have the contents of the pages I visit be searchable, in a smart way.\n\nMy Requirements\n1. Minimal friction to saving content\nIf I need to go through an entire workflow or remember some specific key combinations, I’m probably not going to use it. I want this to become a subconscious action whenever I finish reading something interesting.\nPinboard’s javascript bookmarklet is very good, but unfortunately I then need to manually add tags and a description. I mean, I don’t have to, but the bookmark is significantly less useful if I don’t.\nI used the Obsidian Web Clipper for a while, and it was actually very good. The article text is saved in a new note, and tags and summaries are extracted from the page’s metadata if they exist. But, and I know this is a nitpick, it takes a few steps each time:\n\nClick the button\nClick “Add to Obsidian”\nSay “Yes I want to allow this site to to open Obsidian”\nObsidian opens automatically with the new note\nNavigate back to the browser, to continue what I was doing\n\nEvery time. It’s friction.\n2. Easy to run a text search across the full text\nTitles and URLs are not enough. I want to expose the full article text to search, too.\nPinboard again, only allows me to search titles + manual summaries + bookmarks. I can pay $39 a year to enable full text search, but that’s kind of expensive and leads to the next point:\n3. Not expensive\nI mean, a couple of dollars a month isn’t that much. But they add up. This seems like the kind of problem that I, a non-power user, should be able to solve pretty cheaply.\nTangentially, I also really liked the idea behind Browser Parrot, which seems to have been replaced by Browser Gopher. It automatically saves every page from your browser history, and can extract the full text.\nThe problem with this was that it ended up using lots of CPU, and the archive took up a lot of space, too. I think that in practice, 90% of the pages I visit are not worth saving.\nOther things that aren’t needed but might be nice\n\n\nSome kind of tagging system (minimum friction of course) so that I can link related information and re-discover old items.\n\n\nAn accessible format to save the data. I prefer plain text to a database, because I can browse and open text files from Finder, or use them later for whatever I need.\nWould a database be more byte-efficient and make searching faster? Maybe. But since I’m not going to be saving millions of files, it probably will not make much of a difference.\n\n\nBased on the above, my solution\n1. Put any webpage I want to save into a text file\n\nUpdate 2025/02/14\nI wanted to use a folder in Safari bookmarks to save URLs since the OS already has handy hotkeys and utilities, but unfortunately editing the plist file by hand caused sync issues, so I gave up.\n\nI set up a Shortcut to grab Safari’s URL and add it to a text file urls.txt, which lives on my iCloud drive.\n2. Run a script that periodically looks at urls.txt and processes new items\nSetting a cron task to run this script once per day is fine. The text file is wiped after each run, and URLs that failed for some reason are saved to a separate file.\n3. Access the URL to save the title and article text\nPython libraries can do this easily. There is a lot of optimization that could be done to check for errors and edge cases, but as a personal project I don’t need it to be bullet-proof. Just a simple grab and dump.\n4. Use ChatGPT to generate tags and a short summary automatically\nThis sort of thing is what AI was born to do. Having an automatic tagging system is such a luxury, and doing it directly through the API is dirt-cheap.\n5. Package into a text file, and output to a local folder\nNow I have a single folder on my hard drive that holds all of the articles that I thought were worth reading.\n6. Open the folder as an Obsidian Vault\nSearching the article contents is very fast, and I can use graph view to explore tags. I can probably do a lot to make it more useful, but for now it’s pretty.\n{% include image.html image=“2025/squirrel-graph.png” description=“Obsidian graph view. Black nodes are notes, green nodes are tags” %}\nBonus\nIt also was super easy to set up an edge case for YouTube videos. Instead of grabbing the page body’s text, it instead uses the YouTube API to grab transcripts from the video. This is turning out to be a great way in general to extract information from YouTube and make it accessible to me later.\nThe Script\nIs on Github\nMy intention is not to promote this for wide use, but you can feel free to fork it if you think it might work for you.\nMy archive now\nI went through the bookmarks I had saved in various places and ran them all through this script. After pruning dead links, I had about 500 articles saved over the course of 17 years. My most used tags are:\n\nTechnology\nInnovation\nDesign\nSustainability\nEnvironment\nDevelopment\nAI\nCommunity\nCreativity\nJavascript\n\nSustainability and Environment were a surprise. I guess that when I read articles about those topics, I feel compelled to save them?"},"posts/star-wars-oil-paintings":{"slug":"posts/star-wars-oil-paintings","filePath":"posts/star-wars-oil-paintings.md","title":"Star Wars Oil Paintings","links":[],"tags":["art","painting","star-wars","space"],"content":"{% include image.html image=“2021/star-wars-oil.jpg” %}\nI’ll always have a soft spot for Star Wars things, but these paintings by Naci Caba are wonderful. The colors add a great bit of flavor especially to scenes in space that would otherwise be predominantly black and grey."},"posts/the-compo-challenge":{"slug":"posts/the-compo-challenge","filePath":"posts/the-compo-challenge.md","title":"The Photo Composition Challenge","links":[],"tags":["photography","composition","techniques","improvement","challenge"],"content":"I am a mediocre photographer at best, but of course I want to improve. When I saw that @hiro was putting together 5-week challenge to experiment with various compositional techniques and share our photos, I had to join.\nI don’t have fancy gear, or a lot of time to go hunting for photos, so almost all of my shots were scenes from my daily life, taken with an iPhone. I realized pretty quickly though, that being deliberate about composition gave a new perspective on even familiar scenes, and I was surprised at compelling some of the photos turned out.\n\nWeek 1: The Rule of Thirds\n\nThe Rule of Thirds challenge is all about getting your subject out of the middle of the frame.\nImagine your frame is divided into three equal segments from left to right, and then again from top to bottom, creating a 3×3 grid. Try to place your subject along one of the lines dividing the thirds, so it’s not squarely in the middle third.\n\nThis was a rule I was aware of! I even had the overlay turned on in my Camera app to divide the view into thirds, so now I just need to be deliberate about the positioning.\nMy photos\n\n    \n        \n            \n        \n    \n    \n        \n            \n        \n    \n    \n        \n            \n        \n    \n\nThe third photo here is my favorite. It is from our kids’ bedroom, and I’m happy that I was able to capture it like this.\nWeek 2: Leading and Diagonal Lines\n\nLeading lines are lines within the frame of your shot that naturally draw the viewer’s eye to your subject.\nDiagonal lines […] create a sense of movement and tension [… and] can also enhance depth, adding a more three-dimensional quality to your composition.\n\nThis may have been my favorite exercise. I learned that I really like the aesthetic of leading lines, but unfortunately couldn’t find many good subjects myself. This will be something that I will continue to look out for!\nMy photos\n\n    \n        \n            \n        \n    \n    \n        \n            \n        \n    \n    \n        \n            \n        \n    \n\nI like the third photo here, again. I thought it would be neat to get a thin view of the sky between two tall buildings, and found the perfect spot. Then I spun the picture around in an editing app to find just the right claustrophobic angle.\nWeek 3: Frame Within A Frame\n\nWhereas Leading Lines used lines within your photo to point to the subject, this technique asks you to find ways to create a frame around your subject in your composition\n\nI had a hard time finding good subjects again, and 2/3 of my frames ended up just being long corridors. But they are cool shots!\nMy photos\n\n    \n        \n            \n        \n    \n    \n        \n            \n        \n    \n    \n        \n            \n        \n    \n\nWeek 4: Subject Isolation + Contrast\n\n[Contrast] could be very visual by putting a brightly lit subject against a dark background, or color based by contrasting a bright red rose against green foliage, or even conceptual with something like capturing someone who is clearly quite happy on a bus surrounded by dour fellow passengers.\n\nI was surprised that this exercise was the hardest for me. I tried not to rely on just using bokeh to highlight the subject, and it was hard to find things that just naturally stood out from their surroundings. Not only was I tardy in finishing this week, I only managed to take two photos that I was happy with. So it goes.\n\n    \n        \n            \n        \n    \n    \n        \n            \n        \n    \n\nWeek 5: The Golden Spiral\n\n[The Golden Spiral is] about arranging the elements in your photos along the lines of an imaginary spiral, so that it offers an easy and natural flow for the viewer to follow those elements to your subject.\n\n{% include image.html image=“2025/golden_spiral.png” description=“The Golden Spiral” %}\nIn practice, this ended up being an exercise in imagination as much as photography, as finding subjects that lined up to this mathematically perfect spiral was pretty challenging.\nMy photos\n\n    \n        \n            \n        \n    \n    \n        \n            \n        \n    \n    \n        \n            \n        \n    \n\nThe spaceship photo is probably the one that follows the spiral the closest, and the your eyes naturally flow in the same direction, too. The photo itself could have been better, but that’s what learning is for.\nWrapping up\nAnd that’s all! Thank you a hundred times to Hiro for organizing this! I had a wonderful time taking photos, as well as seeing everyone else’s submissions. If there is a next time, I will definitely be joining again."},"posts/the-elegance-of-the-hedgehog":{"slug":"posts/the-elegance-of-the-hedgehog","filePath":"posts/the-elegance-of-the-hedgehog.md","title":"The Elegance of the Hedgehog","links":[],"tags":["book","review","philosophy","Muriel-Barbery"],"content":"Profoundly moving\nBy Muriel Barbery, this novel is the story of two hyper-intelligent individuals living among Paris’ high society: Renée Michel, the concierge of the apartment building, and Paloma Josse, the shockingly perceptive 12-year-old. They seem to embody everything that the privileged elite should be but isn’t; the juxtaposition of their wisdom and class against the frivolous and shallow natures of those around them constantly lashes out at the empty finicking of the bourgeois lifestyles.\nAt the same time, this tiresome emptiness is contrasted with Japanese aesthetics, which often find beauty in simplicity. The line between nullness and emptiness is a thin but important distinction. Japanese art and culture are a constant source of peace for the two. Surely it is no coincidence that the arrival of the Japanese man is what brings new meaning into their lives.\nThe book is incredibly dense with wonderful material. Most of the book is structured to have one profound thought per chapter, and this adds up to a huge mass of wisdom and perceptiveness. Most authors, having arrived at one of these insights, would probably attempt to write a book about it, a masterpiece (they hope) which pivots around a truly thought-provoking idea. Barbery, on the other hand, had the audacity to fill the book with these thoughts and reveal one per chapter. It almost feels wasteful, seeing myself briefly appreciate the beauty of one chapter before hurrying off with excitement to see what will come next.\nI wish I could comment more on the significance of Tolstoy, but I am grossly ill-versed. Maybe I’ll revisit this after reading Anna Karenina and re-reading The Hedgehog and the Fox."},"posts/the-geometric-nests-of-the-white-spotted-pufferfish":{"slug":"posts/the-geometric-nests-of-the-white-spotted-pufferfish","filePath":"posts/the-geometric-nests-of-the-white-spotted-pufferfish.md","title":"The geometric nests of the white-spotted pufferfish","links":[],"tags":["pufferfish","discovery","nesting","japan","marine"],"content":"The white-spotted pufferfish, or Amami hoshizora fugu, is a species of pufferfish newly discovered in 2014 near Japan’s Amami-Oshima Island. The males spend roughly a week constructing an elaborate circular nest about 2 meters in diameter to attract females.\nDivers had known about these structures that appear in early summer every year, but apparently it took a while to catch the fish in action.\n{% include image.html image=“2025/whitespottedpuffer_nest.jpg” description=“The circular nest of the white-spotted pufferfish” %}"},"posts/the-incredible-network-of-children":{"slug":"posts/the-incredible-network-of-children","filePath":"posts/the-incredible-network-of-children.md","title":"The Incredible Network of Children","links":[],"tags":["children","nostalgia","game","communication"],"content":"When we were kids, we didn’t use online forums, message boards, or FAQs. Yet somehow, every single child knew that if your videogame wasn’t working, you just needed to blow in the cartridge. And it’s not like anybody documented Red Rover or Wall Ball or Groundies/Lava Monster. Kids just talked to each other and figured it out."},"posts/the-maker's-schedule-a-ten-year-retrospective":{"slug":"posts/the-maker's-schedule-a-ten-year-retrospective","filePath":"posts/the-maker's-schedule-a-ten-year-retrospective.md","title":"The Maker's Schedule - A Ten Year Retrospective","links":[],"tags":["programming","business","manager","maker","work"],"content":"10 years ago, I was fresh out of college and encountered Paul Graham’s essay about the maker’s schedule, and wrote [a response]({% post_url 2009-07-24-programmers-stop-whining-be-productive %}) disagreeing with the spirit of the article. While I knew and understood that programmers could be much more productive in one 10 hour chunk than in five 2 hour chunks, I felt like rearranging a business’s operations based on these preferences was going overboard. The typical programmer as described seemed undisciplined, and I wrote that programmers needed to find ways to work around distractions, which are simply a fact of life.\nAs expected the post got a lot of negative feedback, but it was all very informative. Rather than just telling me to shut up, many people shared their own views and explained where my reasoning might be shortsighted. One person said they would be interested in seeing how I would react to my own post in about 10 years time, so here I am.\nI wrote the post as a programmer and took advantage of that position to say some pretty harsh things about programmers in general. I was surprised to see that I wrote the post when I was only a few months out of college, so I definitely had far more ego than I deserved. While I can understand the points I was trying to make, if I were to try the same thing now I would be much more civil about it.\nI didn’t disagree with PG’s main point, namely that distractions are always bad for productivity but probably affect programmers more than other professionals. I felt though, that resigning to losing an afternoon because of a one-hour meeting was too defeatist. It is possible to minimize setbacks. There always will be some room for productivity in a short window of time. You won’t be able to develop a large complex function, but there is probably something else you can do instead to spend the time productively.\nIronically, gaining some experience as a manager (or possibly just growing up a little) has made me more sympathetic to the makers’ needs. I used to see a list of demands as a sign of being pampered, but now I can appreciate that every effort to make a workplace better is important.\nSo today, with 10 years of experience under my belt, I would say that I think the truth is somewhere in the middle. Both articles were describing an ideal. The reality is that everybody has to work together, be sympathetic to other people’s needs, and compromise. PG’s essay was much more valuable though because the managers are the ones with power, and the compromise was often lopsided."},"posts/the-night-my-girlfriend-dissociated-and-forgot-who":{"slug":"posts/the-night-my-girlfriend-dissociated-and-forgot-who","filePath":"posts/the-night-my-girlfriend-dissociated-and-forgot-who.md","title":"The Night My Girlfriend Dissociated and Forgot Who I Was","links":[],"tags":["life","psychology","article","people","story"],"content":"\n  Because of her dissociative identity disorder, I was a stranger in the eyes of the woman I loved.\n\nBeautifully written, and a reminder that something like 50 First Dates is actually a terrifying situation"},"posts/the-rise-of-the-professional-cyber-athlete":{"slug":"posts/the-rise-of-the-professional-cyber-athlete","filePath":"posts/the-rise-of-the-professional-cyber-athlete.md","title":"The Rise of the Professional Cyber Athlete","links":[],"tags":["esports","game","biography","article"],"content":"Very cool profile of Scarlett, a professional StarCraftII player"},"posts/the-sociable-weaver":{"slug":"posts/the-sociable-weaver","filePath":"posts/the-sociable-weaver.md","title":"The Sociable Weaver","links":[],"tags":["bird","nest","africa","community","sociable"],"content":"The sociable weaver is an African bird that creates giant, community nests in trees. The nests look like a giant woolly mammoth hanging in a tree, and have many entry holes on the bottom. These nests can house over 100 pairs of birds, spanning multiple generations at a time.\n{% include image.html image=“2025/sociable_weaver.jpg” description=“Photo from Wikipedia, by Harald Süpfle” %}"},"posts/the-time-everyone-corrected-the-worlds-smartest":{"slug":"posts/the-time-everyone-corrected-the-worlds-smartest","filePath":"posts/the-time-everyone-corrected-the-worlds-smartest.md","title":"The Time Everyone “Corrected” the World’s Smartest Woman","links":[],"tags":["article","probability","math","gender"],"content":"\n  In 1990, Marilyn vos Savant correctly answered a probability puzzle in her column for Parade Magazine. And then, the world called her an idiot.\n\nI still remember the chaos caused by the Monty Hall problem in our high school math class. Here&#039;s my explanation for how it works:\nYour first choice could either be a car or a goat.\n  \n    If you picked the car, you will win the car by not changing your guess.\n    If you picked a goat, the host will reveal the second goat. The last door left will be the car, so you are guaranteed to win if you change your guess.\n  \nYou have two possible strategies to win the car:\n  \n    Try to pick the car on your first guess, and don&#039;t change the guess.\n    Try to pick a goat on your first guess, and change the guess after the host opens another door.\n  \nThe second strategy is better, since picking a goat is twice as easy as picking the car.\n\nThe best strategy is to try to pick a goat in round 1. Once the host has revealed the second goat, you are guaranteed the car by switching doors."},"posts/the-value-promise-of-subscription-games":{"slug":"posts/the-value-promise-of-subscription-games","filePath":"posts/the-value-promise-of-subscription-games.md","title":"The Value Promise of Subscription Games","links":[],"tags":["game","business","analysis","mmo","product"],"content":"I had been playing World of Warcraft on and off for about 10 years, but I decided to stop playing again about a year ago. I quit because of a series of changes that were made to the game, and it motivated me to think about why I reacted that way as a paying customer.\nA series of recent changes made to WoW were designed to motivate players to play by ensuring they always gain something and grow a little every time they play. Unfortunately, a side effect of these changes was an increased pressure to spend many hours playing. This made me feel like my limited time spent in the game was less valuable, and is what ultimately led to me quitting the game.\nWhat makes a subscription-based game worth its price?\nAll games need to convince people that what they are buying (whether it’s a complete game, an item, or another month of game time) is worth the price. [I wrote previously]({% post_url 2017-11-30-pay-to-win %}) about what mobile games do to make people want to buy extra items. Online games where players pay a fixed amount every month have a very different strategy.\nUnlike games that sell items, games with a subscription model don’t need to maximize revenue per user because everybody pays the same price. Instead, the most important metric is how many people will keep playing the following month. The total revenue per user is determined by how many months they spend playing the game.\nTraditional console games need to convince people to pay money just once. “$60 will get you more than 100 hours of fun gameplay!” On the other hand, subscription-based games need to convince people to pay money every month. One thing that helps people make a decision is whether they felt like the previous month was worth the price. So online games do their best to make sure that people are always satisfied with the time they have spent playing the game so far.\nHow to design a subscription-based game\nMost online RPGs follow a basic progression system that can give players a fun game experience over a long period of time. You enter a dungeon, beat a few bosses, and get a few strong items. The dungeons reset each week, and since those new items make you a little bit stronger you can get a little further in the dungeon. After a few months you are strong enough to defeat the final boss, and by that time the game will (hopefully) soon release a new dungeon.\nYou always have a challenge, and you are always making progress towards completing the challenge. It’s almost like you’re buying and playing a new small game every few months, but it’s much more meaningful because you keep the same character who is constantly growing stronger.\nSo then, what can go wrong and make people want to stop playing?\nPeople pay for their time. Don’t make them waste it.\nThe most competitive players will defeat all of the game’s bosses very quickly, and have little to do inside the game until the next dungeon is released. If there is nothing meaningful to do inside the game, then there’s no reason to spend money to keep playing. Making social elements important or having players battle each other are possible solutions, but online games constantly struggle to make sure that high-ranked players will always have a reason to keep playing.\nIn other cases, a player might have plenty left to do but still feel like their time in the game was not spent well. You could play for many hours fighting bosses, but never manage to get any new strong items just because you were unlucky. All of the time spent fighting bosses would feel lost because you gained nothing for your effort.\nAt the end of the month, players will ask themselves, “Did I get my money’s worth last month?” If you spent $15 to play a game but didn’t make any progress, you might feel like that was a waste of money.\nSo WoW started to reward people for the time they spend playing the game. Now you constantly get special experience points when you play, and this will make your items stronger. Because you are always gaining these experience points it is guaranteed that none of your time will be a total waste. People can spend more time playing the game and be satisfied that it was time well-spent. Problem solved, right?\nNot quite.\nPeople pay for their time. Don’t devalue it.\nThe issue is that if every hour you spend in the game makes you stronger, you are now required to spend many hours playing the game if you want to be strong. Before, I could play for a few hours on the weekend fighting bosses and if I was lucky I would get some great items and be a strong player. I was happy with that. But now having the good items isn’t enough. I’m required to make my items stronger by spending many more hours gaining extra experience points to improve them.\nIn that sense, the time I spend fighting bosses is only meaningful if I also spend more time making the items stronger. Without the extra time put in, I can only get weak items from bosses. And what if I can’t because I’m too busy during the rest of the week? My time spent in the game, which hasn’t changed, is now worth less because I get less benefit from it. I now feel like I’m no longer getting my money’s worth from the game. And ironically, the cause was a new system designed to make every hour spent in the game feel more valuable.\nWhat was wrong with these changes?\nMaking all time spent in the game directly make you stronger doesn’t work well in MMOs. In mobile games, it’s fine to reward time spent playing because it works as an alternative to paying money. Competitive players can choose to spend either time or money to become stronger, and non-competitive players aren’t affected because they lose nothing by playing the game for free. But if you are paying a monthly subscription, then having a disadvantage because you don’t have extra time or money is a terrible experience. MMOs generally don’t allow people to pay money to become stronger, and allowing people to spend time to become stronger can lead to similar issues.\nGiving an advantage to hard-core players is not a great business decision, especially if it makes the game less fun for more casual players. This is because no matter how dedicated a player is, they will only spend the same amount of money as a casual player. If a game gets the majority of its revenue from a small group of hard-core players, it’s fine to focus on them. But in an online game where everybody spends the same amount of money, the majority of revenue will come from more casual players and they are the ones for whom the main gameplay should be designed.\nI’m not sure what circumstances motivated the changes to WoW, but I think there had to be better solutions. If hard-core players were running out of things to do, maybe add more cosmetic rewards, or create one insanely difficult version of the current dungeon that most people can not complete. Or if casual players were having a hard time progressing within a limited time, then you can add safety mechanics that guarantee a good item after a certain number of unlucky attempts with no rewards.\nThe latest version of WoW added changes that affected the core gameplay for all users and unfortunately did it in a way that gave a disadvantage to many casual players. I would guess that these people made up a large portion of the game’s players, and worsening their game experience may prove to do more harm than good."},"posts/the-world's-most-beautiful-data-center":{"slug":"posts/the-world's-most-beautiful-data-center","filePath":"posts/the-world's-most-beautiful-data-center.md","title":"The World's Most Beautiful Data Center","links":[],"tags":["article","photo","computer","art","travel"],"content":"{% include image.html image=“torre-girona.jpg” description=“Image: Barcelona Supercomputing Center” %}\nThe Torre Girona Chapel was deconsecrated in the 70s, and now houses the MareNostrum supercomputer.\n\n“We were in need of hundreds of square meters without columns and the capacity to support 44.5 tons of weight,” Maspoch told me in an email. “At the time there was not much available space at the university and the only room that satisfied our requirements was the Torre Girona chapel. We did not doubt it for a moment and we installed a supercomputer in it. ”\n"},"posts/thelonius-monks-advice-to-saxophonist-steve-lacy":{"slug":"posts/thelonius-monks-advice-to-saxophonist-steve-lacy","filePath":"posts/thelonius-monks-advice-to-saxophonist-steve-lacy.md","title":"Thelonius Monk’s advice to saxophonist Steve Lacy (1960)","links":[],"tags":["article","photo","jazz","music"],"content":"\nFound here first"},"posts/thoughts-on-sourcecode":{"slug":"posts/thoughts-on-sourcecode","filePath":"posts/thoughts-on-sourcecode.md","title":"Thoughts on \"Sourcecode\"","links":[],"tags":["movie","review","dimension","scifi"],"content":"I’ve finally come to terms with the movie Sourcecode. But at first, I hated it.\nThe premise is that scientists have built a machine that can:\n\nextract remnants of memory from a person’s brain and\nallow a 2nd person’s consciousness to then enter those memories and experience them firsthand.\n\nThey then use this machine to have someone enter the memory of a person present at a train bombing, so that he can find the culprit and stop the next crime.\nThe ridiculous premise bothered me more than it probably should have, because it seemed like the movie had tried to come up with a reasonable scientific explanation but had failed miserably.\nIf the main character were entering a person’s extracted memory, then once he deviated even slightly from the original experience, the memory should have turned hazy, become broken, or disappeared entirely. The fact that he was able to change the outcome within the memory suggests either that he was projecting his own self-conscious upon the memory, in which case the outcome is fabricated and therefore useless, or that the experience was not actually a memory but was in fact a separate world/timeline.\nThey actually touch upon the latter possibility and show scientists wondering if maybe that is what’s happening, but the idea that scientists had tried to create a memory playback machine and had accidentally made a parallel dimension generator is ludicrous. The movie’s presentation of this alternate explanation made me reject the possibility immediately.\nBut that is actually the far more interesting explanation. Consider that the scientists had intended to create a parallel dimension generator, and had succeeded. They needed memory remnants taken from someone’s brain to specify the junction point in our dimension’s timeline, and the machine can then branch off space-time at that point to create a separate timeline. Further, they are able to inject a person’s consciousness into the new timeline, and when he dies in that other timeline, his consciousness jumps back (the last point is iffy, but I’m willing to let that slide).\nNow, the movie becomes a rich philosophical discussion about the value of life, and what you can consider to be a soul.\nThe scientists are aware that they are creating a new branch of space-time every time they use the machine. Every time a train blows up, that train’s passengers die. We now have the moral dilemma of how much value to place on those lives. They might merely be reflections of persons in our timeline, but they act, think, and feel individually and thus may very well have their own souls.\nThe main character, then, would need to be fed a false explanation about how this is a “memory-entering machine” and that nothing he does in the memory matters. Each time the subject enters the “memory” he is actually creating a new branch in space-time and is killing another train’s worth of passengers, but he must not find out about this. Only by doing this can they have him achieve results without regard for the consequences of his actions.\nPerhaps the movie intended to present this idea all along, but I think they did a poor job if that is the case. Everybody in the movie knows that the machine is just playing back a memory, and so the main characters actions, however heroic and emotionally rich as they may be, are just the result of him not being able to think rationally and understand their explanation of what the machine actually does.\nWhat the movie needed was a single scene, wherein it is revealed to the viewer that the scientists are aware they are branching off new dimensions, and that are outright lying to the main character.\nEach time the scientists reassure the main character and convince him to try again, we see the moral dilemma that they are facing. They know that they are creating lives only to kill them repeatedly. Yet they must hide this knowledge and show a calm face because success of the mission is paramount. Each time they see the main character’s efforts to connect to people in the alternate timeline, they understand the meaning that this has but must discourage him and tell him that his actions are unproductive.\nHowever, it seems the main character has some intuition that something’s not right with their explanation. He shows an irrational care for the people in the scene he enters, and treats each as an actual person rather than as a shadow of one. The scientists try all they can to remind him that they are just memories of people who have already died, but he is not convinced.\nPerhaps instinctively, he shows a strong need to leave some trace of himself from within the timeline he enters. He tries to reach out to his father and improve his relationship with him, and he attempts to contact the government agency to say that the experiment was a success, leaving some trace of his efforts behind. If what he is entering is fact a separate timeline, then his actions have meaning, and shows his innate human need to have some trace of his life remain.\nThe addition of that single scene would add so much to the movie’s scope of philosophical exploration, and turn the movie into much more than a simple action thriller.\nOh well."},"posts/three-cups-of-tea":{"slug":"posts/three-cups-of-tea","filePath":"posts/three-cups-of-tea.md","title":"Three Cups of Tea","links":[],"tags":["nonprofit","poverty","education","samasource","review"],"content":"Three Cups of Tea is the most inspiring book I have ever read.\nIt is the true story following Greg Mortenson, a mountaineer who attempts to climb K2. On his way down, he stumbles into a tiny village in Pakistan and vows to return one day to build a school for the children there. He is successful, and is urged by others to continue building schools for underprivileged children across Pakistan. His story is remarkable, and the amount of impact he has managed to bring as one man with audacious goals is astounding.\nI felt a personal connection when he told of his experiences in Peshawar. Samasource works with a group of women in Peshawar who have collectively formed the Women’s Digital league, and they are now earning income through the internet. They were previously unable to do meaningful work outside of the home for cultural reasons, but now say that they are earning as much as the men, if not more. I dare not compare my work to Mortenson’s, but it felt great to learn that our goals are very similar.\nThis book reaffirmed my desire to do good, and I encourage you to find a copy."},"posts/transparent-leadership":{"slug":"posts/transparent-leadership","filePath":"posts/transparent-leadership.md","title":"Transparent Leadership","links":[],"tags":["leadership","communication","efficiency","collaboration","problem-solving"],"content":"From Transparent Leadership Beats Servant Leadership, by Chris at Entropic Thoughts:\n\nIn my book, a good leader\ncoaches people,\nconnects people,\n[…]\ncreates direct links between supply and demand (instead of deliberately making themselves a middle man),\n[…]\ngenerally makes themselves redundant.\n\nI really related with many of the points in this post. Coincidentally, I had just recently come to some similar conclusions at my own workplace, too.\nEffective leaders enable people to solve problems and make progress on their own, so the presence of the best leaders will probably be hard to notice.\nI am reminded of a quote from Lao-Tzu (or at least one version of its translation) that has stuck in my mind:\n\nA leader is best when people barely know he exists. When his work is done, his aim fulfilled, they will say: We did it ourselves.\n\nI would often place myself as a middle man in communications deliberately, especially when I was invested in the communication and the other parties involved were also busy doing other things at the same time. The intent was that I could steer the conversation to an efficient consensus, by framing the discussions and paraphrasing or summarizing (what I thought to be) the important points.\nIn reality though, I was often doing more harm than good.\nBy placing myself in the middle of communications, I make myself a bottleneck. If I was busy doing something else, I might delay responses, and it was often faster to just have the two people talk to each other directly.\nAnd when I put information through my own filter of what I felt was important or not, It’s too easy to get the nuance wrong. Even if things seemed to work out at the time, small differences in understanding can compound over time and turn into a bigger problem in the future. In these cases too, I think now that it’s more effective to just have everyone speak to each other directly.\nOf course, not everyone can be talking to everyone else all the time, and determining how much is too much might be an area where my input could help. But in general, I’m trying very hard not to speak for other people, and am trying instead to be someone who can connect people to each other quickly and efficiently."},"posts/universal-basic-income":{"slug":"posts/universal-basic-income","filePath":"posts/universal-basic-income.md","title":"Universal Basic Income","links":[],"tags":["economy","income","opinion","america","politics"],"content":"I wonder sometimes about what a better society than ours would be. What should our goals be as we try to improve?\nAs our society improves and we get more efficient, I like to imagine a future where we don’t have to work as much. That seems like a nice thing to aim for. Universal basic income (UBI) seems like one possible solution. If we could afford to give everybody a fixed minimal income, people could work less and still have a basic amount of wealth needed to survive. But I’m not yet convinced whether UBI is the correct answer to describe an ideal future.\nRobots and machines can do a lot of work for us. This is progress that could be applauded, but it’s feared instead. The main reason why we’re afraid of offloading work to machines is that we can’t live without money, and we can’t get money unless we are productive members of society. Capitalism is set up to make us want to stay busy. We seem to be stuck in a rut where we never stop building more things and make up fake jobs to stay busy.\nIf we let robots and machines do a lot of work for us, the downside is that many people will lose their jobs. This is where UBI comes in. If robots and machines and other general improvements allow us to create value more efficiently, the government could then redistribute the extra value to everyone in the form of a basic income.  Unemployment will be feared less if you don’t have to worry about how you’ll feed your family. UBI in some form seems necessary if we want to make life easier for everyone while still using money to pay for things. But I’m not yet convinced whether it’s the correct answer to describe an ideal future.\nMaking sure everyone has a basic ability to live a decent life sounds like a great goal for a government that exists to serve its citizens. On the other hand, capitalism promises rewards for great work, and that’s what motivated a lot of people to do great things. People spend millions of dollars researching medicine because a breakthrough drug could be worth billions. Redistribution of wealth will take away from those rewards, and a loss in motivation might lead to a decline in innovation.\nOne interesting example of UBI is The Alaska Permanent Fund. This program was set up as the Trans-Alaska Pipeline was being finished in 1977 and has been giving $1000-2000 to every citizen since 1982. This isn’t exactly UBI because it is tied to a new form of income that Alaska had access to, so it isn’t just redistribution of wealth. But in general, it has been working very well, and hasn’t increased unemployment or made people lazier."},"posts/upcoming-movie-watch":{"slug":"posts/upcoming-movie-watch","filePath":"posts/upcoming-movie-watch.md","title":"Upcoming Movie Watch","links":[],"tags":["personal","opinion","movie"],"content":"The Documentary Type\n Where in the World is Osama Bin Laden? - Before you write this movie off as one that sounds like it was done by those guys that make stupid teen movies (I almost did), go watch the trailer. It’s done by the guy who made Supersize Me, and chronicles his quest to find Osama Bin Laden. And the trailer plays Gogol Bordello music. Planet B-Boy - A documentary on the breakdancing culture. This movie looks awesome. Young at Heart - A group of elderly people in New England sing covers of great rock songs. This is a must-see.\nThe Artsy TypeLes Chansons D&#039;Amour - I’m really excited about this one. Three people are each in love with the other two and have a fascinating relationship. French musicals ftw.  The Visitor - College professor with a ho-hum life accidentally meets a young couple, and his life gets turned around when as they become friends. This movie looks really good.Smart People - The trailer didn’t impress me all that much, but I really want this movie to be a good one. I’ll keep my fingers crossed. O Ano em que Meus Pais Saíram De Férias - A Brazilian boy is taken in by his Jewish grandfather’s neighbor (?) when his parents are exiled. I can’t put my finger on it, but something about this movie really appeals to me. Backseat - Two guys go on a roadtrip to get away from life and have wild antics along the way. This movie will probably either be really good or pretty dumb, so I hope for the former. Son of Rambow - A movie about two boys filming a movie. It wowed the crowds at Sundance, and I think “delightful” would be a good word to describe it. They asked us to help promote the movie through Graffiti, and I wish we could’ve :(.  The Exciting Type Roman De Gare - Follows the stories of three people, who may not be exactly who they claim to be. I’m not sure if this is going to be a thriller, but it seems pretty exciting, and clever. I’m excited to see Dominique Pinon.Flawless - I love bank robbery movies! This one stars an unlikely duo trying to pull an inside job. Spiral - I personally will not be watching this, but if you’re into creepy, disturbing horror movies then this one’s for you.The Funny TypePriceless - Huzzah! Another rockstar French cast. It’s a remake of Breakfast at Tiffany’s, and it looks like it won’t disappoint. That, and I love Audrey Tautou. Forgetting Sarah Marshall - 40 Year Old Virgin? Knocked Up? Superbad? Yeah, their new one is coming out. Go watch it. You Don’t Mess with the Zohan - I haven’t been excited for an Adam Sandler movie in a while, but this one sure does look fun.Be Kind Rewind - A movie about Jack Black making movies? Heck yes! "},"posts/urban-isolation---skateboarding-in-an-empty-l.a.":{"slug":"posts/urban-isolation---skateboarding-in-an-empty-l.a.","filePath":"posts/urban-isolation---skateboarding-in-an-empty-l.a..md","title":"Urban Isolation - Skateboarding in an empty L.A.","links":[],"tags":["video","skateboarding","city","art"],"content":"A very relaxing video by Russell Houghten showing skateboarders riding around L.A. with all of the cars edited out. It’s executed wonderfully. How much effort goes into something like this?"},"posts/wag-buys-shares-back-from-softbank":{"slug":"posts/wag-buys-shares-back-from-softbank","filePath":"posts/wag-buys-shares-back-from-softbank.md","title":"Wag Buys Shares Back from SoftBank","links":[],"tags":["business","money","startup","investing","news"],"content":"\nWag was looking to raise 75 million. It went to SoftBank and was like “will you give us 75 million?” SoftBank was like “no haha we’ll give you 300 million,” because that is SoftBank’s whole thing, it loves to give startups vastly more money than they want or need. And so Wag took the money. And then like a year and a half later Wag will get rid of SoftBank by giving back, I don’t know, but I am going to say some number less than 225 million (“well below” the valuation at which it invested). Wag got the $75 million it needed for free.\n\nSo under the right circumstances, you can make more money with a flop than you can with a hit!\nWag wasn’t exactly a flop, but SoftBank’s aggressive investment strategy does result in some pretty unusual situations."},"posts/web-links---august-2022":{"slug":"posts/web-links---august-2022","filePath":"posts/web-links---august-2022.md","title":"Web Links - August 2022","links":[],"tags":["ai","conversation","diagrams","flowcharts"],"content":"\n  \n    Stable Diffusion install guide\n    (rentry.org)\n  \n  Install and run Stable Diffusion locally\n  \n    The Church of Interruption\n    (sambleckley.com)\n  \n  There are four conversational styles, divided on two axes. Most people who interrupt others are willing to be interrupted themselves, while other people dislike interrupting and being interrupted. These fundamental differences can cause awkwardness in conversation.\n  \n    Diagrams: A Native Diagram Editor for Mac\n    (diagrams.app)\n  \n  I was just looking for a good way to create flowcharts, and this looks just right\n"},"posts/web-links---july-2022":{"slug":"posts/web-links---july-2022","filePath":"posts/web-links---july-2022.md","title":"Web links - July 2022","links":[],"tags":["art","buddha","telescope","community","history"],"content":"\n\t\n\t\tMagic mirror&#039;: Hidden image revealed in reflection of centuries-old artifact at Cincinnati Art Museum\n\t\t(edition.cnn.com)\n\t\n\tA seemingly blank bronze mirror reflects an image of Buddha when shining a bright light onto it. Aside from how amazing it is that this was discovered, the craftsmanship is incredible.\n\t\n\t\tCompare Webb&#039;s Images to Hubble&#039;s\n\t\t(johnedchristensen.github.io)\n\t\n\tYes the images from the Webb telescope are beautiful, but direct comparisons like this really put it into perspective. And this shows the galaxy cluster as it was 4.6 billion years ago? I don&#039;t even know what to think about that.\n\t\n\t\tMendon, Missouri - Sean of the South\n\t\t(seandietrich.com)\n\t\n\tA short telling of how residents of a small town came together to help the victims of a rail road accident.\n"},"posts/web-links---june-2022":{"slug":"posts/web-links---june-2022","filePath":"posts/web-links---june-2022.md","title":"Web links - June 2022","links":[],"tags":["reddit","derogatory","experience","artwork","history"],"content":"\n\t\n\t\tCompound pejoratives on Reddit – from buttface to wankpuffin\n\t\t(colinmorris.github.io)\n\t\n\tA thorough analysis of the distribution of derogatory terms used on Reddit. Fascinating and hilarious.\n\t\n\t\tMy Out-of-Body Experience - Nautilus\n\t(nautil.us)\n\t\n\tReflections on the author&#039;s experience in a sensory deprivation tank.\n\t\n\t\tprompt.press - AI generated artwork inspired by current events\n\t\t(prompt.press)\n\t\n\tThe author mentioned that these are heavily curated, but nonetheless they are extremely compelling.\n\t\n\t\tGrumpy Gamer - Return to Monkey Island Trailer\n\t\t(www.grumpygamer.com)\n\t\n\t\n\t\tSerendeputy: Newsfeed Engine for the open web\n\t\t(serendeputy.com)\n\t\n\tI&#039;ve been thinking about a product like this for a very long time, so it must be a good idea. Depends heavily on who you follow though, so I would probably end up creating a separate account.\n\t\n\t\tShe Spent a Decade Writing Fake Russian History. Wikipedia Just Noticed.\n\t\t(www.sixthtone.com)\n\t\n"},"posts/web-links---november-2022":{"slug":"posts/web-links---november-2022","filePath":"posts/web-links---november-2022.md","title":"Web Links - November 2022","links":[],"tags":["collection","images","ai","story","narrative"],"content":"\n  \n    A.N. Lucas&#039;s 88x31 button Collection\n    (anlucas.neocities.org)\n  \n  A collection of classic web banner images.\n  \n    How to Run Stable Diffusion on Your PC to Generate AI Images\n    (www.howtogeek.com)\n  \n  For personal reference.\n  \n    If You Can&#039;t Answer These 6 Questions You Don&#039;t Have A Story - Glenn Gers\n    (www.youtube.com)\n  \n  The essence of a story is a character trying to accomplish something while people or things get in their way. Every character (not just the main one) is trying to accomplish something, and narrative is born each time they collide and get bumped off track, like billiard balls.\n"},"posts/web-links---october-2022":{"slug":"posts/web-links---october-2022","filePath":"posts/web-links---october-2022.md","title":"Web Links - October 2022","links":[],"tags":["roguelike","gaming","ai","space","economics"],"content":"\n  \n    How to Make a Roguelike\n    (www.gamedeveloper.com)\n  \n  Practical tips for how to plan and structure a new Roguelike game.\n  \n    &quot;Mechanical Neural Network&quot; Learns to Respond to Its Environment\n    (www.hackster.io)\n  \n  Flexible parts within a pattern of beams move and bend by reacting to magnetic fields. Future uses may include efficient aircraft wings or earthquake-resistant buildings.\n  \n    William Shatner: My Trip to Space Filled Me With Sadness\n    (variety.com)\n  \n  Expecting beauty, William Shatner looked out into space and saw only death. Life and beauty only exists on Earth, and its tininess and fragility was overwhelming.\n  \n    The Illustrated Stable Diffusion\n    (jalammar.github.io)\n  \n  An illustrated guide explaining how Stable Diffusion works\n  \n    Coolify\n    (coolify.io)\n  \n  An open-source &amp; self-hostable Heroku / Netlify alternative\n  \n    You weren&#039;t supposed to see that\n    (thereformedbroker.com)\n  \n  Powerful economic stimulus during the pandemic worked a little too well and made everyone&#039;s lives better. But we need to have both winners and losers, so now were are backpedaling to bring things back to normal, i.e. worse for the bottom rung.\n"},"posts/web-links---september-2022":{"slug":"posts/web-links---september-2022","filePath":"posts/web-links---september-2022.md","title":"Web Links - September 2022","links":[],"tags":["technology","exploit","rooting","education","creativity"],"content":"\n  \n    RootMyTV\n    (RootMyTV.github.io)\n  \n  A user-friendly exploit for rooting/jailbreaking LG webOS smart TVs.\n  \n    Has The Zodiac Killer Mystery Been Solved (Again)\n    (www.lamag.com)\n  \n  \n  \n    examples/stable-diffusion-finetuning at main · LambdaLabsML/examples\n    (github.com)\n  \n  Fine tune Stable Diffusion to generate pokemon images\n  \n    Brickit\n    (brickit.app)\n  \n  App scans a pile of your legos and gives you ideas to create, complete with detailed instructions.\n  \n    Twofer Goofer\n    (twofergoofer.com)\n  \n  Guess a pair of rhyming words based on their fictional definition.\n  \n    Excuse me but why are you eating so many frogs\n    (experimentalhistory.substack.com)\n  \n  Productivity hacks imply that you can trick yourself into doing things you don&#039;t want to do, in favor of things you&#039;d rather be doing. The author suggests that maybe you should instead stop forcing yourself to do so many unpleasant things.\n  \n    My family&#039;s unlikely homeschooling journey · fast.ai\n    (www.fast.ai)\n  \n  The pandemic forced this family into experimenting with homeschooling. With good resources and a strong local support system, they found that their new arrangement seemed to work better for their kids than traditional schools do.\n"},"posts/what-im-doing-now":{"slug":"posts/what-im-doing-now","filePath":"posts/what-im-doing-now.md","title":"What I'm doing /now","links":["projects"],"tags":["parenting","preschool","technology","hobbies","journaling"],"content":"Personal Life\nNothing much has changed for our family these past few years, and that is by design. Work is stable, life is stable, everybody is happy. I am very thankful for that.\nWork\nSince 2022 I have been leading a department that is tasked with making our studio better at creating new games. This involves encouraging all staff to submit game ideas at any time, working with people to strengthen game ideas and create attractive pitches, coaching teams through early development phases, maintaining a corporate strategy for the release of new games, and more. It allows me to work directly with a lot of people throughout the company, and has been tremendously fun.\nHobbies\nIn 2022 I joined a Haiku study group. We decide on a few prompts every month and submit our poems in advance of a meet-up, where we comment on each other’s pieces and have our teacher critique them. Haiku is fascinating because its extreme minimalism (only 17 characters allowed) makes it feel like putting together a puzzle. It is also a great way to learn about nature and Japanese culture.\nLast year I set up GoToSocial as a solo instance to join the Fediverse, and that has been a lot of fun. It’s nice to be social on the internet again. I think this has helped motivate me to update this site more, and I’m having a lot of fun making little updates to the site as well.\nAI tools have been super useful for programming as a hobby. It has made it so much easier to finish and ship my little projects, and I have already developed a slew of little utilities that I use often. I’m still writing words by hand though, because I think being able to organize my thoughts into communicative sentences is such an important skill.\nI also started keeping a physical journal at the beginning of this year, and one month is the longest I have ever kept up the habit so I am hopeful that it will continue. I had always admired people who keep physical journals; I thought it was a wonderful habit. I never could get into it though, and had resigned myself to thinking that I just wasn’t that kind of person. But my wife convinced me that if that is the kind of person I want to be, then it’s worth putting in the effort to make the change.\nSo far, I am really enjoying it. I’m using the most simple interpretation of Bullet Journal. It’s turning to be a super helpful framework to guide the kinds of information I should keep, and the format for recording it."},"posts/what-staying-home-has-been-like-for-me-so-far":{"slug":"posts/what-staying-home-has-been-like-for-me-so-far","filePath":"posts/what-staying-home-has-been-like-for-me-so-far.md","title":"What staying home has been like for me so far","links":[],"tags":["life","covid","work","home"],"content":"Things that changed\n\nI have more time in the morning to do things around the house instead of commuting\nRemote meetings are a little harder than in-person meetings\nI write daily reports about my work progress, equally to show my teammates that I’m staying on track, and to keep myself on track\nWe watch the news a lot more\nI don’t wear socks\nPushing my social life online has lead to me talking to friends more than before\n\nThings that didn’t change\n\nWaking up in the morning is hard\nWork hours are mostly the same, or a little longer from the lack of a commute\nThere is still a lot of work to do and I am busy\nI still shave and brush my teeth and shower\nI get dressed in the morning\nWe get groceries delivered once a week\nThe world is stressful, but being able to stay at home is a blessing so total stress balances out\nThe dog doesn’t seem to care that I’m around\n"},"posts/why-switch-cartridges-taste-awful":{"slug":"posts/why-switch-cartridges-taste-awful","filePath":"posts/why-switch-cartridges-taste-awful.md","title":"Why Switch Cartridges Taste Awful","links":[],"tags":["switch","tech","product","trivia","taste"],"content":"\nThe Nintendo Switch is designed to be portable, so it doesn’t have a disc drive. Instead, its games come on cartridges, just like games for Nintendo’s handheld platforms stretching back to the original Game Boy. But there’s something different about Switch cartridges: They taste awful.\nUpdate (March 2): In a statement emailed to Polygon, a Nintendo representative confirmed the theory that Switch cartridges are coated in a material that’s meant to dissuade people from putting the units in their mouths.\n\nSo Nintendo actually takes special steps to make their cartridges taste terrible, to keep people from swallowing them. That’s an attention to detail that I hadn’t even considered before."},"posts/why-vote":{"slug":"posts/why-vote","filePath":"posts/why-vote.md","title":"Why vote?","links":[],"tags":["politics","personal","opinion","vote"],"content":"People say that voting doesn’t really matter, because in the big picture, one vote for one candidate isn’t really going to make that much difference. And this is something that I’ve had a hard time coming to terms with too, but I think I figured it out.The point of voting is not to ensure that the right person gets elected or that the right ideas get placed in motion, because, as mentioned above, one vote is not really going to make a huge difference. Rather, I think the point of voting is to be aware of the issues and to care about them to the point where you are able to publicly commit to what you believe. Once you have enough people caring about issues and participating in the argument, then you can finally start seeing great changes that save people, nations, and ideals. We vote to preserve our right to argue. "},"posts/ゲームの空間認識と今後の進化":{"slug":"posts/ゲームの空間認識と今後の進化","filePath":"posts/ゲームの空間認識と今後の進化.md","title":"ゲームの空間認識と今後の進化","links":[],"tags":["game","mario","design","product","analysis"],"content":"チームラボの猪子氏がTEDxFukuokaで紹介した、日本と西洋での空間認識の違いについての話がとてもおもしろかったので紹介。\nマリオはなぜ世界でヒットしたのか？　チームラボ・猪子氏が語る、日本的空間認識とクリエイティビティの関係性\nプレゼンテーションの内容を省略すると、\n西洋の空間認識だと、パースペクティブを意識する。\nよって、絵の登場人物になりきると視点が変わって絵の全体を意識しなくなる。絵の全体の意識が変わる、と言う方が適切なのかもしれない。\n日本の空間認識だと、レイヤーで物を見て、重ねて表現する。\n絵の登場人物になりきっても、絵の認識が変わらず、絵の全体を意識し続ける。\nこれが、日本が産んだマリオやドラクエみたいなプラットフォーマーや、トップダウンRPGなどの表現を作ったゲームの原点で、アメリカではもっと登場人物の視点で遊ぶFPSなどが流行りやすい。\nとのこと。\nハードのスペックで3Dの表現ができなかったことも大きい、と想像しつつも、とても興味深い話。\nOculus Rift 用に開発中のLucky’s Taleの話を思い出した。\nLucky’s TaleはVR機能を活かした3Dのプラットフォーマーなのだが、自分が主人公になりきるわけではない。キャラクターの視点と自分の視点は完全に別で、自分が3Dの世界の中で、主人公の隣に居るという見せ方。\n開発者曰く、たくさんの案をとにかく作りまくっているうちに偶然出来上がったものだったが、少し遊んでみると体験の斬新さに全員が驚いた、とのこと。\n上の話に合わせると、VRなのでパースペクティブで入り込むのはほぼ必須として、それでもマリオのようにキャラと空間の全体の絵を意識し続けれるような、全く新しい形になっているような気がする。おそらく実際遊んでみないと体験を想像できないと思うので、リリースが楽しみだ。"},"posts/真如堂":{"slug":"posts/真如堂","filePath":"posts/真如堂.md","title":"真如堂","links":[],"tags":["kyoto","japan","photo"],"content":""}}